{"index": "10.1.5", "image": "resized_images/Vamana.png", "text": [" Prahlada’s grandson was Vali and Vali became very powerful.", " When he was the king of the asuras, there was a war between the devas and the asuras.", " The gods were defeated and were driven off from svarga.", " As always, the gods fled to Vishnu and began to pray to him to save them.", " Vishnu assured the gods that he would do something about Vali.", " Accordingly, Vishnu was born as the son of Aditi and Kashyapa.", " The son was a dwarf.", " King Vali had arranged for a huge sacrifice and had announced that, on the occasion of the sacrifice, he would not refuse anyone a boon.", " The dwarf arrived at this sacrifice and began to recite the Veda’s.", " Vali was so pleased at this that he offered the dwarf a bon.", " Vali’s guru(teacher) was Shukracharya and Shukracharya thought that there was something fishy about the way the dwarf had arrived.", " So he tried to restrain Vali.", " “No,” said Vali.", " “I have offered a boon and I shall stick to my word.", "” What boon do you desire?", " I will give whatever you want.", "” Before a boon was actually granted, a small rite had to be performed with holy water.", " Shukracharya was still trying to do his best to prevent the boon from being given.", " So he entered the vessel in which the holy water was kept to seal the mouth of the vessel and prevent the water from being taken out.", " To get at the holy water, the vessel was pierced with a straw.", " This straw also pierced one of Shukracharya’s eyes.", " Ever since that day, the preceptor of the demons has been one eyed.", " “Give me as much of land as may be covered in three of my steps,” said the dwarf.", " “I need this as dakshina (fee) for my guru.", "” Vali agreed.", " But the dwarf adopted a gigantic form.", " With one step he covered bhuloka.", " With another step he covered bhuvarloka.", " And with the last step he covered svarloka.", " The three worlds were thus lost to Vali and Vishnu returned them to Indra.", " Vali had no option but to go down to the underworld (patala).", " But so pleased was Vishnu at Vali’s generosity that he granted the asura the boon that he would bear the title of Indra in the future. "], "next": "10.1.6", "prev": "10.1.4", "title": "Vamana"}