{"index": "10.1.2", "image": "resized_images/Kurma.png", "text": " Many years ago there was a war between the devas (gods) and the daityas (demons) and the gods lost this war.\n They prayed to Vishnu to rescue them from the oppression of the demons.\n Vishnu told Brahma and the other gods that they should have a temporary truce with the demons.\n The two sides should get together to churn the ocean.\n Vishnu would ensure that the devas benefited more from this churning of the ocean than the daityas did.\n The truce was agreed upon and the two sides got ready to churn the ocean.\n The mountain Mandara was used as a churning rod and great sake Vasuki as the rope for churning.\n The devas grasped Vasuki’s tail and the daityas grasped Vasuki’s head.\n But as the churning began, the mountain Mandara which had no base, started to get immersed in the ocean.\n What was to be done?\n Lord Vishnu came to the rescue.\n He adopted the form of a turtle and the peak was balanced on the turtle’s back.\n As the churning continued, terrible poison named kalkuta emerged from the depths of the ocean and was swallowed by Shiva.\n Shiva’s throat became blue from this poison and he is therefore known as Nilakantha, blue of throat.\n The goddess Varuni, the goddess of wine (sura), came out next.\n The gods readily accepted her and thus they came to be known as suras.\n But the demons rejected Varuni and were therefore known as asuras.\n She was followed by the Parijata tree, a beautiful tree that came to occupy the pride of place in Indra’s garden.\n A jewel named koustubha emerged and was accepted by Vishnu as his adornment.\n Three wonderful animals came out next - the cow Kapila, the horse Ucchaishrava and the elephant Airavata.\n They were followed by the apsaras, beautiful women who became the dancers of heaven.\n They were known as apsaras because they emerged from ap (water).\n The goddess Lakshmi or Shri came out next and was united with Vishnu.\n Finally, Dhanvantari emerged with a pot of amrita (the life - giving drink) in his hands.\n Dhanvantari was the originator of medicine (ayurveda).\n The daityas led by Jambha gave half of the amrita to the devas and departed with the remaining half.\n But Vishnu quickly adopted the form of a beautiful woman.\n So beautiful was the woman that the demons were charmed.\n “Pretty lady,” they said.\n “ take the amrita and serve it to us.\n Marry us.\n” Vishnu accepted the amrita, but he had no intention of giving it to the demons.\n He served it to the gods instead.\n There was only one demon who was somewhat clever.\n His name was Rahu.\n He adopted the form of Chandra, the moon-god, and succeeded in drinking some of the amrita.\n The sun-god and the moon-god noticed what was happening and reported it to Vishnu.\n Vishnu thereupon cut off Rahu’s head with a sword.\n But Rahu had drunk the amrita, so he could not die.\n He prayed to Vishnu and Vishnu granted him a boon.\n The boon was that occasionally Rahu would be permitted to swallow up the sun and the complained about him.\n You can see this happening at the time of the solar and the lunar eclipses.\n People who give alms during such eclipses are blessed.\n The gods obtained the amrita and the demons did not.\n Thus, the gods became more powerful than the demons.\n They defeated the demons and regained heaven. ", "next": "10.1.3", "prev": "10.1.1", "title": "Kurma"}