{"index": "10.1.7", "image": "resized_images/Rama.png", "text": " Brahma came out of Vishnu’s navel. Brahma’s son was Marichi’s son Kashyapa, Kashyapa’s son Surya, Surya’s son Vaivasvata Manu, Manu’s son Ikshvaku, Ikskhvakku’s son Kakutstha, Kakutstha’s son Raghu, Raghu’s son Aja, Aja’s son Dasharatha, Dasharatha’s sons were Rama, Bharata, Lakshmana and Shatrughna. Since Rama was descended from Kakutstha and Raghu, he was also called Kakutstha and Raghava. Since his father’s name was Dasharatha, he was also called Dasharathi. Rama’s story belongs to the solar line (surya vansha), since one of his ancestors was Surya. Vishnu himself wished to destroy Ravana and the other rakshasas (demons). He therefore divided himself into four parts and was born as Rams, Bharata, Lakshmana and Shatrughna. Rama was Koushalya’s son, Bharata Kaikeyi’s. Lakshmana and Shartrughna were the sons of Sumitra. The sage Vishvamitra came to Dasharatha and pleaded for Rama’s help in defeating the rakshasas who were disturbing his yajanas. Rama killed these demons and Vishvamitra was so pleased that he taught Rama the use of all divine weapons. Rama broke a bow of Shiv’s that had been in the possession of the king of Mithila, Janaka. This was the task that had been appointed for marrying Sita, Janaka’s daughter. Rama married Sita, Lakshmana married urmila, Bharata married Mandavi and Shatrughna married Shrutakirti. On the way back to Ayodhya, Rama also beat Parashurama in a duel. Dasharatha resolved that Rama should be made yuvaraja, that is, the heir apparent to the kingdom. But Kaikeyi had a servant named Manthara who plotted otherwise. When he was young, Rama had pulled at Manthara’s feet and ever since that day, Manthara had not been kindly towards Rama. She reminded Kaikeyi of the two; boons that had been promised to her by King Dasharatha. Years ago, the gods had been fighting with the demon Shambara and had asked Dasharatha for his help. In fighting with Shambara, Dasharatha had been injured. He had been nursed back to health by Kaikeyi. Dasharatha had promised two boons to Kaikeyi as a reward and Manthara’s suggestion was that Kaikeyi should now ask for these two boons. By the first boon Rama would be banished to the forest for fourteen years and by the second boon Bharata would become yuvaraja. Kaikeyi listened to Manthara. At Manthara’s instance, she asked for these two boons. Dasharatha was very angry, but Rama insisted that he would indeed go to the forest for fourteen years. Rama, Lakshmana and Sita first went to the banks of the river Tamasa. From there they went to the kingdom of Guha, the king of the hunters (nishadas). They crossed the river Jahnavi and arrived in Prayaga, where the sage Bharadvaja had his hermitage. Their final destination was the mountain range of Chitrakuta, on the banks of the river Mandakini. Meanwhile, back home in Ayodhaya, King Dasharatha who could not bear to be parted from Rama, died. Bharata and Shatrughna had gone on a visit to their uncle’s house and were recalled. But Bharatha refused to be king. He went to the forest to try and persuade Rama to return, but Rama insisted that he would not return before the fourteen years were over. So Bharata brought back Rama’s sandals. He placed these sandals on the throne as a token of Rama’s kingship. And he began to rule the kingdom in Rama’s name from Nandigrama, rather than from Ayodhya. Rama, Lakshmana and Sita then went to the forest that is known as the Dandaka forest, dandakaranya. This forest was on the banks of the river Godavari and there was a beautiful lgrove inside the forest known as Panchavati. They built a hut there and resolved to live there. There was a rakshasa woman named Shurpanakha. She happened to come to the place where Rama Lakshmana and Sita had built their hut. Shurpanakha liked Rama so much that she wanted to marry Rama and eat up Lakshmana and Sita. But Lakshmana cut off Shurpanakha’s nose and ears with his sword. Shurpanakha fled to brother Khara and demanded revenge. Khara and fourteen thousand other demons (rakshasas) attacked Rama, but they were all killed by Rama. Shurpanakha then went to her other brother Ravana, the king of Lanka. Ravana asked the rakshasa Maricha to adopt the form of a golden deer and roam around in front of Rama’s hut. Sita was so charmed by the deer that she asked Rama to capture it for her. Rama was long in returning and Lakshmana went to look for him. Taking advantage of Rama and Lakshmana’s absence, Ravana kidnapped Sita. Jatayu, the king of the birds, did try to stop Ravana, but he met his death at Ravana’s hands. Rama and Lakshmana were greatly distressed to find Sita missing and they looked for her everywhere. Rama made friends with the monkey Sugriva. He killed Sugriva’s brother Bali and made Sugriva the king of monkeys. The monkeys were sent off in all the four directions to look for Sita. The monkeys who had gone towards the south learnt that Sita was in Lanka, across the ocean. One of these monkeys was Hanumana. Hanumana leapt over the ocean and arrived in Lanka. He discovered the lonesome Sita in a grove of ashoka trees, the ashokavana. Hanumana introduced himself and assured Sita that he would soon be back with Rama. Hanumana caused some general havoc in Lanka and was captured by Meghnada or Indrajit, Ravana’s son. Ravana ordered that Hanumana’s tail should be set on fire. But Hanumana used his burning tail to set fire to all the houses of Lanka. He then returned to Rama with the news that Sita had been found. Rama, Lakshmana and the army of monkeys arrived at the shores of the ocean. There they built a bridge over the ocean so that they could cross over into Lanka. There was a terrible war in which Rama killed the giant Kumbhakarna, Ravana’s brother. Lakshmana killed Indrajit. Rama killed Ravana with a powerful divine weapon, the brahmastra. The fourteen years were by now over and Rama, Lakshmana and Sita returned to Ayodhya. There Rama was crowned king and he treated his subjects as his own sons. He punished the wicked and followed the path of dharma. During Rama’s rule there was no shortage of foodgrains anywhere and the people were righteous. No one died an untimely death. On Rama’s instructions, Shatrughna killed the asura Lavana and built the city of Mathura in the place where Lavana’s kingdom had been. Bharata was sent by Rama to kill a wicked gandharva, a singer of heaven named Shailusha, who lived on the banks of the river Indus with his sons. Bharata killed them and built two cities there, Takshashila and Pushkaravati. In Takshashila Bharata established his son Ataksha as king and in Pushkaravati he made his son pushkara the king. Rama and Sita had two sons named Kusha and Lava. Rama ruled for eleven thousand years before he died. This is the story of the Ramayana as recounted in the Agni Purana. It was written by the sage Valmiki after he had heard the story from the sage Narada. Rama was the seventh avatara of Vishnu, Krishna was the eighth. ", "next": "10.2", "prev": "10.1.6", "title": "Rama"}