{"index": "10.1.4", "image": "resized_images/Narasimha.png", "text": " Hiranyaksha had a brother named Hiranyakashipu. Hiranyakashipu was furious to learn that his brother had been killed and the resolved to kill Vishnu. But this could not be done unless h e himself became powerful land invincible. Hiranyakashipu, therefore, began to pray to Brahma through difficult meditation. Brahma was pleased at these prayers and offered to grant a boon. “I want to be invincible,” said Hiranyakashipu. “Please grant me the boon that I may not be killed by night or day; that I may not be killed by man or beast; and that I may not be killed in the sky, the water or the earth.” Brahma granted the desired boon. And Hiranyakashipu was happy. He thought that he had taken care of all possible eventualities. And since he had become so powerful, he conquered all the three worlds and kicked the gods out to heaven. Hiranyakashipu had a son named Prahlada. You no doubt remember that Hiranyakashipu had resolved to kill Vishnu. But strangely enough, Prahlada became devoted to Vishnu. Hiranyakashipu tried to persuade his son. That did not work. He tried to kill his son. That too did not work since each time, Vishnu intervened to save Prahlada. Meanwhile, the gods had been driven off from heaven. They had also been deprived of their shares in yajanas by Hiranyakashipu. These shares now went only to the asura king. In desperation, they went and prayed to Vishnu and Vishnu promised them that he would find a solution. One day, Hiranyakashipu called Prahlada to him. “How is it that you escaped each time I tried to kill you?”, he asked. “Because Vishnu saved me,” replied Prahlada. “Vishnu is everywhere.” “What do you mean everywhere?”, retorted Hiranyakashipu. He pointed to a crystal pillar inside the palace and asked, “Is Vishnu inside this pillar as well?” “Yes,” replied Prahlada. “Very well then. I am going to kick the pillar,” said Hiranyakashipu. When Hiranyakashipu kicked the pillar, it broke into two. And from inside the pillar, Vishnu emerged in his form of half-man and half-lion. He caught hold of Hiranyakashipu and placed the demon across his thighs. And with his claws, he tore apart the demon’s chest and so killed him. Brahma’s boon had been that Hiranyakashipu would not be killed by man or beast. But then narasimha was neither man nor beast it was half-man and half-beast. The boon had said that the asura would not be killed in the sky, the water or the earth. But Hiranyakashipu was killed on Vishnu’s thighs, which were not the sky. The water or the earth. And finally, the noon had promised that Hiranyakashipu would not be killed by night or day. Since the incident took place in the evening, it was not night or day. After Hiranyakashipu died, the gods were restored to their rightful places. Vishnu's made Prahlada the king of the asuras. ", "next": "10.1.5", "prev": "10.1.3", "title": "Narasimha"}