{"index": "10.2.1", "image": "resized_images/The Harivamsha.png", "text": [" As you have already been told, Brahma emerged from Vishnu’s navel.", " Brahma’s son was Atri, Atri’s son Soma, Soma’s son Pururava, Pururava’s son Ayu, Ayu’s son Nahusha and Nahushja’s son Yayati.", " Yayati had two wives, Devayani and Sharmishtha.", " Devayani had two sons, Yadu and Turvusu.", " And Sharmishtha had three sons, Druhya, Anu and Puru.", " The descendants of Yadu were known as the Yadavas.", " Vasudeva was a Yadava.", " His wife was Devaki.", " Vishnu was born as sthe son of Vasudeva and Devaki in order to remove the wicked from the world.", " The seventh son of Vasudeva and Devaki was Baladeva.", " And the eight son was Krishna himself.", " Krishna was born in the month of Bhadra in the thick of the night.", " Scared that the wicked Kakmsa might kill the newly born child, Vasudeva left him with Yashoda, the wife of Nanda.", " Nanda was the king of the cowherds and he brought up Baladeva and Krishna.", " Kamsa sent a rakshasa woman named Putana to kill Krishna but Krishna killed her instead.", " In Vrindavana, Krishna subdued the terrible snake known as Kaliya.", " He killed several other rakshasas named Arishta, Vrishabha, Keshi, Dhenuka and Gardhabha and made the country safe from the attacksof these demons.", " He also stopped the worship of Indra.", " This led to a fight between Indra and Krishna, Indra tried to destroy the inhabitants of Gokula by sending down torrents of rain.", " But Krishna held aloft the mountain Govardhana and saved the inhabitants of Gokula.", " Kamsa’s capital was in Mathura, Baladeva and Krishna went there.", " Kamsa let loose a mad elephant named Kuvalayapida on Krishna.", " But Krishna killed Kuvalayapida.", " Baladeva and Krishna also killed two strong wrestlers, Chanura and Mushtika, whom Kamsa had instructed to kill Baladeva and Krishna.", " Finally, Krishna killed Kamsa and made Ugrasena the king.", " Kamsa was Jarasandha’s son-in-law and Jarasandha became furious when he learnt of Kamsa’s death.", " He attacked the Yadavas and laid siege to the city of Mathura.", " After a prolonged war, Krishna managed to defeat Jarasandha.", " Krishna also defeated another evil king named Poundraka.", " On Krishna’s instructions, the Yadavas built the beautiful city of Dvaraka or Dvaravati.", " The Yadavas began to live in Dvaraka.", " There was an asura named Naraka who was killed by Krishna.", " Naraka had imprisoned sixteen thousand daughters of the devas, gandharvas and yakshas (guards of Heaven’s treasury).", " These women were freed by Krishna and Krishna married all of them.", " Amongst Krishna’s other exploits were defeating the daitya Panchajana, killing Kalayavna, seizing the parijata tree from Indra and bringing back to life the sage Sandipani’s dead son.", " Krishna had several sons.", " Shamba was born of Krishna’s wife Jambavati and Pradyumna was born of Krishna’s wife Rukmini.", " As soon as Pradyumna was born, he was abducted by the asura Shambara.", " Shambara threw the baby into the sea, but a fish swallowed the baby.", " A fisherman caught the fish and brought it to Shambara’s house.", " When the fish’s stomach was cut open, the baby came out.", " There was a woman named Mayavati who lived in Shambara’s house and Shambara handed over baby Pradyumna to Mayavati so that he might be brought up well.", " When he grew up, Pradyumna killed Shambara and married Mayavati.", " They returned to dvaraka and Krishna was very happy to see his lost son.", " Pradyumma and Mayavati had a son named Aniruddha.", " Aniruddha secretly married Usha, the daughter of King Vana, Vana himself being the son of Vali.", " Vana’s capital was in a city named Shonitapura.", " Vana had pleased Shiva through hard and difficult tapasya, so that sometimes he was called the son of Shiva.", " Vana loved to fight and he had wanted a boon from Shiva that he might get the chance to fight with someone who was his equal in battle.", " A flag with a peacock on it used to fly from the ramparts of Vana’s palace.", " Shiva told him the day this flag fell down.", " Vana’s desire for with an equal would be satisfied.", " With the help of a friend of Usha’s, Anuruddha and Usha used to meet secretly in Vana’s palace.", " Vana’s guards informed him about this and there was a fierce battle between Vana and Aniruddha At the same time, the flag with the peacock on it fell down.", " Krishna got to know from Narada about the fight between Vana and Aniruddha and he, Baladeva and Pradyumna arrived in Vana’s capital.", " Shiva came to fight on Vana’s side, accompanied by Nandi and Skanda or Kartikeya.", " But after a duel that lasted for a long time, Krishna triumphed over these enemies.", " Krishna’s arrows also cut off the thousand arms that Vana had.", " But at Shiva’s request, Krishna spared Vana’s life and gave two arms with which to make do.", " All of these stories about Krishna are related in detail in the Harivamsha.", " The Agni Purana merely gives a brief summary of the Harivamsha.", " But stories about Krishna, the eight avatara of Vishnu, also crop up in the Mahabharata.", " The Agni Purana, therefore, next summarises the Mahabharata. "], "next": "10.2.2", "prev": "10.2", "title": "The Harivamsha"}