{"index": "10.2.2", "image": "resized_images/The Mahabharat.png", "text": [" The Pandavas were merely a pretext.", " Krishna used the Pandavas to rid the world of evil men.", " You have already learnt that one of Yayati’s sons was Puru.", " In Puru’s line were born Bharata and Kuru.", " One of Kuru’s descendants was the king Shantanu.", " Shantanu married Ganga and Bhishma was born from this marriage.", " But Shantanu also married Satyavati and had two more sons, Chitrangada and Vichitravirya.", " Bhishma never married.", " Chitrangada died young.", " When Vichitravirya grew up, Bhishma defeated the king of Kashi and brought two of the king’s daughters, Ambika and Ambalika, as brides for Vichitravirya.", " Vichitravirya as also quite young when he died of tuberculosis.", " Since Vichitravirya had left no children, Vyasadeva was brought to Hastinapura.", " Vyasadeva and Ambalika had a son named Dhritarashtra and Vyasadeva and Ambalika had a son named Pandu.", " Dhritarashtra married Gandhari and they had a hundred sons, of whom the most important was Duryodhana.", " Pandu had two wives, Kunti and Madri.", " Kunti’s sons were Yudhishthira, Bhima and Arjuna and Madri’s sons were Nakula and Sahadeva.", " But Yudhishthira was really the son of the god Dharma and not Pandu’s son.", " Similarly, Bhima was the son of the god Pavana, Arjuna the son of Indra and Nakula and Sahadeva the sons of the two Ashvinis.", " Earlier, Kunti had a son named Karna from the sun-god.", " This was before she had god married to Pandu.", " Karna became a friend of Duryodhana’s.", " Because of a curse imposed on him by a sage, Pandu died in the forest.", " Duryodhana tried his best to kill the Pandavas.", " He set fire to a house of lac (jatugriha) in which Kunti and the five Pandavas were staying.", " But the Pandavas were saved and fled to a city named Ekachakra.", " There they lived, disguised as brahmanas.", " In Ekachakra, they destroyed a rakshasa named Vaka.", " They then won the hand of the daughter of the king of Panchala.", " Her name was Droupadi and all five Pandava brothers married her.", " When Duryodhana learnt that the Pandavas were alive, he handed over half the kingdom to them.", " Meanwhile, the forest Khandava had to be burnt and Krishna and Arjuna did this together.", " Krishna had befriended Arjuna.", " When Arjuna successfully defeated the god Agni at the burning of the Khandava forest, Agni gave him several divine weapons.", " Arjuna had also obtained divine weapons from his guru Dronacharya.", " On the Pandava side, Yudhishthira had become king.", " The Pandavas organised a rajasuya yajna (royal sacrifice) in which they conquered several kingdoms and accumulated lot of wealth.", " This made Duryodhana envious.", " He arranged a game of dice (aksha) between Yudhishthira and Duryodhana’s uncle Shakuni.", " Shakuni did not play fairly and Yudhishthira lost the game.", " As penalty for the loss, the Pandavas were to spend twelve years in the forest and one additional year without being detected.", " Droupadi went with them to the forest, as did the Pandava’s priest, Dhoumya.", " After the twelve years were over, the Pandavas came to the kingdom of King Virata where they proposed to spend the additional year that had to be spent in disguises.", " Yudhishthira pretended to be a brahmana, Bhima a cook, Arjuna a dancer, Nakula and Sahadeva stable-hands.", " Droupadi became the queen’s maid.", " The queen’s brother Kichaka tried to molest Droupadi, but was killed by Bhima.", " When the year was over, the Kauravas attacked King Virata to rob him of his cattle.", " But Arjuna defeated all the Kauravas and saved Virata’s cattle After this success, the identity of the Pandavas could no longer be kept a secret.", " But thankfully, the one year during which identities had to be kept a secret, was over.", " King Virata’s daughter Uttara was married to Abhimanyu, Arjuna’s son.", " Abhimanyu’s mother was Subhadra, whom Arjuna had married.", " Subhadra also happened to be Krishna’s sister.", " The Pandavas now demanded their rightful share of the kingdom, but Duryodhana refused.", " A war was imminent.", " A huge battalion of soldiers was known as an akshouhini.", " Duryodhana collected eleven akshouhinis for the war and Yudhishthira collected seven.", " Krishna was sent as a messenger to Duryodhana to try and preserve the peace.", " Krishna told Duryodhana that the Pandavas would be satisfied with a mere five villages.", " Duryodhana refused to give them even this without a fight.", " So the armies gathered for a war on the plains of Kurukshetra.", " Noticing that elders and relatives like Bhishma and Dronacharya were fighting on the side of the Kaurvas, Arjuna was reluctant to fight.", " But Krishna gave Arjuna lessons which have come down to us as the Gita.", " He taught there was no reason for sorrow if Bhishma or Dronacharya died, that was only a death of their physical bodies.", " The true identity of a person was his atman (soul) which never died, but passed from one body to another.", " True bliss was obtained when the atman united with the brahman (divine essence) or paramatman (supreme soul).", " This was always the goal of a yogi, that is, a person who sought union with god.", " Thus instructed by Krishna, Arjuna started to fight.", " With the help of Shikhandi, he defeated Bhishma.", " This happened on the tenth day of the fighting.", " Bhishma did not however die.", " He had earlier received the boon that he would only die when he actually wished to do so.", " For many days, he lay there in the battlefield on a bed of arrows.", " After Bhishma’s defeat, Dronacharya became the general on the Pandava side.", " Dronaharya killed Virata, Drupada and several other kings and soldiers on the Pandava side.", " Dhrishtadyumna also killed many Kaurava soldiers.", " On the fifteenth day of the fighting, a rumour gained currency that Ashvatthama, Dronacharya’s son, had been killed.", " Dronacharya abandoned his weapons on hearing this bad news and Dhrishtadyumna faced no problems in killing him.", " Karna now became the Kaurava general and lasted for two and a half days before he was killed by Arjuna.", " Shalya was the last Kaurava general.", " He fought for only half a day and was killed by Yudhishthira.", " Bhima and Duryodhana fought the last duel of the war with maces.", " Bhima broke Duryodhana’s thighs and killed him.", " Ashvatthama had been fuming ever since his father Dronacharya had been killed by unfair means.", " In the dead of the night, he entered the Pandava camp where he killed Dhrishtadyumna and the five sons of Droupadi.", " Droupadi was disconsolate and demanded revenge.", " Arjuna and Ashvatthama let loose divine weapons at each other.", " Since this might destroy the world, they were asked to withdraw these weapons.", " Arjuna could withdraw his weapon, but Ashvatthama could not.", " Ashvatthama’s weapon killed the baby that was in Uttara’s womb, but when the dead baby was born, Krishna brought it back to life.", " This baby was Parikshita.", " Many kings and soldiers died in the course of the Kurukshetra war.", " The only ones left alive were Kritvarma, Kripacharya and Ashvatthama on the Kaurava side and Pandava side.", " After the war was over, Bhishma taught Yudhishthira the duties of king.", " It was only after this that he died.", " As a king, Yudhishthira performed many yajnas and gave a lot of to brahmanas.", " When Yudhishthira learnt that the Yadvas had been destroyed, he no longer wished to rule.", " He handed over the kingdom to Parikshita and the Pandavas left on a pilgrimage, in the course of which they died.", " It was Krishna who had used the Pandavas as a tool to rid the world of evil kings and establish the good ones.", " Realising that the Yadavas were also evil, Krishna also ensured that the Yadavas would be destroyed.", " He then gave up his life at the place of pilgrimage that is known as Prabhasa.", " After Krishna died, the city of Dvarka was swallowed up by the sea. This was the story of the eighth avatara of Vishnu. "], "next": "10.3", "prev": "10.2.1", "title": "The Mahabharat"}