{"index": "10.4.1", "image": "resized_images/How to Pray, How to Build Temples and Deities.png", "text": [" The Agni purana next has several chapters on how to pray and on how to build temples and idols.", " The Techniques of praying to Vishnu , Shiva, Surya and the other gods and goddesses are described, including the special mantras (incantations)that must be used so as to please specific gods and there are prescribed forms for such bathing as well.", " A Person who builds temples is blessed.", " Even if one merely thinks of building temples, the sins of a hundred lives are forgiven.", " A builder of a single temple goes to heaven (svarga).", " A builder of five to shivaloka, a builder of eight vishnuloka and a builder of sixteen temples is freed from the shackles of being born again and again.", " What is the point of earning money if one does not build temples?", " Money is also meant to be donated as alms to brahmanas, but the punya or merit earned from building a temple is greater than the punya earned from donating alms.", " The merit earned by builder of temples is greatest for a golden temple, lesser for a stone temple, still lesser for a wooden temple and least from earthen Temple.", " More punya is acquired from building an idol than from building a temple.", " Idols of gods and goddesses should always be set up so that they face the city;", " they should not face away from the city.", " The easy is for Brahma’s.", " Vishnu idol can be setup anywhere at all.", " Different idols of Vishnu must have different forms.", " Consider, for example, idols or images of the ten incarnations of Vishnu.", " The matsya (fish) avatara must naturally look like a fish and the kurma (turtle) avatara must look like a turtle.", " But the varaha (boar) avatara will four arms like a man and will hold a gada (mace), a padma (lotus flower), a shankha (conch shell) and a chakra (bladed discuss) in these four arms.", " The narasimha avatara should have two arms holding a chakra and a gada and should wear a garland.", " The vamana (dwarf) avatara should hold an umbrella and a stick in his two hands.", " Parashurama will have four hands with a bow.", " arrows, a sword and an axe in these hands.", " Rama’s image can have either two arms or four.", " If there are four arms, the four hands will hold a bow, arrows, a conch shell and a chakra.", " Balarama’s image may also have either four arms or two.", " If there are two arms, the four arms the hands will hold a plough, a conch shell, a club and a chakra.", " Buddha’s image should have a calm appearance.", " It should be seated on a lotus.", " The ears should be elongated Kalka’s image is that of a brahmana, seated on a horse and holding a bow and arrows, a conch shell, a sword and a chakra.", " Krishna’s image may be either two-armed or four-armed.", " Three of the four arms will hold a gada, a chakra and a shankha.", " The fourth palm will be opened out in the act of granting a boon.", " On either side of Krishna’s image, there will be images of Brahma and Shiva.", " Brahma has four faces and four arms and the image should have a pronounced rides a swan .", " On either side of Brahma’s image, there will be images of Sarasvati and Savitri.", " Vishnu’s image has eight arms.", " Seven of the arms hold a sword, a mace, arrow, a bow, a shield, a chakra and a conch shell.", " The eighth palm is spread out as if Vishnu is granting a boon.", " Vishnu should be shown riding on Garuda.", " Garuda will also have eight arms.", " To the right of Vishnu’s image, there should be images of Lakshmi and Sarasvati, Lakshmi holding a lotus and Sarasvati holding a veena (a musical instrument).", " There has also got to be and image of Vishnu exhibiting his universal form (vishvarupa).", " The Vishavrupa image has four heads and twenty arms.", " Chandi’s image has twenty arms.", " The ten arms on the right hold a spear, a sword, a shakti (a small spear), a chakra, a pasha (noose), a shield, a drum and any two other weapons.", " The ten arms on the left hold snakes a rod, an axe, an amkusha (used for driving elephants), a bow, a bell, a flag, a mace a mirror and a cub.", " In front of Chandi’s image there will be the image of a buffalo with its head cut off.", " The image of an asura will be shown emerging from the body of the buffalo.", " The demon’s hair, eyes and garland will be red in colour.", " It will be shown to be vomiting blood and it will hold weapons in its hand, The demon’s neck will be on the lion and her left leg will be on the demon’s back Images of Chandi may sometimes also have ten sixteen or eighteen arms.", " Shiva’s image (linga) may be made out of earth, wood, iron, jewels, gold, silver, copper, bronze or mercury. "], "next": "10.4.2", "prev": "10.4", "title": "How to Pray, How to Build Temples and Deities"}