{"index": "10.4.2", "image": "resized_images/Places of Pilgrimage.png", "text": [" A visit to a place of pilgrimage (tirtha) brings the same punya that is obtained from performing a yajna.", " It is because people had not gone on pilgrimages or donated gold and cows in their earlier lives that they were born poor in their next lives.", " The best place of pilgrimage is Pushkara, Brahma, other gods and sages who wish to go to heaven live there.", " The best time to go to Pushkara is in the month of Kartika.", " In Pushkara itself there are two other places of pilgrimage known as Jambumarga and Tandulikashrama.", " It is difficult to go to Pushkara.", " But there are several other tirthas as well.", " One such is Kurukshetra, where Vishnu and the other gods keep on coming.", " The river Sarasvati flows near Kurukshetra.", " If one bathes in the Sarasvati, one attains brahmaloka.", " Any region through which the river Ganga flows also becomes a tirtha.", " Even if one sees the Ganga, the punya of per forming yajnas is attained.", " A person who bears earth from the bed of the Ganga on his head is freed of all sins.", " Prayaga is another famous place of pilgrimage.", " Brahma, Vishnu, Indra and the other gods, gandharvas, apsaras and the sages are always there in Prayaga.", " This is because the two holy rivers, Ganga and Yamuna, come together in Prayaga.", " There are many tirthas inside Prayaga itself.", " The sages have said that, in the month of Magha, if one bathes for three days in Prayaga, that is better than donating crores and crores of cows.", " If one donates alms in Prayaga, one goes to svarga and is born as a king in one’s next life.", " If one dies in Prayaga, one goes straight to vishnuloka.", " Shiva himself had told Parvati that Varanasi was a very holy tirtha and that Shiva never left the city.", " Varanasi is so named because it is located at the junction of two rivers, Varana and Asi.", " Varanasi is also known as Kashi.", " The river Narmada is also sacred.", " There may be several holy tirthas, but Gaya is the holiest of them all.", " A demon named Gayasura once started to perform and such were the powers of his tapasya that the gods began to suffer.", " They went to Vishnu and asked him to save them Vishnu agreed and appeared before Gayasura.", " “Accept a boon,” said Vishnu.", " “Grant me the boon that I may become the most sacred of all tirthas,” replied the daitya.", " The boon was granted and Gayasura disappeared.", " The gods returned to svarga, but felt that the earth seemed to be deserted now that Gayasura had disappeared.", " Vishnu then instructed Brahma and the other gods to perform a sacrifice.", " He also asked them to go to Gayasura and ask for his body so that the sacrifice might be performed on it.", " Gayasura readily agreed, and as soon as he agreed, his head fell off from the body, Brahma then proceeded to perform the sacrifice on Gayasura’s headless body.", " But as soon as the sacrifice started, the body began to shake.", " This meant that the sacrifice could not be properly performed and a solution had to be found.", " The solution was that the gods should all enter a stone which would be placed on Gayasura’s body so that the body would not shake.", " The sacrifice could then be performed.", " Vishnu himself also entered the stone.", " It is because the gods and Vishnu are always there in Gaya that Gaya is sacred.", " In fact, there is a story behind this stones as well.", " The sage Marichi was Brahma’s son and had married Dharmavrata.", " One day, Marichi went to the forest to collect wood and flowers and returned extremely tired.", " He called Dharmavrata and said, “I am very tired.", " Today you must wash my feet for me.", "” Dharmavrata began to wash Marichi’s feet when Brahma suddenly arrived.", " Dharmavrata did not know what to do.", " Should she finish washing her husband’s feet?", " Or should she first attend to Brahma, since Brahma-was Marichi’s father?", " She decided to attend to Brahma first.", " At this Marichi became very angry and cursed Dharmavrata that she would turn into a stone.", " Dharmavrata was greatly distressed at being cursed for what she thought had not been a fault at all.", " So she performed tapasya for many years.", " When Vishnu and the other gods were pleased at Dharmavrata’s meditation, they appeared and offered to grant her a boon.", " Dharmavrata wished that the curse imposed on her by Marichi might be waived.", " The gods explained that this was impossible, since Marichi was a very powerful sage.", " What they would however, do was to make Dharmavrata a very holy stone desired even by the gods.", " The gods promised to be always inside this stone.", " It was this stone that was placed on Gayasura’s body.", " Once the sacrifice was over, Gayasura himself desired a boon from the gods and the gods granted him that Gaya would become the most sacred of all tirthas. It was in Gaya that the Pandavas had prayed to Vishnu. "], "next": "10.4.3", "prev": "10.4.1", "title": "Places of Pilgrimage"}