{"index": "10.5.2", "image": "resized_images/Varnashrama Dharma.png", "text": [" All the Manus practised the precepts of dharma (righteousness).", " This meant non-violence, truthfulness, piety, going on pilgrimages donating alms, serving devas and brahmanas, tolerance of all religions and the following of the sacred texts.", " It also meant the practice of the system of the four classes (varna) and the four stages in life (ashrama).", " The four varnas are brahmanas, kshatriyas, vaishyas and shudras.", " Performing sacrifices, donating alms and studying the Vedas are duties that brahmanas, kshatriyas and vaishyas must perform.", " In addition, the kshatriyas must protect the good and punish the evil.", " The vaishyas must take care of trade, agriculture and animal husbandry.", " The duties of shudras are to serve the brahmanas and artisanship.", " When brahmanas take up the upavita, the sacred thread that is the mark of the first three classes, it is like a second birth for them.", " So brahmanas are known as dvijas(born twice).", " An anuloma marriage is a marriage where the husband is from a higher class than the wife.", " The offspring of such a marriage belong to the mothers class.", " A pratiloma marriage is a marriage where the wife is from a higher class than the husband.", " Chandalas were born this way from brahmana women, Sutas from kshatriya women, Devalas from vaishya women, Pukkashas from kshatriya women and Magadhas from vaishya women.", " Chandalas are executioneers, Sutas charioteers, Devalas guards, Pukkashas hunters and Magadhas bards.", " Chandalas should live outside the villages and should not touch those belonging to any other class.", " The best name for a brahmana is that which ends in Sharma.", " Similarly, the best name for a kshatriya ends in Varma, for a vaishya in Gupta and for a shudra in Dasa.", " The sacred thread ceremony is to be held at the age of eight years for brahmanas, eleven years for kshatriyas and twelve years for vaishyas.", " No sacred a thread ceremony should be held beyond sixteen years of age.", " The first stage in life is that of brahmacharya (studenthood).", " A student should never eat honey or meat and should never indulge in singing or dancing.", " He should completely give up violence and speaking to women.", " His duties are to discuss the shastras (holy texts) and associate with learned men.", " Apart from that, he will meditate in solitude on the true nature of the brahman.", " The next stage of life is that of garhasthya (household stage).", " A brahmana may have four wives, a kshatriya three, a vaishya two and a shudra only one.", " The husband and the wife should be from the same varna.", " Marriage across varna is to be avoided.", " A woman can marry again provided that her husband has disappeared, is dead.", " has become a hermit or is such a sinner that he is expelled from his own varna.", " If her husband dies, a widow is permitted to marry her late husband’s younger brother.", " A householder should get up at dawn and pray to the gods.", " He should always bathe in the morning.", " He should not talk impolitely.", " He should not bite his nails.", " He should not laugh at those who are inferior.", " And he should never reside in a place where there is no king, no doctor or no river.", " He must not insult his elders.", " He should never criticise the Vedas, the shastras, the devas, the sages and the king.", " And he must never travel without a light at night.", " The third ashrama is vanaprastha (forest - dwelling stage).", " Such a person should always sleep on the ground and wear skins as clothes.", " He should wear his hair matted and give up the company of other people.", " He has to serve gods and guests and live on fruit and roots.", " In the final stage of life (sannyasa) a person becomes a hermit.", " In this ashrama, a person attains true knowledge and is completely freed.", " But he should become a hermit only when he is convinced that he has completely lost all interest in material pursuits.", " Such a person is not affected by birth or death.", " He realises that the physical body is transient, that it is of no concern at all.", " It is the knowledge of the atman (soul) that is the best form of knowledge.", " When one gains this knowledge, one realises the identification of the atman with the brahman, one understands that the brahman is everywhere. "], "next": "10.5.3", "prev": "10.5.1", "title": "Varnashrama Dharma"}