{"index": "10.5.4", "image": "resized_images/Vratas.png", "text": " Depending on the tithi (lunar day), the day of the week, the nakshatras (stars), the month, the season and the position of the sun, certain specific religious rites and ceremonies have to be performed. These are known as vratas. The first day of the lunar fortnight is known as pratipada. The day of pratipada in the months of Kartika, Ashvina and Chaitra are Brahma’s tithis. It is then that the worship of Brahma must be done. On the second day of the lunar fortnight (dvitiya), one should eat only flowers and pray to the two Ashvinis. this makes the supplicant handsome and lucky. Shuklapaksha is that lunar fortnight in which the moon waxes and Shuklapaksha dvitiya in the month of Kartika is earmarked for the worship of Yama. If one performs this vrata, one does not have to go to naraka (hell). This is also the day for praying to Balarama and Krishna. It was on the third day of the lunar fortnight (tritiya), in shuklapaksha and in the month of Chaitra, that Shiva married Parvati or Gouri. Rites performed on this day are thus known as gourivrata. Shiva and Parvati have to be given offerings of fruit. The eight names of Parvati have to be recited. These are Lalita, Vijaya, Bhadra Bhavani, Kumuda, Shiva, Vasudevi and Gouri. Chaturthi vrata is performed on the fourth day of the lunar fortnight, is shuklapaksha and in the month of Magha. This is the day for worshipping the common gods (gana devata). The offerings on this occasion are to be wine and fragrant perfumes. On the fifth day of the lunar fortnight, one performs panchami vrata. This grants good health and takes care of bad omens. Particularly auspicious for panchami vrata are the shuklapakshas in the months of Shravana, Bhadra, Ashvina and Kartika. On the sixth day of the lunar fortnight one performs shashthi vrata. One has to live only on fruit and if one performs this vrata, the fruits of any action that one performs live forever. Shashthi vrata should be observed especially in the months of Kartika and Bhadra. Surya is to be worshipped on the seventh (saptami) day of the lunar fortnight. If saptami vrata is observed in shuklapaksha, all sorrow disappears. Sins are stoned for and all one’s desires are attained. Women who have no children can have sons if they observe these rites. The eight day of the lunar fortnight (ashtami) is very significant. Krishna was born on this tithi in the month of Bhadra when the nakshatra Rohini was in the sky. Ashtami is therefore auspicious in the month of Bhadra. If one fasts on that day and prays to Krishna, the sins of one’s earlier seven lives are atoned for. But this vrata is to be observed in krishnapaksha and not in shuklapaksha, since Krishna was born in Krishnapaksha. Together with Krishna, Rohini and the moon, Devaki, Vasudeva, Yashoda, Nanda and Balarama are also to be worshipped on the occasion. Since Krishna took birth (janma) on this ashtami tithi, this particular day is known as janmashtami. The eighth day of the lunar fortnight can be important even if it is not the month of Bhadra. For example, the eighth day of the lunar fortnight might be a Wednesday (budha vara) in both shuklapaksha and krishnapaksha. Irrespective of the month, such an ashtami is important and is known as budhashtami. On that day one has to live only on molasses and rice and perform the vrata. There used to be a brahamana named Dhira whose wife was named Rambha. Dhira’s son was Koushika, his daughter was Vijaya and Dhira’s bull was named Dhanada. Koushika would go with the other cowherds to graze the bull. Once when Koushika was having a bath in the river Bhagirathi and the bull was grazing, some thieves came and stole the bull. Koushika and his sister Vijaya looked everywhere for it, but could not find it. In searching for the bull, they came to a lake where some women were bathing in the course of performing a vrata. Brother and sister were tired and hungry and they craved for some food. The women agreed to give them food, but only after Koushika and Vijaya had also performed the budhashtami vrata. And as soon as Koushika perfomed the ritual, the bull was miraculously returned to him. Such were the powers of the vrata that Koushika could get his sister Vijaya married off to Yama and himself became the king of Ayodhya. After their parents Dhira and Rambha had died, Vijaya discovered that her father and mother were in naraka. When she asked Yama as to how her parents might be delivered from naraka, Yama told her that Koushika and Vijaya should perform budhashtami vrata again. And immediately after they did so, the parents attained svarga. The ninth day of the lunar fortnight is navami and navami in shuklapaksha, especially in the month of Ashvina, is earmarked for the worship of Gouri. An animal has to be sacrificed and offered to the goddess on this occasion. The brahmanas become all powerful if they observe dashami vrata on the tenth day of the lunar fortnight and donate ten cows. The eleventh day of the lunar fortnight (ekadashi) is for fasting. It is also the tithi for praying to Vishnu. The observance of ekadashi vrata grants sons and wealth and atones for one’s sins. The twelfth day of the lunar fortnight is dvadashi. Any dvadashi in shuklapaksha is auspicious for worshipping Vishnu. Duadashi in the month of Bhadra is for praying to cows and calves and in the month of Chaitra it is for praying to the god of love (Madana). If one observes dvadashi for an entire year, one never has to go to naraka. An especially good conjunction is dvadashi in shuklapaksha in the month of Bhadra when the nakshatra Shravana is in the sky. if one fasts and observes a vrata then, one earns greater punya than from bathing in the confluence of sacred rivers. If Budha (Mercury) is also in the sky, the punya is multiplied severalfold. Trayodashi vrata is on the thirteenth day of the lunar fortnight and this ritual was first performed by the god of lover when he wanted to please Shiva. This is the tithi on which Shiva is worshipped. In the month of Ashvina, Indra is also revered on this tithi. And in the month of Chaitra, the god of love is worshipped in shuklapaksha on the same tithi. The fourteenth day of the lunar fortnight (chaturdashi) is also earmarked for Shiva, particularly in the month of Kartika. One fasts and donates to brahmanas and thereby attains svarga. The chaturdashi in krishnapaksha that comes between the months of Magha and Falguna is known as Shivaratri. Then one has to fast and stay awake the whole night. Earlier, there used to be an evil hunter named Sundarasena. But because he performed a vrata on Shivaratri, all his sins were forgiven. ", "next": "10.6", "prev": "10.5.3", "title": "Vratas"}