{"index": "10.6.4", "image": "resized_images/The King.png", "text": " The king’s duties are many.\n He has to punish his enemies, ensure the prosperity of his subjects and arrange that his kingdom is ruled well.\n He has to protect the sages who perform tapasya inside the boundaries of his kingdom.\n A king should appoint a wise brahmana as his priest.\n His ministers should also be wise and his queen should be a woman who follows the path of dharma.\n When a king dies, time must not be wasted.\n The priest must immediately find an auspicious occasion so that a new king can be appointed and crowned.\n A kingdom can never be without a king.\n Before the coronation, a prospective king has to purify himself by rubbing his body with mud.\n Mud from a mountain peak is used for the ears, form a Krishna temple for the face, from an Indra temple for the back, form a palace for the chest, mud raised by an elephant’s tusks for the right hand, mud raised by a bull’s horns for the left hand, mud from a yajna for the things and from a cowshed for the feet.\n After the king has thus rubbed himself with different forms of mud and purified himself, he is ready to be anointed.\n Four types of ministers will appoint him.\n Brahmana ministers with golden vessels full of clarified butter will stand of the eastern side.\n Kshatriya ministers with silver vessels full of sweet and thickened milk will stand on the eastern side.\n Vaishya ministers with copper vessels full of curds will stand on the western side.\n And shudra ministers with earthen vessels full of water will stand on the northern side.\n The priests will then use material from all four directions to anoint the king.\n Water from all the places of pilgrimage will be poured on the king’s head and throat.\n There must be songs and musical instruments must be played.\n The king will next pray to Brahma, Vishnu, Indra and the other gods.\n He will look at a mirror, some clarified butter and the various signs of good omen that have been placed all around.\n The king will then be crowned and introduced to his ministers, advisers and guards.\n The priest will be given cows, goats, buffaloes and houses by the king.\n He will also bow before the brahmanas.\n After all these ceremonies have been completed, he truly becomes the king.\n He circles the fire, touches his guru’s feet and with all his soldiers, goes out on a procession through the streets so that his subjects can see him.\n At that time, the king must be seated either on an elephant or a horse.\n After the procession is over, the king may return to his palace.\n The king has to appoint many officials.\n The general has got to be a brahmana or a kshatriya.\n The charioteer must know about horses and elephants, and treasurer must be familiar with different jewels.\n There has to be a doctor, a keeper of elephants, a keeper of horses, a captain for the palace and another captain for looking after the women of the royal household.\n Each person must be appointed to the job which suits his expertise and temperament best.\n Anyone thus appointed by a king has to stick to certain rules.\n He must always obey the king’s orders and must never do anything that is contrary to the king’s commands.\n In public he must always say pleasant things to the king.\n If there are any unpleasant utterances to be made, they have to be made in a private audience with the king.\n Those who serve the king must not be thieves, nor must they ever insult the king.\n They will not dress like the king, nor will they become too intimate with the king.\n They must not divulge royal secrets.\n For a fort, the king should choose a place that cannot readily be attacked by enemies.\n The king must ensure that the gods are worshipped, the subjects are protected and the evil are punished.\n He should never steal form the temples, instead he should build temples and set up idols of the gods there.\n The brahmanas must also be protected and the king has to make sure that no brahmanas are killed in his kingdom.\n For a queen, he has to choose a woman who subscribes to these beliefs.\n The king will appoint an official to look after every ten villages and another official to look after every hundred villages.\n Spies must be appointed to find out all that is going no in the kingdom.\n The king is entitled to one-sixth of all the punya that accrues in his kingdom through his subjects.\n But he is also credited with one-sixth of all the sins that are committed in his kingdom.\n The taxes will be levied as per the dictates of the sacred texts.\n From whatever is received as taxes, half will go into the royal treasury and the remaining half will be distributed amongst the brahmanas.\n If there is a liar, the king will impose a penalty on him to the extent of one-eighth of the liar’s total wealth.\n If the owner of any property is not known, the king will keep the property is not known, the king will keep the property is safe custody for a period of three years.\n Once the owner is identified within a period of three years, he can claim the property.\n But beyond three years, the becomes entitled to the property.\n The property rights of any minor orphan are to be protected by the king.\n If there is a theft in the kingdom, the king must immediately replace what has been stolen with wealth taken from his own royal treasury.\n If the thief is caught and the stolen goods recovered, they are used to replenish the treasury.\n One-twentieth of profits made form trade are to be paid to the king as taxes.\n One- fifth or one-sixth of foodgrains are to be paid as taxes.\n One day every month, craftsmen will work free of charge for the king.\n They will only be gives food from the royal kitchen.\n The king has to pay proper attention to the princes.\n They have to be taught four types of shastras.\n The first is dharma shastra, which teaches what is right and what is wrong.\n The second is artha shastra, economics.\n The third is dhanurveda, the art of fighting.\n And the last subject that has to be taught to princes is shilpa, arts and crafts.\n The king has to assign bodyguards to take care of the princes.\n He must ensure that the princes associate with honourable and learned people and not with undesirable characters.\n In instances where the princes do not grow up properly despite the king’s best efforts, the king is free to keep them imprisoned.\n But they should be comfortable in the prison and should not be made to suffer there.\n The king should give up hunting, drinking and the playing of dice.\n He must not unnecessarily waste time in travelling around.\n He must first win over his servants through his behaviour and then do the same for his subjects.\n It is only after this has been achieved that he attains a position to conquer his enemies through the use of arms.\n Anyone who brings harm to the kingdom must immediately be killed.\n If the king delays in doing that which has to be done, the purpose of the action is completely lost.\n Nor must the king inform others in advance about what is going to be done.\n No one must get to know about the king’s intended actions.\n Once the actions have been completed, the fruits of the actions performed are information enough for everyone to see.\n This does not mean that the king will not consult his ministers.\n Of course he will, that is why they are ministers.\n Before sleeping or eating, the king must check whether the bed or the food is safe.\n There were seven techniques that kings were supposed to use in ruling their kingdoms.\n These were known as sama, dana, danda, bheda, maya, upeksha and indrajala.\n Of these, the first four are the most famous.\n Sama means the art of gentle persuasion.\n Dana means the usage of donations or money to achieve one’s purpose.\n Danda is punishment.\n And bheda is the art of aggravating dissension amongst parties opposed to each other.\n Maya means to use illusions or deceit and upeksha is to deliberately ignore people so as to achieve one’s purpose.\n Indrajala literally means jugglery.\n In this context, it would mean to perform a balancing act amongst opposing pulls and opposing parties.\n What sort of punishment the king should mete out is also laid down.\n If anyone lies and says that his possessions have been stolen, he is to be fined an amount equal in value to that of the possessions which have supposedly been stolen.\n A brahmana who bears false witness is to be banished from the kingdom.\n A person who kills cows, elephants, horses or camels will have a leg or a hand cut off.\n A thief who steals gold or silver or an abductor of women will be executed.\n Execution is also prescribed in cases of arson and poisoning.\n A wife who does not obey her husband shall be torn to death by dogs.\n A woman who does not obey her husband or brahmanas may also have her nose, ears or arms chopped off. She will when be set astride a cow and banished from the kingdom. ", "next": "10.7", "prev": "10.6.3", "title": "The King"}