{"index": "10.6.1", "image": "resized_images/Hellish Planets – Narakas (Hells).png", "text": " If one worships Vishnu with flowers, one never goes to hell.\n There are several such hells.\n Although people do not wish to die, they are bound to die once their predestined time span on earth has been exhausted.\n One then has to pay for whatever sins one might have committed.\n The sinners suffer and those who have performed good deeds are naturally rewarded.\n There are in fact two gates that lead into Yama’s abode.\n The good are brought by yamadutas (Yama’s servants) through the western gate and are then taken to svarga.\n Yama’s servants bring the evil to him through the southern gate and Yama then despatches them to the various hells.\n If one kills a cow, one has to spend one lakh years in a naraka known as mahavicha.\n If one kills a brahmana or steals land, there is a burning naraka named Amakumbha that one goes to.\n There one suffers till the day when the world is destroyed.\n A killer of women, children or old men stays in Rourava naraka for the span of fourteen manavantaras.\n An arsonist is sent to Maharourava and burnt there for an entire kalpa.\n A thief goes to Tamisra, were he is continuously pierced with spears by Yama’s servants for several kalpas.\n After that, a thief is taken to Mahatamisra to be bitten by snakes and insects.\n If you kill you father or mother, you will be sent to the hell Asipatravana.\n There you will be continuously sliced into pieces with swords.\n If you burn someone to death, you will go to Karambhavaluka where you will be placed on burning sands.\n A person who eats sweets alone goes to Kakola and is fed only worms.\n A person who does not perform yajnas goes to Kuttala and is fed blood.\n An oppressor is sent to Tailapaka and is crushed like an oilseed there.\n A liar is sent to the naraka named Mahapata.\n There are several other narakas for those who encourage inter-class marriages, those who kill animals, those who cut trees, those who eat too much meat, those who criticise the Vedas, those who bear also witness and those who criticise their teachers. ", "next": "10.6.2", "prev": "10.6", "title": "Hellish Planets – Narakas (Hells)"}