{"index": "10.7.1", "image": "resized_images/Dreams.png", "text": " Some dreams are bad omens. In fact, they are nightmares. Examples are: dreams about grass or trees growing on one’s body, dreams in which the dreamer is shaven-headed or is wearing shabby clothes or dreams in which one is falling form above. It is also bad to dream of marriages, singing, the killing of snakes and the killing of chandalas or animals. If you dream that you are drinking oil or eating bird meat, that is also a bad omen. Other examples are: where the dreamer dreams that he is playing with monkeys or chandalas, when he dreams that devas, brahmanas, the king or the guru is angry or when he dreams that his house had collapsed. Remedies have to be found if one dreams such evil dreams. Brahmanas have to be worshipped, a yajna has to be performed and the dreamer has to pray to Vishnu, Shiva, Brahma, Ganesha or Surya. Dreams dreamt in the first quarter of one’s sleep normally come true over the next one year. Dreams from the second quarter come true over the next six months and dreams from the third quarter over the next three months. Dreams from the last quarter come true over the next fortnight and dreams dreamt right at dawn come true within the next ten days. If one first dreams a good dream and then an evil one, it is the evil dream the will come true. Therefore, if one dreams a good dream, one should not sleep anymore. One should immediately arise. There are many dreams that are good dreams. For example, dreams that involve mountains, palaces or snakes. Or the dreamer might dream that he is riding on a horse or a bull. It is also good to dream of white flowers in the sky or to see trees in a dream. Especially good dreams are those of the dreamer’s possessing many arms or many heads or of grass and bushes sprouting form his navel. What if you dream of wearing white garlands or clothes? That too is good. If you dream of eclipses of the sun, the moon or the stars, by all means rejoice. And if in a dream you see that you have caught hold of the enemy’s flag, that surely means that you will triumph over the enemy. And if you actually dream of defeating the enemy, the interpretation is clear enough. Strangely enough, a dream where the dreamer sees that he is eating rice pudding is a good dream. As is the case with dreams of drinking wine or blood. Or even of eating wet meat. A clear sky in a dream is good. Dreaming of milking a cow or a buffalo with one’s own mouth is also good. The dream continues to be a good one if one dreams of milking a lioness or a she-elephant thus. Other dreams which have good interpretations are, for example, dreams of the dreamer’s receiving blessings form devas or brahmanas or of being anointed with water. The dreamer who dreams of his coronation is blessed. And he is doubly blessed if he dreams that his head has been cut off or that he has died or even that his house has been burnt down. The relatives of such a dreamer increase in number and he also prospers. It is good to dream of musical instruments being played. Or of riding a bull or climbing a tree. Wet clothes, trees laden with fruit and clear blue skies in dreams are especially good. ", "next": "10.7.2", "prev": "10.7", "title": "Dreams"}