{"index": "10.7.3", "image": "resized_images/Battle.png", "text": [" Once a king decides to go out to battle, seven days are needed for preliminaries.", " On the first day, Vishnu, Shiva and Ganesha have to be worshipped.", " On the second day the dikpalas (guardians of all the directions) are worshipped, the Rudras on the third day, the planets and the stars on the fourth day and the two Ashvinis and the rivers on the fifth day.", " On the sixth day, the king has ceremonial bath in honour of the victory that is to come.", " And on the seventh day, the king leaves to do battle.", " Prior to the marching, the army must always assemble to the east of the capital city.", " The start of the march must be accompanied with the playing of musical instruments.", " Once the army has begun to march, it must never look back.", " After having travelled for a couple of miles, it must stop to rest any pray to the gods and the brahmanas.", " The king must never directly fight.", " Because if the king is killed, the battle is lost.", " The king must be right behind his army, not too far away from it.", " An elephant will be guarded by four chariots, a chariot by four horses and a horse by four infantrymen.", " The infantry will also be at the front of army, followed by archers and then by the horses.", " The chariots and the elephants come last of all.", " The cowards in the army must not be in the front, they must be at the back.", " The front is for the brave soldiers.", " To the extent possible, one should fight with the sun behind one’s army.", " If a soldier dies in the course of battle, he goes straight to heaven.", " The blood of brave men wash away all sins.", " To be struck with a weapon is better than to perform many sacrifices.", " A person who flees form the field of battle performs a sin that is worse than that of killing a brahmana.", " The fight should be between equals.", " Those who are running away should not be killed.", " Nor should spectators and those who are unarmed be killed.", " An enemy captured in battle should not be kept imprisoned.", " He should be released and treated like a son. "], "next": "10.7.4", "prev": "10.7.2", "title": "Battle"}