{"index": "10.7.2", "image": "resized_images/Omens and Signs.png", "text": [" If one is about to go out of the house, one should take care of any bad omens that there might be.", " Such bad omens are cotton, dried grass, cowdung, coal, molasses, leather, hair, a lunatic, a chandala, a widow, a dead body, ashes, bones and a broken vessel.", " If one comes across these as one is about to leave, one should not start without pacifying the elements through prayers to Vishnu.", " The sound of musical instruments is not an auspicious sound at the beginning of a journey.", " If the means of transport by which one is travelling breaks down, that too, is a bad omen.", " If weapons break, perhaps you should postpone the journey.", " The same is the case if an umbrella held over one’s head happens to fall.", " If one hits one’s head against the lintel of the door as one is about too cross the threshold, prayers are again indicated.", " And never call back someone who has just left.", " That is a bad omen and bodes ill for the success of the journey.", " There are good omens for a departure and if one sees these good omens, the journey is bound to be successful.", " Good omens are white flowers, full vessels, meat, distant noises, an old goat, a cow, a horse, an elephant, fire, gold silver, a sword, an umbrella, fruit, clarified butter, curds, a conch shell, sugarcane, the sound of thunder, lightning and a dead body with no one crying over it.", " Omens are important even if one is not going on a journey.", " A peacock crying on the left means that something is going to be stolen.", " If a donkey brays with a broken voice, that is good omen and something good will happen.", " If a boar or a buffalo crosses over from the left to the right, that is a good omen.", " But if they cross over from the right to the left, that is a bad omen.", " One’s desires will be attained if horses, tigers, lions, cats or donkeys cross over from the right to the left.", " jackals, moles, lizards, pigs and cuckoos are good omens or the left and monkeys are good omens on the right.", " If a jackal calls once, twice, thrice or four times, that is a good omen.", " It is a bad omen if a jackal calls five or six times.", " It is a very good omen if a jackal calls seven times.", " If crows caw on the left of an army, the soldiers will not be able to win.", " If a crow can be seen near the door a house, this means that there will soon be a guest.", " A crow looking at the sum with one eye signifies great danger.", " A crow covered with mud means the attainment of one’s desires.", " A dog barking inside the house leads to the death of the householders.", " A person whose left limbs are sniffed by a dog, will attain riches.", " If the right limbs are sniffed, there will be danger.", " A dog blocking one’s path signifies theft.", " A dog with a bone or a rope in its mouth means the loss of property.", " But it is a good omen to see a dog with meat in its mouth.", " Cows mooing irregularly mean threats to the master of the house.", " If this happens at night, there will be a theft or a death in the house.", " If the cows have horns that are wet or daubed with mud, that is a good sign for the householders.", " A cow that plays with cranes or doves is bound to die.", " A cow that licks its feet is also destined to die.", " If an elephant strikes its right foot with its left, that is a good sign.", " Prosperity comes if an elephant rubs its right tusk with its foot.", " There is great danger if an umbrella falls just as one is about to leave on a trip.", " Journeys are to be avoided if the stars are not favourable. "], "next": "10.7.3", "prev": "10.7.1", "title": "Omens and Signs"}