{"index": "10.7.4", "image": "resized_images/Sri Rama’s Teachings.png", "text": [" Rama had once taught Lakshmana about the duties of a king.", " The Agni Purana now relates these precepts of Rama’s.", " The duties of king are fourfold.", " Firstly, he has to earn wealth.", " Secondly, he has to increase it.", " Thirdly, he has to protect it.", " And fourthly and finally, he has to donate it.", " The king must also be polite and politeness comes through the conquering of the senses.", " The king must be humble.", " The senses are like mad elephants.", " If the senses are pampered, like mad elephants, they trample politeness and humility underfoot.", " The king must also be non-violent, truthful, clean and forgiving.", " He should take care to observe all the rituals.", " He should give food to those who are poor, he should protect those who seek royal protection.", " He should always use words that are pleasant to hear.", " The body is here today and gone tomorrow.", " Stupid is the king who deviates form the path of righteousness to give pleasure to a body that is transient.", " The curses of unhappy people are enough to bring down a king.", " There is only one difference between gods and animals.", " Gods use pleasant word, while animals use rough words.", " The king must use pleasant words like a god.", " And he must use pleasant words not only for those who are his friends or are good, but also for those who are his enemies or are evil.", " With obeisance the king pleases his guru, with good behaviour the righteous, with duties the gods, with live the servants and with alms those who are inferior.", " The kingdom has seven components.", " These are the king, the ministers, the friends, the treasury, the army, the forts and the state itself.", " Of these, the most important is the state and it has to be preserved at all costs.", " The king must be extremely careful in the choice of the ministers and the royal priest.", " The king must not choose or consult ministers who are stupid.", " The king’s signs are his golden rod or sceptre and an umbrella that is held over his head.", " The umbrella should be made of the feathers of swans, peacocks or cranes, but the feathers of different types of birds should not be mixed in the same umbrella.", " The throne should be made of wood and should be embellished with gold.", " A bow can be made of iron, horn or wood.", " The best bow is one that extends over four armlengths.", " The king can spend upto one year’s tax revenue on armaments and flags. "], "next": "10.8", "prev": "10.7.3", "title": "Sri Rama’s Teachings"}