{"index": "10.8.3", "image": "resized_images/Donating the Puranas.png", "text": " The Agni Purana now describes the benefits of giving alms along with the purans.\n The puranas are to be donated together with cows.\n And in talking of the mahapuranas, the Agni Purana also mentions most of their length, in terms of the number of shlokas (couplets) that each has.\n This is worth stating.\n The Brahma Purana - twenty-five thousand The Padma Purana - twelve thousand The Vishnu Purana - thirteen thousand The Vayu Purana - fourteen thousand The Bhagavata Purana - eighteen thousand The Narada Purana - twenty-five thousand The Markandeya Purana - nine thousand The Agni Purana - twelve thousand The Brahmavaivarta Purana - eighteen thousand The Linga Purana - eleven thousand The Varaha Purana - fourteen thousand The Skanda Purana - eighty-four thousand The Vamana Purana - ten thousand The Kurma purana - eight thousand The Matsya Purana - thirteen thousand The Garuda Purana - eight thousand The Brahmanda Purana - twelve thousand The only mahapurana which is missing from the above list is the Bhavishya Purana.\n You now have a pretty good idea of how long the Puranas are.\n The Skaknda Purana is the longest and the Kurma and Garuda Puranas the shortest.\n But unfortunately, the numbers in the Agni Purana are not terribly accurate.\n The Padma Purana has fifty-five thousand couplets and not twelve as stated.\n The Varaha Purana has twenty-four thousands couplets and not fourteen thousand.\n The Agni Purana itself has slightly over fifteen thousand couplets land not twelve thousand.\n But at least you have some approximate idea about the lengths of the various Puranas.\n The Brahama Purana is to be given in the month of Vaishakha.\n The Padma Purana is to be donated in the month of Jyaishtha.\n The Vishnu Purana is to be donated in the month of Ashada and the Vayu Purana in the month of Shravana.\n The Bhagavata Purana is to be given in the month of Bhadra, the Narada Purana in the month of Ashvina, the Markandeya Purana in the month of Kartika, the Agni Purana in the month of Margashirsha and the Bhavishya Purana in the month of Pousha.\n The Brahmavaivarta Purana in the month of Pousha.\n The Brahmavaivarta Purana is for the month of Magha, the Linga Purana for the month of Falguna and the Varaha Purana for the month of Chaitra.\n The Skanda Purana is to be given to brahmanas.\n The Vamana Purana is to be given in the autumn.\n The Kurma Purana is to be given together with a golden urn.\n The Matsya Purana is to be donated together with a golden swan.\n The Brahmanda Purana is to be given to brahmanas.\n Great benefits are also to be derived from hearing the Puranas recited.\n The reciter has to be given alms and the brahmanas must be given cows, rice and land at the time of the recitation.\n If one arranges for a recitation of the Puranas, one lives long, stays healthy and attains heaven. ", "next": "10.8.4", "prev": "10.8.2", "title": "Donating the Puranas"}