{"index": "10.8.6", "image": "resized_images/Literature and Grammar.png", "text": [" Thereafter, the Agni Purana has many chapters on literature and grammar.", " It describes the different types of chhanda (metres) that are used in poetry.", " Next it discusses the alphabet.", " There are sixty-four letters (varna) in the alphabet, of which twenty-one are vowels (svara varna).", " There are three tones (svara) in which the letters of the alphabet may be uttered.", " Their names are udatta, anudatta and svarita.", " There are eight places from which the letters may be pronounced.", " These are the chest, the throat, the head, the back of the tongue, the teeth, the nose, the lips and the palate.", " Pronunciations should be clear and audible.", " They should not be nasal and mumbled.", " The Agni Purana then discusses the alamkaras (rhetoric) that are used in poetry and plays.", " Poetry is entirely different from the shastras (sacred texts) and itihasa (history).", " The sacred texts are full of words and historical texts are full of narrations of incidents that took place.", " But that does not constitute poetry.", " Real men are difficult to find on this earth.", " Amongst these real men, it is difficult to find men who are learned.", " Amongst the learned men, it is not easy to find some who have a poetic sense.", " And amongst those who have poetic sense, it is difficult to find a few who can compose poetry.", " Poetry is impossible without a knowledge of the rules of poetry and even more important, without a sense of feeling.", " Sanskrit is the language of the gods.", " The language of humans is Prakrita.", " Poetry can be either in Sanskrit or in Prakrita.", " There are three types of poetry.", " These are gadya (prose), padya (poetry) or mishra (a mixture of the two).", " Genuine poetry is, however, only padya Gadya can be of three types-churnaka, utkalika and vrittagandhi.", " Churnaka prose is easy on the ears, it has very few compouond words.", " Utkalika prose is hard on the ears, it is full of compound words.", " Vrittagandhi prose is some where between churnaka and utkalika.", " An epic must always be split up into sections (sarga).", " It has to be written in Sanskrit, although some mixture of Sanskrit words with Prakrita ones is permissible.", " The theme of an epic must always be good and historical elements may be introduced if the author so desires.", " Literature is useless without the flavour of sentiments (rasa).", " There are nine sentiments that are used.", " The first is hasya (humour).", " The second is karuna rasa (pathos).", " The third is roudra rasa (that which is wrathful and awe-inspiring).", " The fourth is vira rasa (heroic themes).", " The fifth is bhayanaka rasa (horror).", " The sixth is bibhatsa rasa (vulgar and obscene themes).", " The seventh is adbhuta rasa (that which is strange).", " The eighth is shanta rasa (placidity).", " And the ninth is shringara rasa (amorous themes).", " But the sentiments must be used with feeling.", " Without feeling, all literature becomes mediocre.", " Particularly in a play, sentiments can be supplemented with skills (kalal).", " These skills are normally associated with women and there are sixty-four of them.", " The more important ones are singing, playing musical instruments, dancing, acting, drawing, making garlands, sewing, hairdressing and using magic.", " Grammatical rules of sandhi and samasa (rules for forming compound words) are next described.", " The difference between the two is that in sandhi, the two words that are being joined retain their original senses in the compound word.", " The case of samasa is different.", " Sandhi occurs when two varnas (letters) met.", " Samasa is a condensation or conversion of two or more words into one.", " Sandhi does not create any new word.", " Samasa leads to the formation of a third word which refers to something related to but distinct from either or any of the words combined.", " Pita (yellow) and ambara (cloth) combined by way of sandhi are pronounced pitambara and mean cloth that is yellow.", " The same two words combined by way of samasa result in the third word pitambara which means “the one dressed in yellow”, that is, Krishna.", " There are several possible declensions of words, depending on the vachana and the vibhakti.", " The vachana refers to the number.", " Eka-vachana is when there is only one (phalam, a fruit) dvi-vachana when there are two (phale, two fruits) and vahu-vachana when there are more than two (phalani, more than two fruits).", " There are three genders, pumlinga (masculine), strilinga (feminine) and klivalinga (neuter).", " Deva, asura, Vishnu are, for example, masculine in gender.", " Devi, Kalika or maya are feminine.", " Pushpa (flower) or phala (fruit) are neuter.", " There are six karakas (cases) and seven vibhaktis (case-endings).", " The agent who performs the action indicated by the kriya (verb), is the kartri or doer.", " To the kartri karaka or Nominative Case, the prathama vibhakti or first case-ending is attached.", " The object of the action is karma and to the karma karaka or objective Case, the second (dvitiya) case-ending is attached.", " The means or instruments by which the action is performed takes on the karana karaka or Instrumental Cases and the third (tritiya) case-ending.", " When a gift is given irrevocably, the recipient takes on the sampradana karaka or Dative Case and the case-ending in question is the fourth (chaturthi).", " That which is the source of something takes on the apadana karaka or Ablative Case and the fifth (panchami) case-ending.", " When there is a relation of possessions, the possessor takes on the shashthi vibhakti (sixth case-ending).", " There is no counterpart of the possessive Case of English grammar because the relation of possession is not directly related to the verb (kriya) and therefore to the doer (karaka).", " In case of the location in which the action takes place, the karaka is adhikarana (Locative Case) and the case-ending the seventh (saptami). "], "next": "10.9", "prev": "10.8.5", "title": "Literature and Grammar"}