{"index": "10.8.2", "image": "resized_images/Property.png", "text": [" What happens to a person’s debts when he dies?", " If he does not have any sons, the person who inherits the property also inherits the debts and had to pay them off.", " If there is a son, the son pays the debts off.", " But a woman is not to be held responsible for debts contracted by her husband or her son.", " Nor is a man responsible for debts contracted by his wife or son.", " Exceptions are instances where a husband and a wife contract a debt jointly.", " If there are no witnesses to a contracted debt but the king feels that the debt was indeed contracted, the king must arrange for the debt to be repaid within a period of sixty-four days.", " In cases of a dispute, the person who brings a false suit will be punished by the king.", " And a false witness will be given twice the punishment that is meted out to the one who brings a false suit.", " A brahmana who bears false witness will be banished from the kingdom.", " A person who agrees to be a witness, but later withdraws, will be punished eight times as much as the bringer of the false suit.", " A brahmana who does this will be banished from the kingdom.", " It is better that the details of a debt contracted be written down, with the names of the two parties and the witnesses clearly indicated.", " If the debtor pays in instalments, the details of all such payments must be recorded on the written document.", " Debts made in the presence of witnesses should also be repaid in the presence of witnesses.", " If a witness has to take an oath, the oath should be administered after cotton, fire, water or poison has been placed on the head of the witness.", " Fire or water can be used to find out if a person is lying or not.", " If fire is used, seven banyan leaves are placed on the accused’s hand.", " A red hop lump of iron is then placed on the hand and the accused had to go around a fire seven times.", " If it is found that the hand has not been burnt, the person has been telling the truth.", " And if the hand has been burnt, he had been lying.", " Similarly, an accused person can be immersed in the water and if he does not drown, he has been telling the truth.", " Alternatively, the accused can be made to drink poison.", " If the poison does him no harm, he is truthful.", " If the father makes a will, the property will be divided amongst the sons in accordance with the provisions of the will.", " But if all the sons get an equal share of the property, the wife should also be given an equal share, otherwise, the father can leave all his property to the eldest son.", " The sons and the father obtain equal shares to any property or debt that has been left by the grandfather.", " But the sons are not necessarily entitled to any property that has not been left by the grandfather, but been earned by father.", " If a son is born after the property has been divided, he too will be entitled to an equal share of any property left by the grandfather.", " Daughters are not entitled to property.", " But sons who have go married will use one-fourth of their inherited property to get their sisters married. "], "next": "10.8.3", "prev": "10.8.1", "title": "Property"}