{"index": "10.8.1", "image": "resized_images/Dhanurveda.png", "text": [" The section on Dhanurveda is on arms and weapons.", " There are five types of weapons that are used in war.", " The first category is that of yantramukta weapons, released from a machine (yantra).", " This machine may be a launcher or even a bow.", " The second category is that of panimukta weapons, weapons that are flung by the hand (pani).", " Examples are spears and stones.", " The third category is known as muktasandharita.", " These are weapons that can be flung and also withdrawn.", " The fourth category consists of weapons like swords that are never released from the hand during battle.", " These are known as amukta weapons.", " And the last category of weapons consists of brute force and strength.", " This is of use in bouts of wrestling.", " The best form of fighting is that with bows and arrows.", " Next comes fighting with spears, followed by fighting with swords.", " Wrestling is the worst form of fighting.", " Before aiming, the bow (dhanusha) should be held with the arch pointing down towards the earth.", " The arrow (vana) should be placed against the bow with the head pointing down.", " The bow should now be raised and the lower end of the bow should be in line with the archer’s navel.", " The quiver should be at the back.", " Before releasing the arrow, the bow should be held firm with the left hand and the arrow with the fingers of the right hand.", " The string of the bow should be pulled back such that the tassel of the arrow is between the archer’s ear and right eye.", " The body should not be bent when one is releasing an arrow.", " Nor should on get excited.", " The archer has to be still as a pillar.", " The target has to be in line with the left fist and the archer’s posture has to be like that of a triangle.", " It is best to pull back the string of the bow upto the right ear.", " A noose (pasha) is ten arms in length, with both ends of the weapon being circular.", " The main body of the weapon is made of rope.", " There are eleven different ways in which a noose may be held.", " A noose must always be flung with the right hand.", " A sword (asi) must hang to the left of the waist.", " When a sword is to be taken out, the scabbard should be grasped in the left hand and the sword should be taken out with the right hand.", " There are thirty-two different way in which a sword and a shield may be held. "], "next": "10.8.2", "prev": "10.8", "title": "Dhanurveda"}