{"index": "10.8.4", "image": "resized_images/Vamsha (Dynasties).png", "text": " Brahma was born from Vishnu’s navel. Brahma’s son was Marichi, Marichi’s son Kashyapa and Kakshyapa’s son Vivasvana. From this line was descended Pururava and Pururava’s descendants were the kings of the surya (solar) dynasty. Brahma also had a son named Atri and Atri had a son named Soma. Soma performed a rajasuya yajna (royal sacrifice). Having performed the sacrifice, Soma became the ruler of all the worlds. This made him very arrogant and he abducted the sage Brihaspati’s wife Tara. This led to a terrible war between the devas and the asuras. Tara was eventually restored to Brihaspati, but Soma and Tara had a son named Budha. From Budha were descended the kings of the chandra (lunar) dynasty. There were twelve major wars between the devas and the asuras. The first of these was known as the Narasimha War. This took place when Hiranyakashipu was the king of the asuras. Vishnu adopted the form of Narsismha and killed Hiranyakashipu. He then made Prahlada the king of the demons. The second war was the Vamana war and it took place when Vali was the king of the demons. Vishnu adopted the form of a dwarf (vamana) to subjugate the demons. The third war was the Varaha war and this took place when Hiranyaksha was the king of the demons. Vishnu adopted the form of a wild boar (varaha) and killed Hiranyaksha. The fourth war was the Amritamanthana war and this took place over the manthana (churning) of the ocean for amrita (nectar). The fifth war between the devas and the asuras took place over the abduction of Tara and this came to be known as the Tarakamaya war. The sixth war was known as the Ajivaka War. The seventh war took place when Tripura led the asuras and this was known as the Tripuraghatana war. It was Shiva who killed the demon Tripura in this war. The eighth war, the Andhaka war, took place when Andhaka led the asuras. It was Vishnu who engineered that Andhaka be killed when Andhaka expressed a desire to abduct Shiva’s wife. The ninth war was known as Vritrasamhara and took place when Vritra led the demons. The tenth war was simply known as Jita. In this war, Vishnu killed Shalva and the other demons, and Parashurama killed the evil kshatriyas. The eleventh war was known as Halahala. An asura named Halahala (poison) had invaded Shiva’s body and flooded it with poison. But Vishnu managed to destroy the demon. In the twelfth war, known as Kolahala, Vishnu destroyed an asura named Kolahala (tumult). ", "next": "10.8.5", "prev": "10.8.3", "title": "Vamsha (Dynasties)"}