{"index": "10.9.3", "image": "resized_images/Yoga.png", "text": [" Yoga is the way to circumvent the miseries of life.", " True knowledge is that which informs one about the true nature of brahman or paramatman.", " The atman or jivatman is that which characterises an individual.", " Yoga means union, it is the union of the jivatman with the paramatman.", " Yoga concentrates one’s mind on the paramatman.", " The first prerequisites of yoga is non-violence.", " A non-violent person is always righteous.", " The second requirement of yoga is truthfulness.", " The third prerequisite is celibacy.", " The fourth is controlling one’s senses and the last is the worship of god.", " One who practices yoga should not go around collecting material possessions.", " A piece of cloth, a covering against the cold, and a pair of sandals are possessions enough for him.", " Before meditating on the true nature of the paramatman, one has to seat oneself in a proper asana (posture).", " The piece of cloth on which one is to sit should be placed in a clean place.", " One sits on such a seat and tries to purify one’s atman by controlling one’s mind and senses through yoga.", " The head and the neck should be held straight up, motionless.", " The point of vision should be directed towards the tip of one’s nose.", " One should not look in any direction.", " The arms should lightly rest on the folded thighs and the right hand should be placed, palm upwards, on the left palm.", " Padmasana (lotus position) is one such recommended posture.", " The breath of life (prana vayu) has to be controlled.", " This process of control is known as pranayama.", " A finger is placed on the nose when the breath is being exhaled.", " The entire breath should be exhaled from the body.", " Since rechana means exhalation, this process of control is known as rechaka.", " When the breath is inhaled, the inhalation should be such that it fills the entire body.", " Since puraka literally means ‘that which fills’, this process of control is known as puraka.", " When the breath is neither being exhaled nor inhaled, one sits completely still like a kumbha (pot) and this is known as kumbhaka.", " Pranayama makes one healthy, swift, enthusiastic, strong and collected.", " Since the senses are controlled, one goes to heaven and avoids going to hell.", " Material pursuits are like the strong current of a river.", " The atman drowns in it.", " Pranayama alone is not enough.", " It has to be supplemented with dhyana of japa (meditation and contemplation).", " One contemplates the true nature of the paramatman.", " The body is like a chariot.", " The senses are its horses, the mind is the charioteer and pranayama is the bridle.", " An individual who dies while performing dhyana is immediately assimilated with Vishnu.", " Dhyana involve four different things, all of which must be in complete harmony.", " The first is the meditator, the second is the act of meditating, the third is the object that one is meditating upon and the fourth is the reason why one is performing the mediation.", " One does not have to;", " sit in a rigid posture for dhyana to be possible.", " It can be done while one is walking, sitting or even sleeping.", " The important aspect is to establish the object of one’s meditation in one’s heart.", " There are different ways of establishing one’s concentration.", " As an object of meditation, one can meditate on three concentric circles which are black, red and white.", " In the centre of the circles is a divine lotus.", " The lotus has eight petals.", " One thinks that detachment is the stem of the lotus and praying to Vishnu its stamen.", " Right in the centre of the lotus is a pure spark of fire and that is the paramatman.", " Alternatively, one can visualise the paramatman in a blaze of light, in the centre of the lotus.", " Dhyana is far far superior to any yajna that one might perform.", " One particular form of deep and intense meditation is known as samadhi.", " The meditator is then completely still, as calm as the ocean.", " He loses all track of the outside world.", " He does not hear, smell, see or touch.", " His mind has no wishes and feels nothing.", " He is completely united with god.", " Such a meditator automatically gets to know all the knowledge that can be gleaned from the Vedas or the shastras.", " He can obtain all the material possessions that he wants, but he regards them all as no more important than a blade of grass.", " Such a meditator attains supreme knowledge.", " If you look at various pots full of water, you will find that the same sky is reflected in them all.", " Supreme knowledge tells one that, exactly similarly, it is the same atman that is everywhere.", " It is the atman which is the same as the paramatman, it is this atman that is in the water, in energy, in water, in the earth and in metals. The atman is everywhere. "], "next": "10.9.4", "prev": "10.9.2", "title": "Yoga"}