{"index": "10.9.4", "image": "resized_images/The Knowledge of Brahman.png", "text": [" Brahma jnana is the knowledge of brahman.", " This knowledge, which gives the ultimate bliss, is nothing but the sense that the individual atman is identical with the universal brahman or paramtman.", " The physical body is not the atman.", " Nor are the senses the atman.", " The mind or intelligence is not the atman.", " Life itself is not the atman.", " The atman is different from all the objects that have been mentioned above.", " The atman is in an individual’s heart.", " It sees everything and senses everything, but is different from the physical body.", " It is this that sages contemplate when they meditate.", " The sky was created from the brahman, from the sky came wind, from wind fire, from fire water, from water the earth and from the earth the five elements.", " One has to meditate on the physical body gradually disappearing and merging into the brahman.", " The brahman is neither true nor untrue.", " It has neither form nor is it without form.", " The brahman has several parts, but at the same time it is an integral whole.", " The brahman cannot be described.", " It cannot be achieved through the power of action.", " The brahman is always pure.", " It has no ties and it is the true form of happiness.", " What is required is the sense that it is I, the individual, who am the brahman.", " I am nothing but the atman and the atman is nothing but the brahman.", " This sense is true knowledge.", " The brahman is the Lord who is the origin of everything and the individual is part of the brahman.", " It is this knowledge that frees one from the ties of the world and this is what brahman jnana is all about.", " The brahman is not the earth;", " it is beyond the earth.", " The brahman is not the wind, nor is it the sky.", " The brahman has no beginning;", " it is independent of all action.", " The brahman is huge;", " it is everywhere.", " The brahman not only has no form, it is beyond all form.", " The brahman cannot be heard.", " It cannot be touched.", " The brahman has neither intelligence nor mind.", " It has no sense of ego or vanity.", " It does not have life, birth, old age or death.", " The brahman is neither happy nor unhappy.", " It does not feel hungry or thirsty.", " It cannot be measured.", " At the same time, it is both nothing and everything.", " Life has five possible ends.", " By performing yajnas one can attain heaven.", " By performing tapasya one can become an ascetic.", " By performing actions one can attain brahmaloka.", " By detachment from material pursuits (vairagya) one can merge oneself into nature.", " And by true knowledge the individual gets absorbed into the divine essence.", " This is known as kaivalya.", " Detachment means to withdraw oneself from the effects of all actions.", " And knowledge means the knowledge that the atman is no different from the brahman.", " This is known as jnana yoga (the yoga of knowledge).", " There are few people who attain this knowledge.", " One of those was Bharata.", " Bharata had done a lot he became very attached to a deer and when he died, he died thinking of the deer.", " The result was that in his next life, Bharata was born as a deer.", " But the deer happened to be a jatismara, that is, it remembered its earlier life.", " The deer eventually died and Bharata was again born as jatismara human.", " The king of Soubira was once travelling on a palanquin and he wanted someone who would bear his palanquin free of charge.", " The king’s servants caught hold of Bharata to bear the palanquin.", " But Bharata moved slowly and could not keep up with the other bearers.", " The palanquin did not progress and the king asked Bharata.", " “Why are you so tired?", " You have not been bearing my palanquin for long.", " Can’t you some toil?", " You look fairly strong to me.", "” Bharata replied, “I am not strong.", " Nor am I bearing your palanquin.", " I am not tired.", " nor am I lazy.", " I am my atman and feet are and my body is balanced on my thighs.", " My shoulders are on my body and your palanquin rests on my shoulders.", " But I am not my feet, thighs, body or shoulders.", " I am the atman.", " The atman is not carrying you.", " So why do you say that I am beating you?", "” Bharata then instructed the king on the mysteries of true knowledge.", " The atman was pure, ever-lasting, calm, without traits and beyond natural characteristics.", " Since the atman had no traits and since an individual was the atman and not the body, it was meaningless to say that an individual was strong or weak.", " The physical body was made of the elements and so was the palanquin.", " What was the point therefore in saying that the physical body was bearing the palanquin?", " Heating these words of wisdom, the king fell at Bharata’s feet.", " “Forgive me,” he said, “and let go of the palanquin, Who are you?", "” “Who am I?", "”, asked Bharata.", " “That is not a question that can easily be answered.", "” The king answered, “I fail to understand.", " Surely the form in which you are now existing is who you are.", "” “No,” said Bharata.", " “I am the atman and the atman is the same as the paramatman.", " The paramatman is everywhere and therefore, the atman is also everywhere.", " I am everywhere.", " I am in all physical bodies.", " It is meaningless to ask who you are and who I am.", " We are all one and the same.", " Wood has come from the trees and this palanquin is made of wood.", " But is the palanquin wood or tree?", " When you ride on the palanquin, does anyone say that you are riding on a tree?", " Men, women, cows, horses, elephants, birds and trees, these are all meaningless names.", " They are all illusions.", " Everything is one and the same.", " I am everywhere.", " If there had been a place or an object where I do not exist, I could have everywhere, I do not know how to answer your question.", " Tell me king, are you your head or your stomach?", " Or is all of it, you?", " But then, what will you call that which is distinct from your physical body?", " Think about what I have said.", "” Bharata’s words were so profound that the king immediately accepted Bharata as a teacher.", " And Bharata told the king the story of Ribhu and Nidagha.", " The sage Ribhu was Brahma’s son.", " He was also extremely learned.", " Nidagha was Ribu’s disciple.", " After Ribhu had taught Nidagha what there was to be taught, Nidagha went to the city to see how Nidagha was getting on.", " Nidagha worshiped his teacher and gave him all sorts of things to eat.", " After Ribhu had eaten, Nidagha asked him, “Are you satisfied?", "” “What do you mean?", "”, asked Ribhu.", " “The question of satisfaction would have arisen had I been hungry or thirsty.", " I am my atman and the atman is always satisfied.", " So what is the brahman that is omnipresent and so are you.", " You are not distinct from me, we are both part of the same whole.", " I came to teach you this knowledge.", " Now that you have learnt that the brahman is everywhere, let me leave.", "” After another thousand years had passed, Ribhu came to the city again and discovered that Nidagha no longer lived in the city.", " He had begun to live on the outskirts of the city.", " “Why have you given up living in the city?", "”, Ribhu asked Nidagha.", " “Because I do not like to live in the city, where there is a king, “ replied Nidagha.", " “Who is the king ?", "”.", " asked Ribhu.", " “Point him out to me in this procession that is passing.", " And point out to me the subjects.", "” Nidagha said, “The king is the one who is as tall as a mountain peak.", " He is the one who is riding the elephant.", " The ones who are walking are the subjects.", "” “What do you mean?", "”, asked Ribhu.", " “The brahman is in the king and the brahman is in the elephant.", " How do you distinguish one from the other, how do you say that one is riding the other?", " Is the king the physical body or the atman and is the elephant the physical body or the atman?", " Who is riding on whom?", " I do not understand.", "” This knowledge, that the atman is the same as the brahman, is known as advaita (unified) brahma-jnana.", " Ribhu taught this to the king of Soubira.", " This is the knowledge that all elements are one and the same. It is only those who suffer from illusions who think that different elements and different beings have different identities. "], "next": "10.9.5", "prev": "10.9.3", "title": "The Knowledge of Brahman"}