{"index": "10.9.2", "image": "resized_images/Yama and Hell.png", "text": " When human beings die, their physical bodies are given up.\n But they acquire new bodies that are known as ativahika bodies.\n In these bodies, they are brought to Yama’s abode by Yama’s servants.\n Living beings other than human are not brought to Yama.\n Yama then decides whether the dead person should go to heaven or to hell.\n After he has served his time in heaven or in hell, he is born again.\n Yama further decides what living being the person should be born as, depending on the actions in his past life.\n And so the cycle of birth death and rebirth goes on and on.\n Since he keeps tally of all good deeds and all sins, Yama is also known as the god Dharma.\n Those who have done good deeds are rewaraded by Yama and those who have committed sins are punished.\n Chitragupta is Yama’s accountant, he keeps the account of all punya and papa.\n There are twenty-eight circles of hells with many hells located in each circle.\n A sinner may have to go to more than one hell depending on the sins that he has committed.\n Some sinners are boiled in oil, others are pierced with spears and still others are whipped.\n Some sinners are fed heated iron balls, others are fed blood and rubbish.\n There are also machines for torturing sinners.\n Terrible birds eat up some sinners.\n Other sinners have their heads cut off.\n When it is time to be reborn, the killer of a brahamana is born as a deer, dog, pig or camel.\n A drunkard is born as a donkey.\n A stealer of gold is born as a worm or an insect.\n A killer of a brahmana may also suffer from tuberculosis.\n a drunkard will have teeth like a dog and a stealer of gold will malformed nails.\n A stealer of food is born dumb.\n A person who has stolen the property of brahmanas is born as a rakshasa and lives alone in the forest.\n A stealer of fragrant scents is born as a mole.\n One who steals foodgrains is born as a rat.\n One who steals animals is born as a goat, one who steals milk as cow, one who steals fruit as monkey and one who steals meat as a vulture.\n A stealer of clothes is born as a crane and a stealer of salt as a cricket. ", "next": "10.9.3", "prev": "10.9.1", "title": "Yama and Hell"}