{"index": "11.1", "image": "resized_images/BIBLICAL AND MODERN HISTORY.png", "text": " [From the Pratisarga Parva, Chapters Four to Seven.\n] Suta Goswami said:\n Once upon a time in Hastinapura, Pradyota the son of Kshemaka was leading an assembly and meanwhile the great sage Narada arrived there.\n King Pradyota happily honored him.\n Having him seated on the seat the sage told king Pradyota, \"Your father was killed by the mlecchas, therefore he attained Yamaloka or the hellish planet.\n If you perform a ‘mleccha- yajna’, then by the effect of this sacrifice your father will attain the heavenly planets.\n\" Hearing this king Pradyota immediately called the best of the learned Brahmanas and started ‘mleccha-yajna’ in Kuruksetra.\n They built a yajna-kunda which was 16 yojanas in square (128 miles).\n They meditated on the demigods and offered oblations of mlecchas.\n There are haras, hunas, barvaras, gurundas, sakas, khasas, yavanas, pallavas, romajas and those who are situated in different dvipas and in kamaru, china and the middle of the ocean;\n all of them were called with the mantra and burnt to ashes.\n Then he (the king) gave dakshina (donation) to the brahmanas and performed abhiseka.\n As a result his father Kshemaka went to the heavenly planets.\n After that he became famous everywhere as a mleccha-hanta or destroyer of mlecchas.\n He ruled the earth for ten thousand years and went to heaven.\n He had a son named Vedavan who ruled for two thousand years.\n At that time the Kali purusha prayed to Lord Narayana along with his wife.\n After sometime the Lord apperared to him and said, \"This age will be a good time for you.\n I will fulfil your desire having various kinds of forms.\n There is a couple named Adama and his wife Havyavati.\n They are born from Vishnu-kardama and will increase the generations of mlecchas.\n Saying this, the Lord disappeared.\n Having great joy the Kali purusha went to Nilacha Vyasa said:\n \"Now you hear the future story narrated by Suta Goswami.\n This is the full story of of Kali-yuga, hearing this you will become satisfied.\n\" In the eastern side of Pradan city where there is a a big God-given forest, which is 16 square yojanas in size.\n The man named Adama was staying there under a Papa-Vriksha or a sinful tree and was eager to see his wife Havyavati.\n The Kali purusha quickly came there assuming the form of a serpent.\n He cheated them and they disobeyed Lord Vishnu.\n The husband ate the forbidden fruit of the sinful tree.\n They lived by eating air with the leaves called udumbara.\n After they had sons and all of them became mlecchas.\n Adama's duration of life was nine- hundred and thirty years.\n He offered oblations with fruits and went to heaven with his wife.\n His son was named Sveta-nama, and he lived nine-hundred and twelve years.\n Sveta-nama's son was Anuta, who rulled one-hundred years less than his father.\n His son Kinasa rulled as much as his grandfather.\n His son Malahalla ruled eight-hundred ninety five years.\n His son Virada rulled 160 years.\n His son Hamuka was devoted to Lord Vishnu, and offering oblations of fruits he achieved salvation.\n He ruled 365 years and went to heaven with the same body being engaged in mleccha-dharma.\n having good behavior, wisdom, qualities like a brahmana and worship of God, these things are called mleccha-dharma.\n The great souls have declared that the dharma of the mleccha is devotion to God, worship of fire, nonviolence, austerity and control of the senses.\n The son of Hamuka was Matocchila.\n He ruled for 970 years.\n His son Lomaka ruled 777 years and went to heaven.\n His son Nyuha (Noah) ruled for 500 years.\n He had three sons named Sima, Sama and Bhava.\n Nyuha was a devotee of Lord Vishnu.\n Once the Lord appeared in his dream and said:\n “My dear Nyuha, please listen, there will be devastation on the seventh day.\n Therefore, you have to be very quick that you make a big boat and ride in it.\n O chief of the devotees, you will be celebrated as a great king”.\n Then he made a strong boat which was 300 feet long, 50 feet wide and 30 feet high.\n It was beautiful and all the living entities could take shelter in it.\n He then himself rode in it, engaged in meditating on Lord Vishnu.\n Lord Indra called the devastating cloud named Sambartaka and poured heavy rain continuously for 40 days.\n The whole earth, Bharat-varsa, had merged in the water and four oceans came up together.\n Only Visala or Badarikasrama was not submerged.\n There were 80,000 great transcendentalists in Visala who joined with king Nyuha and his family.\n All of them were saved and everything else was destroyed.\n At that time all the sages praised the eternal energy of Lord Vishnu.\n Being pleased by the prayers of the sages, the Vishnu-maya reduced the waters of devastation.\n After one year gradually the earth become visible.\n Under the hill there is a place named Sisina and the king was situated in that place with his other people.\n When the water completely dried up, king Nyuha came back to his place.\n Suta Goswami continued:\n The mleccha, king Nyuha became attached to Lord Vishnu and as a result Lord Vishnu increased his generation.\n Then he created a language fit for the mlecchas, unfavorable to the Vedas.\n He named it as brahmi- bhasha, or brahmi language, full of bad words, for increasing the degradation of Kali-yuga.\n The Lord who is Himself the master of intelligence gave this language to Nyuha.\n Nyuha named his tree sons opposite.\n They were known as Sima, Hama, Yakuta and also Yakuta, Sapta putra, Jumara and Majuya.\n The name of their countries were known as Madi, Yunana, Stuvaloma, Tasa and Tirasa.\n Hama who was the second son of his father, had four sons know as Kusa, Misra, Kuja and Kanaam.\n Kusa had six sons - Havila, Sarva, Toragama, Savatika, NimaruhaI and Mahavala.\n Their sons were known as Kamala, Sinara and Uraka.\n And their countries names are Akvada, Bavuna and Rasana.\n After telling this story Suta Goswami influenced by Yoga-nidra entered mystic slumber.\n He woke up after two thousand years and thereupon he said:\n “Now I’m going to say about the generation of Sima.\n Because he was the first son of his father he became the king.\n This mleccha king ruled over the country for 500 years.\n His son Arkansoda ruled for 434 years.\n His son Sihla ruled for 460 years.\n His son Iratasya ruled the same length as his father.\n His son Phataja ruled for 240 years.\n His son Rau ruled for 237 years.\n His son Juja ruled the same length as his father.\n His son Nahura ruled for 160 years, and he destroyed his many inimical kings.\n His son Tahara ruled the same length as his father.\n He had three sons:\n Avirama, Nahura and Harana.\n Thus I have explained the generation of mlecchas with the indication of their names only.\n The mleccha language is considered the lowest language because it bears the curse of goddess Sarasvati.\n Thus I have summarily narrated the rise of the mlecchas in Kali-yuga.\n Sanskrt is the language by which the whole Bharata-Varsa is being praised and glorified.\n The same language, after going to another country became the mleccha language and mlecchas took advantage of it.\n After hearing all this, the sages situated in Badarikashrama, worshipped Lord Nara-Narayana and meditated upon them for 200 years.\n When they woke up from their meditation, they inquired from their teacher Suta Goswami:\n “O disciple of Sri Vyasa, you are so fortunate and greatly intelligent, may you live long.\n Now please tell us who is the king at the present time?\n\" Suta Goswami said:\n “At the present time, the Kali-yuga has already passed its 3000 years.\n Now the king Sankha is ruling the earth and in the mleccha countries the king named Sakapat is ruling.\n Please hear about how they came up.\n\" When the Kali-yuga passed 2000 years, the dynasty of mlecchas increased.\n They created many paths to grow and gradually the whole earth become full of mlecchas.\n The spiritual master and teacher of the mlecchas was named Musa.\n He was residing on the bank of the river Sarasvati, and he spread his doctrince throughout the whole world.\n As soon as Kali-yuga started, the devotion to the Lord and the language of the Vedas were destroyed.\n There are four kinds of mleccha languages:\n Vraja-bhasa, Maharastri, Yavani and Garundika.\n In this way there are four million kinds of other languages.\n For example:\n paniyam (water) is called pani, bubhuksa-hunger is called bhukh.\n Paniyam-drinking is called papadi and bhojanam-eating si called kakkanam.\n Isti is called suddharava, istini is called masapavani, ahuti is called aju and dadati is called dadhati.\n The word pitri is called paitara and bhrata is bather and also pati.\n This is the yavani lanugage in which the asva is called aspa, Janu is jainu and sapta-sindhu is called sapta-hindu.\n Now you hear about Gurundika language.\n Ravi-vara (the first day of the week) is called sunday, phalguna and chaitra months are called pharvari (February).\n Sasti is called sixty, these kinds of examples are there.\n Crime is becoming prominent in the holy place of Sapta-puri.\n Gradually the people of Aryavata are becoming theives, hunters, bhillas and fools.\n The followers of mleccha-dharma in foreign countries are intelligent and having good qualities, whereas the people of Aryavarta are bereft of good qualities.\n Thus the ruling of mlecchas is also in Bharata (India) and its islands.\n Knowing all this, O great and intelligent sage, you should just perform the devotional service to Lord Hari.\n The great sage Saunaka inquired:\n “Please tell us, what was the reason that the mlecchas did not arrive in Brahmavarta.\n Suta Goswami said:\n That was by the influence of goddess Sarasvati that they could not enter that place.\n By the order of the demigods, when the Kali-yuga pursued his 1,000 years, a brahmana named Kasyapa come down to earth from the heavenly planets with his wife Aryavatil.\n They had ten spotless sons who are known by the names:\n Upadhayaya, Diksita, Pathaka, Sukla, Misra, Agnihotri, Dvi-vedi, Tri-vedi, Catur-vedi and Pandey.\n Among them was the learned one full of knowledge.\n He went to Kashmir and worshipped goddess Sarasvati with red flowers, red akshata (rice), incense, lamps, naivedya (food offerings) and puspanjali (flower offerings).\n To please her he praised her with some prayers, asking her for better knowledge of Sankrt to put mlecchas into illusion.\n Being pleased by his prayers she remainded situated in his mind and blessed him with knowledge.\n Then the sage went to the country known as Misra and put all the mlecchas into illusion by the greace of goddess Sarasvati.\n Then he made 10,000 people as dvijas or twice born brahmanas;\n he made 2,000 people into vaishyas;\n and the rest of them as shudras.\n He came back with them and staying in Arya-desha (India) he engaged in the activites of the sages.\n They were known as Aryans and by the grace of goddess Sarasvati their generation gradually increased upto 4 million, both the men and women with their sons and grandsons.\n Their king, Kasyapa muni, ruled the earth for 120 years.\n There were 8,000 sudras in the county known as Rajputra (Rajput) and their king was Arya-prithu.\n His son was Magadha.\n The sage made him a king and left.\n Saunaka inquired:\n \"O disciple of Vyasa, O Lomaharsana, please tell us who were the kings to rule the earth in Kali-yuga, after Magadha?\n\" Suta Goswami said:\n When king Magadha, the son of Kasyapa was ruling the earth, he remembered his father's administration and he separated the Arya- desha (India) into many states.\n The state which is on the eastern side of Pancala is known as Magadha, the state of Kalinga is on the east-south side, the state of Avanta is in the south, Amarta-desha is to the south-west, Sindhu- desha is on the western side, Kaikaya is to the north-west, Madra-desha is in the north, and Koninda-desha is to the north-east.\n These states are named according to his sons' names.\n After performing a sacrifice he gave the states to his sons.\n Lord Balabhadra became pleased with his sacrifice, and Sisunaga appeared from the sacrifice as his son.\n He ruled for 100 years and his son Kakavarma ruled for 90 years.\n His son Kshemadharma ruled for 80 years and his son ruled for 70 years.\n His son Vedamisra ruled for 60 years.\n His son Ajata- nipu ruled for 50 years.\n His son Darbhaka ruled for 40 years, his son Udayasva ruled for 30 years, his son Nanda-Vardhana ruled for 20 years, his son Nanda- suta, who was born from the womb of a sudri or a low class lady, also ruled for 20 years.\n His son Pranancala ruled for 10 years.\n His son Parananda also ruled 10 years.\n His son Samananda ruled for 20 years.\n His son Priyananta ruled for 20 years, his son Devananda also ruled for 20 years.\n his son Yajna-bhanga ruled for 10 years.\n His son Mauryananda ruled for 10 years.\n And his son Mahananda fuled for 10 years.\n At this time Lord Hari was remembered by Kali.\n At that time the great and famous Gautama, the son of Kasyapa introduced the Buddhist religion, and attained Lord Hari in Pattana.\n Gautama ruled over 10 years.\n From him Shakya muni was born, who ruled 20 years.\n His son Shuddhodana ruled 30 years.\n His son Shakyasimha became the king on Satadri after 2000 years and he ruled for 60 years, by which time all the people were Buddhists.\n This was the first position of Kali-yuga and the Vedic religion was destroyed.\n If Lord Vishnu becomes a king then all the people would follow Him.\n The activities of the world are carried out by the prowess of Lord Vishnu.\n He is the master of maya or the illusory energy and whoever takes shelter of that Lord Hari, though he may be a sinful and abominable person, will become liberated.\n Buddha-simha was born from Shakyasimha and he ruled for only 30 years.\n Buddha-simha’s son was Chandra-gupta, who married with a daughter of Suluva, the Yavana king of Pausasa.\n Thus he mixed the Buddhists and yavanas.\n He ruled for 60 years.\n From him Vindusara was born and ruled for the same number of years as his father.\n His son was Ashoka.\n At this time the best of the brahmanas, Kanyakubja, performed sacrifice on the top of a mountain named Arbuda.\n By the influence of Vedic mantras, four Kshatriyas appeared form the yajna.\n Among these four Pramara was samavedi, Chapahani was yajurvedi, Shukla was trivedi and Pariharaka was the Atharvavedi.\n They were accustomed to ride on elephants.\n They kept Ashoka under their control and annihilated all the Buddhists.\n It is said there were 4 million Buddhists and all of them were killed by uncommon weapons.\n After that Pramara became king in Avanta and he constructed a large city called Ambavati for his happiness.\n It was as big as 4 yojanas or about 32 miles.\n Then Suta Goswami said:\n \"My dear brahmanas I’m being influenced by yoga- nidra, therefore, please go to your respective ashramas and meditate on Lord Vishnu.\n\" After the completion of 2,000 years, Suta Goswami said:\n When the kali-yuga had passed his 3,710 years, at that time the king was Pramara who rulled 6 years, from him Mahamada was born.\n He ruled 3 years and his son Devapi did the same.\n His son Devaduta also did the same.\n From him Gandharva-sena was born, who went to the forest after ruling for over 50 years and having given his kingdom to his son Shankha.\n Shankha ruled for over 30 years.\n Lord Indra sent a heavenly girl to Gandharva-sena named Viramati.\n A jewel like son was born form her womb.\n At the time of his birth, there were flowers raining from the sky, many auspicious instruments were played and the wind was blowing pleasingly.\n The name of the baby was Siva-drishti, who later left for the jungle with his disciples.\n After 20 years he became perfect in Karma-yoga.\n When kali-yuga copmleted 3,000 years, the terrible symptoms of kali had appeared.\n That baby took birth in the secret place of Kailasa, by the benediction of Lord Shiva, to destroy the shakas and to increase the Arya-dharma or the Vedic reigion.\n His father Gandharva-sena named his son as Vikramaditya and become happy.\n This child was very intelligent and very pleasing to his parents.\n When he was 5 years old, he left for the forest to perform austerities and he continued it upto 12 years.\n After 12 years he went to the holy city named Ambavati with all the opulence and accepted the transcendental throne sent by Lord Shiva.\n For his security goddess Parvati created a Vetala (a king of ghosts) and sent it to king Vikramaditya’s palace.\n Once the powerful king went to the temple of Lord Shiva named as Mahakaleshvara, who is the chief of the devas, and who has a bow named Pinaka.\n There he worshipped Lord Shiva.\n In that place he built a religious council hall with the pillars made of various metals and decorated with many kinds of jewels and covered with so many plants and creepers and flowers.\n In that hall he kept a celestial throne.\n He invited the foremost brahmanas who are well-versed in Vedic knowledge, worshipped them with proper hospitality and heard many religious histories from them.\n After that one demigod named Vitala come there having a form of a brahmana.\n Glorifying and blessing the king, he sat down on the seat and said: O master of this earthly planet, king Vikramaditya, if you are very eager to hear them I will describe the stories and histories to you. Thus ends the seventh chapter of the Pratisarga Parva of the Bhavishya Purana. ", "next": "11.2", "prev": "11", "title": "BIBLICAL AND MODERN HISTORY"}