{"index": "11.2", "image": "resized_images/THE PREDICTION OF ISLAM.png", "text": [" [From the third part of the Pratisarga Parva.", "] Shri Suta Gosvami said:", " In the dynasty of king Shalivahana, there were ten kings who went to the heavenly planets after ruling for over 500 years.", " Then gradually the morality declined on the earth.", " At that time Bhojaraja was the tenth of the kings on the earth.", " When he saw that the moral law of conduct was declining he went to conquer all the directions of his country with ten-thousand soldiers commanded by Kalidasa.", " He crossed the river Sindhu and conquered over the gandharas, mlecchas, shakas, kasmiris, naravas and sathas.", " He punished them and collected a large ammount of wealth.", " Then the king went along with Mahamada (Mohammad), the preceptor of mleccha-dharma, and his followers to the great god, Lord Shiva, situated in the desert.", " He bathed Lord Shiva with Ganges water and worshipped him in his mind with pancagavya (milk, ghee, yoghurt, cow dung, and cow urine) and sandalwood paste, etc.", " After he offered some prayers and pleased him.", " Suta Goswami said:", " After hearing the king’s prayers, Lord Shiva said:", " O king Bhojaraja, you should go to the place called Mahakakshvara, that land is called Vahika and now is being contaminated by the mlecchas.", " In that terrible country there no longer exists dharma.", " There was a mystic demon named Tripura, whom I have already burnt to ashes, he has come again by the order of Bali.", " He has no origin but he achieved a benediction from me.", " His name is Mahaoda and his deeds are like that of a ghost.", " Therefore, O king, you should not go to this land of the evil ghost.", " By my mercy your intelligence will be purified.", " Hearing this the king came back to his country and Mahamada came with them to the bank of the river Sindhu.", " He was expert in expanding illusion, so he said to the king very pleasingly:", " O great king, your god has become my servant.", " Just see, as he eats my remnants, so I will show you.", " The king became surprised when he saw this just before them.", " Then in anger Kalidasa rebuked Mahamada, “O rascal, you have created an illusion to bewilder the king, I will kill you, you are the lowest.", ".", ".", "\" [.", ".", ".", "] That city is known as their site of pilgrimage, a place which was Madina or free from intoxication.", " Having a form of a ghost (Bhuta), the expert illusionist Mahamada appeared at night in front of king Bhojaraja and said:", " O king, your religion is of course known as the best religion among all.", " Still I am going to establish a terrible and demoniac religion by the order of the Lord.", " The symptoms of my followers will be that they first of all will cut their genitals, have no shikha, but having beard, be wicked, make noise loudly and eat everything.", " They should eat animals without performing any rituals.", " This is my opinion.", " They will perform purificatory act with the musala or a pestle as you purify your things with kusha.", " Therefore, they will be known as musalman, the corrupters of religion.", " Thus the demoniac religion will be founded by me.", " After having heard all this the king came back to his palace and that ghost went back to his place.", " The intelligent king, Bhojaraj established the language of Sanskrit in three varnas - the brahmanas, kshatriyas and vaisyas - and for the shudras he established prakrita-bhasha, the ordinary language spoken by common men.", " After ruling his kingdom for 50 years, he went to the heavenly planet.", " The moral laws established by him were honored even by the demigods.", " The arya-varta, the pious land is situated between Vindhyacala and Himacala or the mountains known as Vindhya and Himalaya.", " The Aryans reside there, but varna-sankaras reside on the lower part of Vindhya.", " The musalman people were kept on the other side of the river Sindhu.", " On the island of Barbara, Tusha and many others also the followers of Isamsiha were also situated as they were managed by a king or demigods. "], "next": "11.3", "prev": "11.1", "title": "THE PREDICTION OF ISLAM"}