{"index": "11.3", "image": "resized_images/THE PREDICTION OF BUDDHISM.png", "text": " [From the 29th chapter of the Pratisarga Parva.\n] Long ago in the country known as Citrartha, the inhabitants of the heavenly planets used to come to play during the time of autumn.\n One day a heavenly apsara know as Manjughosha came to that place where the sage Shuka was residing.\n Seeing this beautiful boy, she tried to attract him while singing and dancing, being overwhelmed by lusty desires.\n She praised him with a beautiful prayer holding her hands and bowing down.\n Somehow, she pleased the muni.\n Then the glorious Shuka, hearing this auspicious prayer asked her to request a benediction.\n Manjughosha humbly said:\n ”O lord, you are the protector of those who came to your shelter, therefore I’m at your shelter, please become my husband”.\n The sage accepted her and after some time they produced a son named ‘Muni’ who performed austerity very strictly upto 12 years.\n He married the daughter of Svarnadeva, the god of gold.\n They gave birth to a daughter named Kinnari.\n She was very young and beautiful.\n She performed austerity to please Lord Shiva, and as a benediction lord Shiva intrusted her to a sober sage Makaranda.\n Then her father, Muni, asked lord Shiva to bless her, so that they will successfully make progress in this world.\n Lord Shiva said:\n Upto 30 years you will enjoy your country in the middle of the earth, then it will be destroyed.\n After hearing this Muni went to his place with Makaranda and resided there.\n As soon as the 29th year started the battle took place among those kings who took birth as the incarnations of the associates of Krishna.\n Bauddha, the lord of nyuhas (the lessened people) attacked the beautiful city of Netrapala, thinking that this city is wonderfully decorated with various kinds of jewels.\n The powerful king Bauddha-simha who had seven- million soldiers, fought with those kings who had only three million soldiers.\n The fight went on terribly between the armies for seven days and nights.\n The great powerful kings, who killed all the inimical armies protected by Baudha-simha, were Yoga-simha, Bhoga-simha and Vijaya.\n After that more Buddhists came from the countries known as Shyama and Japaka, and all of them were magicians.\n Again they had a large battle which lasted for one month.\n Then Netrasimha arrived with seven million soldiers protected by eight generals, for the destruction of the Buddhists.\n Being afraid, all the Buddhists left India completely and went to China to continue the war from there.\n The opposite army also continued following them.\n When they arrived on the bank of the Huha river, it was the month of Magh, the second half part of the month of January, the fight took place again.\n There were one million soldiers each from the countries of Syama and Japaka, and ten million soldiers from China assembled for a fight.\n On the other side, Krishnamsa, Deva, Netrapala, Mandalika, Dhanyapada, Lallasimha, Talana and Jana nayaka were the generals, each of them having one million soldiers.\n There was a terrible battle between the Buddhists and the Aryans.\n In that war seven million Buddhists, and two million Aryans were killed.\n Being afraid the Buddhists ran away from the battle and went to their home to produce a wooden army with the help of a machinery arrangement.\n They made ten-thousand elephants (made out of wood) along with warriors, one million horses, one thousand buffaloes, one thousand hogs, one thousand tigers, one thousand swans, and seven thousand camels.\n All these creatures had wooden warriors on their back.\n Thus with the wooden army which was 125,000 in number, they killed two million soldiers protected by Krishnamsas.\n Seeing this wonder Jayanta, the expert fighter shot fire arrows toward the wooden armies, so that they were immediately destroyed, being burnt to ashes.\n Only three million kshatriyas (warriors) were left, and they glorified the proficient warrior Jayanta again and again.\n Then the Buddhists from China, made a twenty thousand strong iron horse calvary and sent them to fight.\n The powerful warrior Yogasimha, riding on an elephant held the bow and arrows in his hands and shot to the neck of the iron warriors.\n Being afflicted by the arrows of Yogasimha five thousand soldiers were killed.\n Seeing this, Bauddhasimha made an iron tiger and sent it to Yogasimha.\n By the attack of that iron tiger the brave Yogasimha was finally killed, and then Bhogasimha riding on a horse, went to fight with the tiger.\n He killed the tiger by throwing a missile, and roared loudly.\n Then a lion was sent to him by Bauddhasimha and thus he (Bhogasimha) was killed by a lion.\n When the son of Swarna-vati (Jayanta) saw that his maternal uncles were already dead, he rode on a powerful horse and went to Bauddhasimha.\n He took illusory arrows and put the opposite army into delusion along with Bauddhasimha.\n He captured ten-thousand kings including Bauddhasimha, and returned to Krishnamsas having destroyed the mechanical armies.\n Then all of them happily went to the city and forcibly “looted” the wealth from the palace, which was very opulent, and came back the fort of the king.\n Jayanta came and released Bauddhasimha.\n After being released he offered his daughter Padmaja to Jayanta and also offered 100,000,000 golden coins for the pleasure of his in law.\n After that all the Buddhists made their vows there itself saying “We will never go to Arya-desa to invade the country.\n” Then they offered their homage and left.\n They went to Netrapala with their three million remaining soldiers. ", "next": "11.4", "prev": "11.2", "title": "THE PREDICTION OF BUDDHISM"}