{"index": "11.4", "image": "resized_images/THE PREDICTION OF INDIA’S KINGS.png", "text": " [From the 31st chapter of the Pratisarga Parva.\n] Suta Goswami said:\n The great powerful king of Madrakesa worshipped the mendicants of the heavenly planets (the Asvini kumaras) for five years and after having received a benediction from them he produced ten sons and one beautiful young daughter named Kantinati.\n King Madraka invited Maharaj Suryavarna (the present king of Hastinapura), and gave his daughter to him with proper conduct.\n Having accepted the new wife, Suryavarna quickly returned to his home with his army.\n There was a mystic demon named Karbura, the son of Bigbhisana, when he saw Kantimati the daughter of king Madrakesa, he came there and kidnapped her in their presence and went to a mountain called Sahyadri.\n Seeing this incident Mahiraja became very upset and lamented again and again.\n Mahiraja came to Hastinapura and sent a message to Krishnamsa.\n He explained everything to him and immediately with five hundred warriors Krishnamsa went to Sahyadri mountain and said fearlessly:\n “O best of the demons, please listen.\n Your father Bibhishana is a great devotoee, and you are the dear son of him, therefore, you should not act in this manner (sinfully) which is the cause of the destruction of family.\n Do you remember, long ago mother Sita was kidnapped by Ravana and what happened to him?\n” The rakshasa said, \"Previously she was the daughter of a Gandharva and my beloved wife, but because of a curse by a sage she took birth on the earthly planet.\n Therefore, feeling her separation I went to Madrakesa.\n Although I stayed there so many days, being afraid of the king I could not kidnap her.\n Now she is in my control, but if you defeat me in battle you can take her back.\n Then Krishnamsa started fighting with him with a sword and it went on for seven nights.\n Finally he defeated the rakshasa, and with Kantimati came back to Delhi to see Mahiraja.\n The king (Mahiraja) offered 10,000,000 golden coins to the great Krishnamsa.\n Then he came to Pramdavana, or the forest called Pramoda, with his friends.\n Suta Goswami said:\n There was a powerful king named Purnamala in Pattana.\n He worshipped the Vasus for five years and received a benediction from them.\n By their blessings he had ten sons and a daughter named Vidyun mala.\n For the marriage of his daughter he invited king Mahiraja and with seven million soldiers he gave his daughter to the son of Mahiraja (Bhima).\n Bhima came back happily to his home (Hastinapura) with his beautiful wife.\n Then the king of paisaca-dasa, Sahoda, came with ten-thousand mlecchas to get Vidyunmala.\n They came to Kurukshetra by the order of Bali, the grandson of Prahlada Maharaja.\n They broke the deities of gods, killed so many cows and in the places of sacred water they put cow-blood.\n Sahoda, the mleccha king, wrote a letter and sent it to Mahiraja.\n King Mahiraja answered:\n \"O mleccha king, you are the master of the mlecchasi, why are you worried about Vidyunmala?\n You should know that I’m the one who can shoot arrows just by hearing a sound and I’m the central point of the country of the thieves.\n\" Then the king went to Kurukshetra with three million soldiers.\n There was a large, terrible fight between them.\n At night in the month of Jesta (July), Bali Maharaja came from Patala, the lowest region with ten-thousand demons and killed the soldiers of the king very quickly, eating them again and again.\n The king, being afraid took shelter of goddess Sarasvati.\n After that immediately Krishnamsas arrived and killed the ten-thousand demons.\n They came to Bali, the lord of the demons, and pleased him with their words.\n Then Baliraja said:\n I’m very pleased with you, now you can ask for any benediction.\n They said:\n These demons should never come to Aryadesha (India) with you, all of you should stay always in mleccha-desha and eat the followers of mleccha- dharma.\n Baliraja became upset hearing these fearful, terrible words.\n Then Krishnamsa said:\n as long as I’m in this world you should simply stay in your home, after that you come here and do whatever you like”.\n Hearing this the mleccha king Sahoda went back to Rasatala, the sixth lowest region of demons.\n [From Pratisarga Parva, 4th Part, Chapter 6.\n] The sage (Saunka) said:\n “O great fortunate one, you know everything please tell us about the kings who came after Mahiraja.\n Suta Goswami said:\n The ghostly Kutukoddina, with human nature, was situated in the kingdom of Delhi.\n The best king Bhapasena, the grandson of Virasena was situated in the beautiful city of Aligarh.\n This city was protected by yadavas.\n Kutukaddin with ten-thousand warriors went there and defeated him and returned to Delhi.\n Then so many kings form other countries came there and defeated him and rejected him from their countries.\n When Shahoddina heard this, he came to Delhi, conquered the kings and broke all the deities.\n After that so many mlecchas came from all sides and ruled the kingdom for 5, 6 or 7 years.\n They had destroyed the places of pilgrimage and the temples, therefore as a reaction they become short-lived.\n From today, the mleccha kings will continue for a hundred years, therefore O sages, you should quickly go to Vishala (Badarikashrama) with me.\n Then all the sages sadly left this place (Naimisaranya) and went to Vishala, the best of the Himalayas and meditated upon Lord Hari, being in samadhi (trance).\n And after a hundred years all of them attained the kingdom of God. ", "next": "11.5", "prev": "11.3", "title": "THE PREDICTION OF INDIA’S KINGS"}