{"index": "11.5", "image": "resized_images/THE PREDICTION OF NIMBARKA ACHARYA.png", "text": " [From the 7th chapter of the Pratisarga Parva.] The sun god, being pleased by the praise of the demigods, said: By the order of the Lord Krishna, Sudarshana will take birth in the Dvapara-yuga, and will be known as Nimbaditya (Nimbarka). He will be able to remove the declination of religious principles. Suta Goswami said: Now you hear about the pastimes of the great Nimbarka. Lord Krishna personally ordered him to appear on the auspicious bank of Narmada river, which flows to the southern side of mountain Meru. That state is known as Tailanga, the place used by the devarsis, the godly sages. Lord Krishna said: \"You receive knowledge from devarsi Narada and establish the true principles of religion. You should remain in Mathura, Naimisaranya and Dvaraka.\" Lord Sudarshana accepted the order of Lord Krishna sarying, \"Yes,\" and appeared on the earth to fulfill the desires of the devotees. There was a broad- minded holy brahmana living in the auspicious state of Tailanga. His name was Aruna and was well versed in the Vedas and Vedangas. His wife was known as Jayanti. They were living an austere life like the sages. The brilliant luster of Sudarshana suddenly entered in the heart of Jayanti, and by that luster she looked brilliant like the moon. When the time arrived with all auspiciousness and good qualities, in Gaura paksha purnima of Kartika month, Vrisha rasi, the moon in Krittika, the five grahas (planets) situated in higher places, in the evening at the time of sunset, in Masa-lagna, the Lord of the universe (Sudarshana), who engaged the whole universe in Vedic religion, appeared from mother Jayanti (as Nimbarka). One day Lord Brahma went to Nimbarka’s ashrama just before the sunset and said: O brahmana, I’m very hungry, as long as the sun is in the sky, please give me something to eat. (I will not eat after the sun sets). The brahmana (Nimbarka) gave him food and while he was eating the sun went down. Then the brahmana by his power kept a sudarshana on a nimbe tree. Lord Brahma wondered seeing that sunlike shine and paid his obeisances to the brahmana by lying flat on the ground. Pleased with his austerity Lord Brahma said: Excellent. You will become famous on this earth, and you will be known as Nimbaditya (Nimbarka - One who made the sun appear from a Neem tree). ", "next": "11.6", "prev": "11.4", "title": "THE PREDICTION OF NIMBARKA ACHARYA"}