{"index": "11.6", "image": "resized_images/THE PREDICTION OF MADHVA AND SRIDHARA.png", "text": " [From the 7th chapter of the Pratisarga Parva.] Brihaspati said: Long ago, during the age of treta, O Indra, there was a brahmana named Shakrasharma, in Ayodhya. He worshipped demigods such as the Asvini Kumaras, Rudras, Vasus, and Surya with the mantras mentioned in the Yajur-veda. After worshipping, he satisfied them by offering oblations every day. Thus being pleased with his worship all the 330 million demigods awarded him all desired objects and even the rarest things. By the benediction of the demigods the brahmana lived on this earth for ten-thousand years without getting old and having no disturbance. After leaving his body he become the Sun-god and predominated the sun planet for one hundred thousand years, before going to Brahmaloka. He spent eight thousand celestial years for visiting the higher planets and then returned to the sun planet. Hearing this, Lord Indra with his sober intelligence began to worship the sun-god along with other demigods in the month of June-July. On the purnima, the full moon day, the sun-god came down to the earth and said to demigods: I will take birth in Kali-yuga in Vrindavana and this brahmana will execute favorable acts for the demigods. He will be born as a son of Madhava, named Madhu and follow the Vedic path. Suta Gosvami said: Saying this the sun-god created a light from his body and sent it to Vrindavana. Attracting all the irreligious people with pleasing speech he gave them Vaishnavi-shakti or the spiritual energy of Lord Vishnu, the bestower of enjoyment and liberation. Thus he become famous, known as Madhvacarya. Jiva said: In the age of Dvapara, there was a brahmana named Megha Sharma. He was very much religious, intelligent, learned and a follower of the Vedic path. He was engaged in farming, and with the ten percent profit from farming he was worshipping the demigods every day with devotion. Once there was no rain during the administration of Maharaja Shantanu for five years, but the farm of Megha sharma was about four miles wider and was watered by rain. Naturally the grain-rate increased and Megha sharma became rich by taking advantage of the scarcity. Other people being so distressed took shelter of the king. The king called Megha sharma and said: O great brahmana, I offer my obeisances unto you, please became my Guru and guide us, so that we can be free from the scarcity. Megha sharma said: when the month of Shravana (July-August) starts, you should call twelve Vedic brahmanas to chant one-hundred thousand times the mantra of the sun-god with the proper mind. Then on the full moon day (purnima) offer one tenth the number of oblations in the sacrificial fire, through the brahmanas. If you could do this as mentioned, you will become free from anxiety. So the king performed accordingly and fed all the brahmanas, then the sun-god being pleased by this poured heavy rain on the earth from all sides. After this king Shantanu, engaged in performing Surya-vrata and become a greatly pious person. Whoever he touched with his hand immediately turned to a young man. By the mercy of the sun-god, Meghasarma lived for five-hundred years, being freed from old age, and then went to sun-planet. After 100,000 years he will attain Brahmaloka. While he was speaking thus, sun-god revealed his identity to Jiva and went to Prayaga (Allahabad) and being in a happy mood he said to the demigods: “In kali-yuga, when the mlecchas will be ruling the kingdom, I will come to Vrindavana and preach for the mission of the Devas.\" Suta said: Then the sun-god descended in Vrindavana as a son of Deva-sharma, named Sridhara. He studied Srimad Bhagavatam very deeply and a great commentary on it which is known as Sridhar-bhasya, the commentary of Sridhara. ", "next": "11.7", "prev": "11.5", "title": "THE PREDICTION OF MADHVA AND SRIDHARA"}