{"index": "11.7", "image": "resized_images/THE PREDICTION OF JAYADEVA GOSVAMI.png", "text": [" Brihaspati said:", " Long ago there was a brahmana named Heli, in the beautiful city Pampapura.", " He was a worshipper of the sun-god and he knew the 64 arts.", " He avoided the mood of accepting dakshina (donations) and he became an artist, having established a workshop for clothes, paintings, pictures, metal statues etc.", " He spent five thousand coins to establish it.", " Whatever profit he made he used for worshipping the sun-god in the month of Magha (January- February) by performing sacrifices.", " Thus the sun-god Vishvakarma (the architect of the gods) became pleased with this sacrifice and descended on the top of a big pillar in Pampasarovara, the lake named Pampa, having a brilliant shining form.", " At the noon time, Heli offered food to the sun-god according to his desire.", " In this way he satisfied the three worlds.", " After leaving his body he entered into the sun-planet.", " Therefore O king of devas you may worship the sun-god, he will help you.", " Suta said:", " Lord Indra hearing this from his guru, began to worship the sun-god Visvakarma along with other demigods.", " Thus being pleased with their worship Tvashta (Visvakarma) said:", " O gods, please listen to my words, I will appear in a village named Bilvagram in Bengal, and I will be the poet known as Jayadeva, the compiler of Nirukti.", " Saying this the sun-god went to Bengal and took birth in the house of a brahmana named Kanduke.", " When he was just five years old, he was engaged in the service of his parents and continued for twelve years.", " After sometime his parents left their body and Jayadeva did all the final ceremonies (Shraddha) in Gaya.", " Being satisfied they went to heaven.", " Then Jayadeva lived in a jungle as a detached brahmana.", " At the age of twenty three, a brahmana (someone) offered his beautiful daughter to Lord Jagannatha.", " At the end of his worship the eternal Lord Aniruddha, having the form of Darubrahma, directly spoke thus:", " “O Satyavrata, please listen to Me, it is my order that you offer your daughter Padmavati to Jayadeva because he is the body of Mine, or he is as good as Me.", "” Then he found the detached brahmana (Jayadeva) and leaving his daughter in front of him, he went to his home.", " Padmavati served her husband for so many years accepting him as a beautiful and learned one.", " Jayadeva compiled a book known as Nirukta, the Vedic vocabulary, one of the six Vedangas.", " There were five kinds of Niruktas, but in Kali-yuga they were destroyed by the evil people and Prakrit- bhasha or the illiterate language was established.", " For the sake of the demigods, Panini the author of Ashtadhyayi grammar, overtook them and established the pure Sanskrit languagae.", " Once the evil minded Kali situated in the hearts of thieves, plundered all the money of the brahmana Jayadeva which was given to him by the king.", " Following this they cut both his hands and legs and went home leaving Padmavati aside.", " Jaydeva was thrown into a ditch.", " Padmavati took him out cried and lamented again and again seeing the situation of her husband.", " One day, when the king Dharmapala was out hunting.", " He saw the sage Jayadeva without hands and feet and asked:", " “Who put you in such a condition?", "” Jayadeva answered:", " “No one put me in this condition, O king.", " It is due to my previous activities that I am suffering now in this abominable condition.", "\" Having heard this statement, the religious king put the brahmana on a palanquin along with his wife and brought them to his palace.", " The king built a dharma-shala, religious institution, after receiving instructions from Jayadeva.", " One day those same thieves, dressed as Vaishnavas came to the king and said:", " “We are very much expert in the scriptures and therefore we have come to you.", " O best of the kings, Lord Vishnu, while being in the stone (Shalagrama) eats food cooked by us everyday with love.", " If you don’t believe us, you can see this right here.", "” Saying thus the slaves of kali by their power showed the king a four handed form of Lord Vishnu eating.", " Being struck with wonder, king Dharmapala said to Jayadeva:", " “O my gurudeva, some vaishnavas, the devotees of Lord Vishnu have come to my palace, and they have shown me the Lord before my very eyes, therefore please come quickly.", "\" The theives saw Jayadeva and became struck with wonder.", " They said to the king in a joking mood:", " “O king, this brahmana was a cook in the palace of the king of Gaudadesa (Bengal).", " Once he became very much greedy for money and he mixed some poison in the food and offered it to a king.", " When the king come to know about it he ordered him to be crucified.", " Then we came to him (Jayadeva), and knowing him to be an offender, we instructed him in the Vedic knowledge.", " Then the king refused to crucify him, but he cut off his hands and legs.", " At that time the king became our disciple, having been enlightened by us.", "” While they were speaking thus, the earth broke in two and those thieves fell within the earth, being sent to the lowest hell known as patala-loka.", " Jayadeva began to cry to the thieves and while he was crying his hands and legs appeared to be as they were.", " Then he explained to the bewildered king what had happened.", " The king became very happy after hearing everything from him.", " Jayadeva wrote a song called Gita-Govinda, the song sung for the pleasure of Lord Govinda.", " The king read the song and attained liberation.", " “O brahmanas, thus I have narrated the birth story of Jayadeva, now you listen about how the Supreme Lord appeared as Sri Krishna Chaitanya .", "\" [From Pratisarga Parva, 4th Part, Chapter 6.", "] The sage (Saunka) said:", " “O great fortunate one, you know everything please tell us about the kings who came after Mahiraja.", " Suta Goswami said:", " The ghostly Kutukoddina, with human nature, was situated in the kingdom of Delhi.", " The best king Bhapasena, the grandson of Virasena was situated in the beautiful city of Aligarh.", " This city was protected by yadavas.", " Kutukaddin with ten-thousand warriors went there and defeated him and returned to Delhi.", " Then so many kings form other countries came there and defeated him and rejected him from their countries.", " When Shahoddina heard this, he came to Delhi, conquered the kings and broke all the deities.", " After that so many mlecchas came from all sides and ruled the kingdom for 5, 6 or 7 years.", " They had destroyed the places of pilgrimage and the temples, therefore as a reaction they become short-lived.", " From today, the mleccha kings will continue for a hundred years, therefore O sages, you should quickly go to Vishala (Badarikashrama) with me.", " Then all the sages sadly left this place (Naimisaranya) and went to Vishala, the best of the Himalayas and meditated upon Lord Hari, being in samadhi (trance). And after a hundred years all of them attained the kingdom of God. "], "next": "12", "prev": "11.6", "title": "THE PREDICTION OF JAYADEVA GOSVAMI"}