{"index": "11", "image": "resized_images/BHAVISHYA PURANA.png", "text": " Eleventh among the Puranas, contains five parts.\n The first part contains a description of the genesis, greatness of the dates and worship of Lord Vishnu, Shiva and Surya.\n Second, third and fourth parts describe about the greatness of Shiva, Vishnu and Surya respectively.\n The fifth part contains a description of the heaven.\n Like other Puranas, Bhavishya Purana also contains a description of the ancient kings and Chandra and Surya dynasties.\n Interestingly, Bhavishya Purana contains a description of a game that resembles modern chess to a great extent.\n In all, the subject matter of Bhavishya Purana seems to be an attempt to prove and establish the supremacy of Brahma.\n The Bhavishya Purana is an ancient text authored by Sri Vyasa Muni, the compiler of the Vedic texts.\n It is listed among the eighteen major Puranas.\n Bhavishya means \"future\" and Purana means \"history\", so the text's name would translate literally as \"The History of the Future\".\n Though the text was written many thousands of years before the recorded events took place, by the power of his mystic vision, Sri Vyasa was able to accurately predict the happenings of the modern times.\n One of the text's poetic styles is to present the events as though they have already happened.\n This is a common practice in Sanskrit poetry, and does not indicate that the book was written in modern times.\n Modern scholars reject the contents of Bhavishya Purana mostly on the grounds that its information is too accurate.\n But we should ask ourselves:\n If there was an empowered saint, who knew past, present and future, and if he chose to write a book named \"the History of the Future\", shouldn't it contain accurate information about the modern times, as the title suggests?\n We cannot disqualify it simply because it speaks accurately of the British controlling India, Hitler fighting the world, and Max Mueller misrepresenting the Vedic teachings.\n \"Veda\" means knowledge, and the Vedic texts contain knowledge of everything - past, present and future.\n This Purana consists of 7 chapters: ", "next": "11.1", "prev": "10.9.5", "title": "BHAVISHYA PURANA"}