{"index": "12.11", "image": "resized_images/THE LINE OF UTTANAPADA.png", "text": " It is hoped that you have not forgotten that Svayambhuva Manu and his wife Shatarupa had a son named Uttanapada. Uttanapada’s brother was Priyavarta. Dhruva was Uttanapada’s son. Dhruva was so devoted to Vishnu that Vishnu earmarked for him a place in the heaven known as Dhruvaloka. (Dhruva became the Pole Star. The complete story of Dhruva and his tapasya in given in the Vishnu Purana). Also in Uttanapada’s line was born Chakshusha. He became a manu. (Chakshusha was the sixth Manu of the present kalpa). In Chakshusha Manu’s line was born Vena, and Vena’s son was Prithu. Prithu milked the earth and obtained foodgrains on which people can survive. That is the reason why the earth is known as prithivi. (Prithu’s story is given in several Puranas, in addition to the Mahabharata and the Harivamsha). Prithu’s son was Shikhandi and Shikhandi’s son was Sushila. Sushila was a very religious person. He faithfully studied the Vedas and visited several places of pilgrimage. His travels eventually brought him to the Himalayas, through which the sacred river Mandakini flowed. Near the banks of the river was a beautiful hermitage. It was there that Sushila began to pray to Shiva. While Sushila was thus praying, a sage named Shvetashvatara arrived. The sage’s body was lean with tapasya and he was smeared with ashes. Sushila finished praying to Shiva and worshipped the sage. ”I am indeed fortunate that I have met you,” he told Shvetashvatara. “Please make me your disciple and teach me all that there is to know.” The sage agreed. He taught Sushila and several other disciples the knowledge of the shastras (sacred texts). Shikhandi had a brother named Havirddhana. Havirddhana’s son was Prachinavarhi. He married Savarna, the daughter of the ocean, and had ten sons. These sons were known as the Prachetas. The Prachetas were devoted to Vishnu and prayed to Vishnu for several years. (The Vishnu Purana states that they meditated for ten thousand years under the ocean.) All ten Prachetas married Marisha and Daksha was born as a result of this marriage. (Marisha’s story is given in the Vishnu Purana.) It was this Daksha who had earlier been born as Brahma’s son. Because he quarrelled with Shiva, Shiva cursed Daksha that he would be born as the son of the Prachetas. “Tell us the story of Daksha,” the sages requested Lomaharshana. (The Prachetas are not to be confused with a sage named Pracheta. The sage Pracheta was Brahma’s son, as per the Brahmavaivarta Purana.) ", "next": "12.12", "prev": "12.10", "title": "THE LINE OF UTTANAPADA"}