{"index": "12.13", "image": "resized_images/HIRANYAKSHIPU.png", "text": " Hiranyakashipu pleased Brahma through his prayers.\n As a result of the boon that he received from Brahma, he became invisible and started to oppress the world.\n He drove the gods out of heaven.\n The gods and the sages went to Brahma to persuade him to do something about Hiranyakashipu.\n “I cannot really help you,” said Brahma.\n “Go to the northern shores of the great ocean and pray to Vishnu there.\n I will accompany you.\n It is Vishnu alone who can find a solution.\n” Brahma led the gods and the sages to the shores of the great ocean and started to pray to Vishnu there.\n Vishnu appeared before them.\n “Why have all of you come here?\n” he asked.\n “What do you want?\n” “It is Hiranyakashipu,” replied the gods and the sages.\n “He is oppressing the world thanks to a boon received from Brahma.\n Because of the boon, he can only be killed by you.\n Please kill him and save the universe.\n” Vishnu created a being out of his body.\n This being was as gigantic as Mount Sumeru and held a lotus (padma), a conch-shell (shankha) and a mace (gada) in his hands.\n “Go and kill Hiranyakashipu,” Vishnu instructed the being.\n The being thereupon ascended Garuda and left for Hiranyakashipu’s capital.\n His roars made the ramparts of the city quake.\n Hiranyakashipu had four sons named Prahlada, Anuhrada, Samhrada and Hrada.\n (The more usual names are Prahlada, Anuhlada, Samhlada and Hlada.\n) Accompanied by Hirayakashipu’s demon soldiers, these four sons came out to fight with the being easily repelled all of these.\n The four princes then unleashed divine weapons on the being.\n Prahlada used brahmastra, Anuhrada vaishnavastra, Samhrada koumarastra and Hrada agneyastra.\n But these divine weapons could do the wonderful being no harm.\n He merely picked up the princes and flung them far away.\n On seeing that his sons had thus been disposed of, Hiranyakashipu came to fight.\n He gave the being a resounding kick on his chest and the creature fled in pain to Vishnu.\n Vishnu now realised that he would have to take care of Hiranyakashipu himself.\n He adopted the form of a being who was a half-man and half-lion.\n Since nara means man and simha means lion, this came to be known as the narasimha incarnation (avatara) of Vishnu.\n “Go and kill this peculiar creature,” Hiranyakashipu instructed Prahrada.\n Prahrada and his brothers tried to fight with Vishnu, but were defeated easily.\n Hiranyakashipu now sent his brother Hiranyakasha to fight.\n Hiranyakasha used several weapons on Vishnu, including the diving weapon known as pashupata.\n But these weapons could do Vishnu no harm.\n Meanwhile, Prahrada had realised that this being could be none other than Vishnu.\n He started to pray to Vishnu.\n He requested his brothers, uncle and father not to fight with Vishnu.\n But Hiranyakashipu’s chest with his claws and thereby killed him.\n He also killed Anuhrada, Samhrada and Hrada.\n (A fairly common story in the Puranas, such as the Vishnu Purana, is the story of Prahlada.\n Despite being Hiranyakashipu’s son, Prahlada was devoted to Vishnu from his childhood.\n Hiranyakashipu had no desire to have a son who was devoted to Vishnu and did his level best to kill Prahlada.\n But Prahlada was protected by Vishnu and survived all these attempts.\n In the final incident, narasimha appeared while Hiranyakashipu was arguing with Prahlada and killed the demon-king.\n Vishnu then crowned Prahlada king in Hiranyakashipu’s place.\n There was no question of Hiranyaksha becoming king after Hiranyakashipu.\n In the more common account, Hiranyaksha was the elder brother and had already been killed by Vishnu in his boar (varaha) incarnation.\n It was Hiranyakasha’s death that led to Hiranyakashipu’s hatred of Vishnu.\n There is thus some variance between this more common account and that related by the Kurma Purana.) ", "next": "12.14", "prev": "12.12", "title": "HIRANYAKSHIPU"}