{"index": "12.12", "image": "resized_images/DAKSHA’S STORY.png", "text": " Daksha was Brahma’s son and had a daughter named Sati.\n Sati was married to Shiva.\n Daksha was thus Shiva’s father-in-law.\n Once Daksha came to visit his son-in-law.\n But although Shiva worshipped him with all due respect.\n Daksha felt that he had been slighted.\n Subsequently, when Sati went to visit her father, Daksha severely reprimanded her.\n “Your husband is worse than useless,” he told his daughter.\n “My other sons-in- law are far superior to him.\n You are not welcome in my house.\n Return to your worthless husband.\n” Sati could not bear to hear this abuse of her husband and immolated herself.\n She was later born as Parvati, the daughter of Himavana (the Himalayas) and married Shiva again.\n Shiva was furious to learn that Sati had died.\n He visited Daksha and cursed him that he would be born on earth as the son of a kshatriya.\n It was thus that Daksha had been born as the son of the Prachetas.\n (Dakhsa’s story is full of inconsistencies in the Puranas.\n There is an account of a yajna that Daksha performed.\n Shiva either destroyed this yajna himself, or had it destroyed by Virabhadra.\n But which Daksha performed this yajna, the one who was the son of Brahma or the one who was the son of Prachetas?\n The Kurma Purana suggests that it was the son of the Prachetas who performed this ceremony.\n The more customary account, such as that in the Bhagavata Purana, is that it was Brahma’s son who performed the sacrifice.\n Daksha was angered at Shiva because, on one particular occasion, Shiva did not stand up to show him respect, although Daksha happened to be Shiva’s father-in-law.\n Daksha therefore organised a yajna to which he did not invite Shiva.\n Sati went to the ceremony uninvited, and immolated herself when her father started criticise her husband.\n Hearing of Sati’s death, Shiva destroyed the yajna.\n He also cursed Daksha that Daksha would have to be born as the son of the Prachetas.\n) To return to the account of the Kurma Purana, the Daksha, who was the son of the Prachetas, organised a yajna.\n All the gods and sages were invited to this ceremony.\n But as a result of Daksha’s earlier enmity with his son-in-law, Shiva was not invited.\n There was a sage named Dadhichi who protested at this slight to Shiva.\n “How can you have a religious ceremony without inviting Shiva?\n” he told Daksha.\n “Shiva is a worthless fellow,” replied Daksha.\n “He is not fit to be worshipped together with the other gods.\n he wears skulls and destroys all that is created.\n How can he be treated as an equal of the great Vishnu, the preserver of all that one can see?\n My yajna is dedicated to Vishnu.\n It is not meant for the likes of Shiva.\n” Dadhichi tried to persuade Daksha that Shiva should not be ignored, but Daksha was in no mood to listen.\n Dadhichi refused to take part in such a yajna and assured Daksha that his ceremony would not be successfully completed.\n He also cursed the other sages, who had sided with Daksha, that they would go to hell and would deviate from the path laid down in the Vedas.\n (The Mahabharata also records Dadhichi’s protest.\n According to the Mahabharata, Dadhichi was devoted to Shiva.\n) Daksha went ahead with his yajna.\n The other gods, including Vishnu, came to attend the ceremony.\n Meanwhile, Parvati got to know about the yajna and told Shiva, “How can there be a ceremony at which you are not invited?\n Although Daksha used to be my father in my earlier life, this evil act of his should not be condoned.\n Please destroy the ceremony.\n” (If one goes by the more customary account, the question of Parvati’s asking Shiva to destroy the yajna does not arise.\n Sati died on the occasion of the ceremony and it was the grief of Sati’s death that led Shiva to exact vengeance.\n This happened much before Parvati was born as the daughter of Himavana.\n) Because of Parvati’s bidding, Shiva created a demon named Virabhadra.\n Virabhadra had a thousand heads, a thousand feet, a thousand eyes and a thousand arms.\n His body shone with radiance like the sun at the time of destruction.\n The thousand arms held all sorts of weapons in them.\n “What are my orders?\n” Virabhadra asked Shiva.\n “Go and destroy Daksha’s yajna,” was the reply.\n Virabhadra ascended a bull and set out for Daksha’s house.\n He created thousands and thousands of demons who would aid him in the task of destruction.\n These demons were armed with spears, tridents, maces, clubs and stones.\n Parvati also created a goddess named Bhadrakali who would help Virabhadra.\n This strange army arrived at the place where the yajna was being held and said, “We are Shiva’s followers.\n We have come to receive Shiva’s share of the offerings.\n” “No offerings have been earmarked for Shiva,” replied the gods and the sages.\n “He has not even been invited to the sacrifice.\n These words angered Virabhadra and he began his task of destruction.\n His companions uprooted the scaffoldings that had been erected on the occasion of the sacrifice.\n The sacrificial horse was flung into the waters of the river Ganga.\n (This was an ashvamedha yajna (horse sacrifice) that was being performed on the banks of the river Ganga.\n Virabhadra caught hold of Bhaga (identified as the sun-god Surya) and tore out his eyes.\n He smashed the teeth of the god Pusha (also identified as another manifestation of the sun-god Surya).\n As for the moon-god Chandra, Virabhadra gave him a resounding kick and sent him reeling.\n The fire-god Agni had his arms and tongue sliced off by Virabhadra’s companions.\n The sages were kicked and boxed.\n Vishnu himself came to intervene and Virabhadra began to fight with Vishnu.\n Vishnu has a wonderful weapon named sudarshana chakra (a bladed-discuss) and he hurled this at Virabhadra.\n But Virabhadra easily repelled this weapon with his arrows.\n Vishnu is carried by Garuda, king of the birds.\n Garuda attacked Virabhadra, but so fierce was Virabhadra, that Garuda had to flee.\n The entire universe marvelled to see that Virabhadra could thus vanquish Vishnu and Garuda.\n Brahma now arrived and sought to put an end to the fighting.\n He started to pray to Shiva and Shiva and Parvati arrived on the scene.\n The assembled gods and sages also began to pray to Shiva and Parvati.\n Parvati was moved to pity by these prayers.\n “These gods and sages have now sought refuge with you,” she told Shiva.\n “Please pardon them their sins.\n” “Agreed,” replied Shiva.\n “You have my blessing snow.\n But please remember that one cannot have a religious ceremony without I being worshipped.\n” The gods and the sages realised that Shiva was no different from Vishnu.\n They were really one and the same, different manifestations of the same universal force.\n When Daksha had earlier been born as the son of Brahma, he had married Asikli, the daughter of Virana.\n (There is a minor contradiction here as well.\n Earlier, the Kurma Purana has stated that Daksha’s wife was Prasuti.\n It is of course possible that Prasuti and Asikli were different names for the same individual.\n) Daksha and Asikli had one thousand sons.\n But the sage Narada had persuaded these sons to become hermits, disinterested in worldly pursuits.\n (The Vishnu Purana given a more complete account.\n First, five thousand sons named the Haryashvas had been born and Narada had persuaded these sons to become hermits.\n Next, one thousand sons named the Shavalashvas had been born and these had also become hermits at Narada’s instigation.\n Thereafter, sixty daughters had been born.\n) To return to the account of Kurma Purana, Daksha and Asikli had had sixty daughters had been married to Dharma, Brahma’s son.\n (There is again a contradiction.\n In the section on creation, the Kurma Purana had stated that thirteen daughters had been married to Dharma.\n) The ten daughters who had been married to Dharma were Marutvati, Vasu, Yami, Lamba, Bhanu, Arundhati, Sankalpa, Muhurta, Sadhya and Vishva.\n Vishva’s sons were the gods known as the vishvadevas, Sadhya’s sons the gods known as the sadhyas, Marutvati’s sons the gods known as the bhanus.\n (More usually, the Puranas have a completely different account of the birth of the maruts.\n They were born as the sons of Diti, Kashyapa’s wife.\n) Muhurta gave birth to time, Lamba to cattle (ghosha), Yami to snakes (nagas), Arundhati to all the objects (vishaya) on earth and Sankalpa to resolution (sankalpa).\n Thirteen of Daksha’s daughters had been married to the sage Kashyapa.\n Their names were Aditi, Diti, Arishta, Danu, Surasa, Khasa, Surabhi, Vinata, Tamra, Krodhavasha, Ira, Kadru and Muni.\n The twelve gods, known as the adityas, were born as the sons of Aditi.\n Their names were Amsha, Dhata, Bhaga, Tvashta, Mitra, Varuna, Aryama, Vivasvana, Savita, Pusha, Amshumana and Vishnu.\n Danu’s sons were demons (danavas).\n Chief among them were Tara, Shambara, Kapila, Shankara, Svarbhanu and Vrishaparva.\n (Some Puranas mention forty such sons.\n) Surasa gave birth to the gandharvas.\n (More usually, it is stated that Surasa was the mother of the snakes (nagas).\n) Aristha’s sons were thousands and thousands of snakes (sarpas).\n Kadru’s sons were also snakes (nagas).\n Tamra’s daughters were the ancestors of the birds.\n Surabhi gave birth to cows and buffaloes and Ira to trees and herbs.\n Khasa was the mother of yakshas (demi-gods), Muni of apsaras and Krodhavasha of rakshasas.\n Vinata had two sons named Garuda and Aruna.\n These two sons performed very difficult tapasya.\n Garuda pleased Vishnu and obtained the boon that he would carry Vishnu around.\n Aruna pleased Shiva and obtained the boon that he would become the sun’s charioteer.\n (The story of the rivalry between Vinata and Kadru and their respective offspring is given in the Bhagavata and Matsya Puranas.\n) This leaves Diti.\n She had two sons named Hiranyakashipu and Hiranyaksha.\n There two sons were demons and their children came to be known as the daityas.\n Hiranyakashipu was elder to Hiranyaksha. (The Puranas do not agree on this. In some Puranas, Hiranyaksha is referred to as the elder brother.) ", "next": "12.13", "prev": "12.11", "title": "DAKSHA’S STORY"}