{"index": "12.15", "image": "resized_images/A DIGRESSION ON GOUTAMA.png", "text": [" Many years ago, there was a terrible drought on earth.", " There was no food to be had and famine prevailed.", " There were several sages who lived in the forest, and they too, suffered from a lack of food.", " Goutama was a very powerful sage and he had a hermitage in the forest.", " Such were the powers that Goutama had that it never stopped raining in his hermitage.", " There was no famine there and plenty of food was to be had.", " The other sages therefore went to Goutama’s hermitage and begged him to provide them with food and shelter.", " This request Goutama readily agreed to, and the sages lived there happily.", " After twelve years had passed, it began to rain again.", " The drought had passed and foodgrains started to grow.", " The sages no begged their leave of Goutama.", " “Stay for a few more days,” said Goutama.", " “Be my guests and bless my household.", "” The sages tarried, but they were jealous of Goutama and his powers.", " They therefore plotted to bring about Goutama’s downfall.", " With their own powers, they created a black calf.", " This calf was nothing but an illusion.", " But having created it, the sages sent it to Goutama.", " Goutama found the calf wandering around and decided to take it to his cowshed.", " But as soon as he touched the calf, the calf seemed to die.", " All this was because of the illusion, but Goutama did not know this.", " He was thunderstruck at having killed a cow.", " “You are evil, you have killed a cow,” the sages told Goutama.", " “It would be a sin to remain as your guest.", " We are leaving.", "” By then, Goutama had got to know that the calf had been an illusion.", " He was extremely angry with the sages and cursed them, “because you have been evil, you have deviate from the path laid down by the Vedas.", " You will rot in hell and will have to be born several times to be freed of your sins.", "” The sages started to pray to Vishnu and Shiva.", " They wished that their sins might be cleansed.", " “What shall we do with these sages?", "” Shiva asked Vishnu.", " “Shall we pardon them?", " They are praying for deliverance.", "” “Never,” replied Vishnu.", " “Those who do not follow what is laid down in the Vedas will surely rot in hell.", " But since they are not permitted to follow the sacred shastras, let us compose some other shastras for them.", " They will follow those evil shastras, rot in hell and be born on earth several times.", " That is their penance.", "” To delude the sages, Shiva himself pretended to be a great religious teacher.", " He preached evil ways and the stupid brahmanas began to follow what he preached. "], "next": "12.16", "prev": "12.14", "title": "A DIGRESSION ON GOUTAMA"}