{"index": "12.17", "image": "resized_images/VALI.png", "text": " With Andhaka thus taken care of, Prahrada’s son Virochana became the king of the demons.\n He ruled his kingdom well.\n There was a sage named Sanatakumara who once went to visit Virochana.\n Virochana was delighted to see the sage and Sanatakumara instructed Virochana on the true nature of the universe.\n These teachings so impressed Virochana that he no longer had any desire to be a king.\n He went off to meditate, after having crowned his son, Vali, as the king of the demons.\n Vali was a good and righteous king.\n He ruled well and observed religious rites faithfully.\n But he defeated Indra and the other gods and won over heaven from them.\n Indra and the other gods started to pray to Vishnu for deliverance.\n The mother of all the gods was Aditi and she was despondent at seeing her children suffer thus.\n She too, started to pray to Vishnu.\n Stirred by these prayers, Vishnu appeared before Aditi.\n “What boon do you desire?\n” he asked.\n “Please grant me the boon that you will be born as my son.\n” replied Aditi.\n “And as my son, you will take care of Vali.\n” Vishnu granted the boon and was born as Aditi’s son.\n As Aditi’s son, Vishnu studied the Vedas under the sage Bharadvaja.\n Meanwhile, Vali arranged a yajna and Vishnu came to attend the ceremony in the form of a dwarf (vamana).\n (In more usual accounts, such as the Bhagavata Purana, Vishnu was born as a dwarf.\n) Vali was not going to refuse anything to anyone on the occasion of the sacrifice.\n As soon as he saw the dwarf, he worshipped him and said, “I am fortunate that you have come to attend my ceremony.\n Please tell me what I can do for you.\n” “Grant me as much of land as can be covered in three of my footsteps,” replied the dwarf.\n This boon Vali granted.\n The dwarf immediately assumed a gigantic form.\n With one footstep, Vishnu covered the entire earth.\n With a second, he covered the sky.\n And with the third and final footstep, he covered heaven.\n The entire universe is inside and egg (anda) and outside the egg there is water.\n Vishnu’s foot cracked the shell of the egg and some of the water that was outside, poured in.\n This water began to flow through the sky and became the heavenly Ganga.\n (The story of the heavenly Ganga (identified as the Milky Way) descending to earth is a separate story.\n The story of Ganga being born from Vishnu’s body is given in the Brahmavaivarta Purana.\n) Having traversed all the land that was available, Vishnu resumed his form of a dwarf.\n “You have now donated to me all the three worlds,” he told Vali.\n “Where will you stay?\n” “I seek refuge with you,” was Vali’s answer.\n Vishnu then instructed Vali to go and live in the underworld.\n As for heaven, it was restored to Indra.\n This is the story of Vishnu’s dwarf (vamana) incarnation. ", "next": "12.18", "prev": "12.16", "title": "VALI"}