{"index": "12.10", "image": "resized_images/PARVATI’S THOUSAND NAMES.png", "text": " Shiva was married to Daksha’s daughter Sati.\n Sati died and was reborn as Parvati, the daughter of Himalaya and his wife Mena (alternatively, Menaka).\n Parvati was married to Shiva.\n In fact, Himalaya and Mena prayed so that they might have the goddess as their daughter.\n Pleased with their prayers, the goddess arrived before Himalaya and Mena and showed them her divine form.\n She also promised them that she would be born as their daughter.\n There were a thousand names of the goddess that Himalaya recited in the course of his prayers (one thousand and eight to be precise).\n These names are as follows.\n For convenience, we have reproduced them in groups of ten names each.\n (1) Shiva, Uma, Paramashakti, Ananta, Nishkala, Amala, Shanta, Maheshvari, Nitya, Shashvati.\n (2) Paramakshara, Achintya, Kevala, Shivatma, Paramatma, Anadi, Avyaya, Shuddha, Devatma, Sarvaga, (3) Achala, Eka, Anekavibhagastha, Mayatita, Sunirmala, Mahamaheshvari, Satya, Mahadevi, Niranjana, Kashtha.\n (4) Sarvantarastha, Chitshakti, Atilalasa, Nanda, Sarvvatmika, Vidya, Jyotirupa Amrita, Akshara, Shanti.\n (5) Sarvvapratishtha, Nivritti, Amritaprada.\n Vyomamurti, Vyomalaya, Vyomadhara, Achyuta, Amara, Andinidhana, Amogha.\n (6) Karanatma, Kalakula, Svatahprathamaja, Amritanabhi, Atmasamshraya, Praneshvarapriya, Mata, Mahamahishaghatini, Pranarupa, Pradhana- Purusheshvari.\n (7) Sarvvashakti, Kalakara, Jyotsna, Sarvvakaryaniyantri, Sarvvabhuteshvari, Samsarayoni, Sakala, Sarvvashaktisamudbhava, Samsarapota, Durvara.\n (8) Durnirikshya, Durasada, Pranashakti, Pranavidya, Yogini, Paramakala, Mahavibhuti, Durddharsha, Mulaprakritidsambhava.\n (9) Anadyanantavitava, Paramaghapakarshini, Svargasthityan Tarakarani, Sudurvvachya, Duratyaya, Shabdayoni, Shabdamayi, Nadakhya, Nadvigraha, Anadi.\n (10) Avyaktaguna, Mahanada, Sanatani, Akashayoni, Yogastha, Mahayogeshvareshvari, Mahamaya, Sudushpara, Mulaprakriti, Ishvari.\n (11) Pradhanapurushatita, Pradhanapurushatmika, Purana, Chinmayi, Adipurusharupini, Bhutantavastha, Kutastha, Mahapurushasamjnita, Janmamrityujaratita, Sarvvashaktisamanvita.\n (12) Vyapini, Anavachhinna, Pradhananu-Praveshinin, Kshetrajnashakti, Avyaktalakshana, Malavarjjita, Anadimayasambinna, Prakritigraha, Mahamayasamutpanna, Tamasi.\n (13) Pourushi, Dheuva, Vyaktatmika, Krishna, Avyaktatmika, Rrakta, Shukla, Prasutika, Akarya, Karyajanani.\n (14) Nityaprasavadharmini, Sargapralayanirmukta, Srishtisthityantadharmini, Brahmagarbha, Chaturvimsha, Padmanabha, Achyutatmika, Vaidyuti, Shashvati, Youni.\n (15) Jaganmata, Ishvarapriya, Sarvvadhara, Maharupa, Sarvvaisharyasamannita, Vishvarupa, Mahagarbha, Vishveshechhanuvartini, Mahlyasi, Brahmayoni.\n (16) Mahalakshmisamudbhava, Mahavimana-Madhyastha, Mahanidra, Atmahetuka, Sarvva-Sadharani, Sukshma, Avidya, Paramarthiki, Anantarupa, Anantastha.\n (17) Purushamohini, Devi, Anekakarasamsthana, Kalatrayavivarjita, Brahmajanma, Harimurti, Brahmakhya, Brahmavishnu-Shivatmika, Brahmeshavishnujanani, Brahmasamshraya.\n (18) Vyakta, Prathamaja, Brahmi, Mahati, Brahmarupini.\n Vairagyaishvaryadharmatma.\n Brahmamurti, Hridisthita, Apamyoni, Svayambhuti.\n (19) Manasi, Tattvasambhava, Ishvarani, Sarvvani, Shankararddhasharirini, Bhavani, Rudrani, Mahalakshmi, Ambika, Maheshvara-Samutpanna.\n (20) Bhuktimuktifalaprada, Sarvveshvari, Sarvvavandya, Nitamuditamanasa, Brahmendro-Pendranmita, Shankarechhanuvartini, Ishvararddhasanagata, Maheshvarapativrata, Sakridvibhata, Sarvvartisamudraparishoshini.\n (21) Parvati, Himavatputri, Paramanadadyini, Gunadhya, Yogaja, Yogya, Jnanamurti, Vikashini, Savitri, Kamala.\n (22) Lakshmi, Shri, Anantavakshahsthalasthita, Sarojanilaya, Ganga, Yoganidra, Asurardini Sarasvati, Sarvvavidya, Jagajjveyashtha.\n (23) Sumangala, Vagdevi Varada, Avachya Kirti, Sarvvarthasadhika, Yogishvari, Brahmavidya, Mahavidya, Sushobhana.\n (24) Guhyavidya, Atmavidya, Dharmavidya,Atmabhavita, Svaha, Vishvambhara, Siddhi, Svadha, Medha, Dhriti.\n (25) Shruti, Niti, Suniti, Sukriti, Madhavi, Naravahini, Pujya, Vibhavati, Soumya, Bhogini.\n (26) Bhogashayini, Shobha, Vamshakari, Lola, Manini, Parameshthini, Trailokyasundari, Ramya, Sundari, Kamacharini.\n (27) Mahanubhava, Sattvastha, Mahamahisha-Mardini, Padmamala, Papahara, Vichitramukutangada, Kanta, Chitrambaradhara, Divyabharana-Bhushita.\n (28) Hamsakhya, Vyomanilaya, Jagasrishtivivarddhini, Niyantri, Yantramadhyastha, Nandini, Bhadrakalika, Adityavarna, Koumari.\n (29) Mayuravaravahana, Vrishasanagata, Gouri, Mahakali, Surarchita, Aditi, Niyata, Roudri, Padmagarbhavivahana.\n (30) Virupakshi, Lelihana, Mahasuravinashini, Mahafala, Anavadyangi, Kamarupa, Vibhavari, Koushiki, Vichitraratnamukuta, Pranatarti-Prabhanjani.\n (31) Karshani, Ratri, Tridashartivinashini, Vahurupa, Virupa, Surupa, Rupavarjita, Bhaktartishamani, Bhavya, Bhavatapavinashini.\n (32) Nirguna, Nityavibhava, Nihsara, Nirapatrapa, Tapasvini, Samagiti, Bhavankanilayalaya, Diksha, Vidyadhari, Dipta.\n (33) Manendrarinipatini, Sarvvatishayini, Vidya, Sarvvasiddhipradyini, Sarvveshvarapriya, Tarkshi, Samudrantaravasini, Akalanka, Niradhara.\n (34) Nityashiddha, Niramaya, Kamadhenu, Vrihadgarbha, Dhimati, Mohanashini, Nihsankalpa, Niratanka, Vinaya.\n (35) Vinayapriya, Jvalamalasahasradhya, Devadevi, Manomayi, Mahabhagavati, Bhaga, Vasudevasamudbhava, Mahendrapendrabhagini.\n (36) Bhaktigamya, Paravara, Jnanajneya,Jaratita, Vedantavishaya, Gati, Dakshina, Dahana, Danta, Sarvvabhutanamaskrita.\n (37) Yoganmaya, Vibhagajna, Mahamoha, Gariyasi, Sandhya, Brahmavidyashraya, Vijankurasamudhbuti, Mahashakti, Mahamati, Kshanti.\n (38) Prajna, Chiti, Samvit, Mahabhogindra-Shayini, Vikriti, Shankari, Shanti, Ganagandharvasevita, Vaishvanari, Mahashala.\n (39) Devasena, Guhapriya, Maharatri, Shivananda, Shachi, Duhsvapnanashini, Ijya, Pujya, Jagaddhatri, Durvineya.\n (40) Surpini, Guhalvika, Gunotpatti, Mahapitha, Marutsuta, Havyavahantaragadi, Havyavahasa-Mudhbhava, Jagadyoni, Jaganmata, Janmamrityujaratiga.\n (41) Vuddhi, Mahavuddhimati, Purushantaravasini, Tarasvini, Samadhistha, Trinetra, Divisamsthita, Sarvvendriyamanomata, Sarvvabhutahridisthita, Samsaratarini.\n (42) Sattvashuddhikari, Shuddhi, Malatrayavinashini, Jagatpriya, Jaganmurti, Trimurti, Amritashraya, Nirashraya, Nirahara, Nirankushapododbhava.\n (43) Surupa, Bhavini, Harini, Prabha, Unmilani, Sarvasaha, Sarvvapratyayasakshini, Susoumya, Chandravadana, Tandavasaktamanasa.\n (44) Sativashuddhikari, Shuddhi, Malatrayavinashini, Jagatpriya, Jaganmurti, Trimurti, Amritashya, Nirashraya, Nirahara, Nirankushapadodbhava.\n (45) Chakrahasta, Viochitrangi, Sragvini, Padmadharini, Paravaravidhanajna, Mahapuushapurvaja, Vishveshvarapriya, Vidyut, Vidyujjihva, Jitashrama.\n (46) Vidyamayi, Sahaasrakshi, Sahasravadanatmaja, Sahasrarashmi, Sattvastha, Maheshvarapadashraya, Kshalini, Mrinmayi, Vyapta, Padmavodhika.\n (47) Taijasi, Mahamayashraya, Manya, Mahadevamanorama, Vyomalakshmi, Simharatha, Chekitana, Amitaprabha, Vireshvari, Vimanastha.\n (47) Taijasi, Mahamayashraya, Manya, Mahadevamanorama, Vyomalakshmi, Simharatha, Chekitana, Amitaprabha, Vireshvari, Vimanastha.\n (48) Vishoka, Shokanashini, Anahata, Kundalini, Nalini, Padmabhasini, Sadananda, Sadakriti, Vagdevata, Sarvvabhutashrayasthita.\n (49) Brahmakala, Vishnushivagraja, Paragati, Kshobhika, Bandhika, Bhedya, Bhedabhedavivarjita, Kalalita, Kalarani.\n (50) Brahmashri, Brahmahridaya, Vyomashakti, Kriyashakti, Jamashakti, Abhinna, Bhinnasamsthana, Vashini, Vamshakarini, Guhyashakti.\n (51) Gunatita, Sarvada, Sarvatomukhi, Bhagini, Bhagavatpatni, Sakala, Kalakarini, Sarvvavit, Sarvvatobhadra.\n (52) Guhyatita, Guharani, Prakriya, Yogamata, Ganga, Vishveshareshvari, Kapila, Akapila, Kanta, Kamalabha.\n (53) Kalantara, Punya, Pushkarini, Bhoktri, Puranadarapurahsara, Poshani, Paramaishvaryabhutida, Bhutibhushana, Panchabrahmasamutpatti.\n (54) Paramarthavigraha, Dharmodaya, Bhanumati, Yogijneya, Manojava, Manorama, Manoraska, Tapasi, Vadarupini, Vedashakti.\n (55) Vedamata, Vedavidyaprakashini, Yogeshvareshvari, Mata, Mahashakti, Manomayi, , Viyanmurti, Vidyunmala, Vihayasi.\n (56) Kinnari, Surabhi, Vidya, Nandini, Nandivallabha, Bharati, Paramananda, Paraparavibhedika, Sarvvapraharanopeta, Kamya.\n (57) Kameshvareshvari, Achintya, Anantavibhava, Bhulekha, Kanakaprabha, Kushmandi, Dhanaratnadhya, Sugandha, Gandhadayini, Trivikramapadodbhuta.\n (58) Dhanushpani, Shivodaya, Sudurlabla, Dhanadhyaksha, Dhanya, Pingalalochana, Shanti, Prabhavati, Dipti, Pankajayatalochana.\n (59) Adya, Hritamalodbhuta, Gomata, Ranapriya, Satkriya, Girisha, Shuddhi, Nityapushta, Nirantara, Durga.\n (60) Katyayani, Chandi, Charichitanga, Suvigraha, Hiranyavarna, Jagati, Jagadyantrapravartika, Sarada, Mandaradrinivasa, Svarnamalini.\n (61) Ratnamala, Ratnagarbha, Pushti, Vishvapramathini, Padmanana, Padmanibha, Nityatushta, Amritodbhava, Dhunvati, Dushprakampa.\n (62) Suryamata, Drishadvati, Mahendrabhagini, Soumya, Varenya, Varadayika, Kalyani, Kamalavasa, Panchachuda, Varaprada.\n (63) Vachya, Amareshvari, Vandhya, Durjjaya, Duratikrama, Kalaratri, Mahabega, Virabhadrapriya, Hita, Bhadrakali.\n (64) Jaganmata, Bhaktamangaladayini, Karala, Pingalakara, Kamabheda, Mahasvana, Yashasvini, Yashoda, Shadadhvaparivartika, Shankhini.\n (65) Padmini, Sankhya, Samkhyayogapravartika, Chaitra, Samvatsararuda, Jagatsampurani, Indraja, Shumbhari, Khechari, Khastha.\n (66) Kamburgriva, Kalipriya, Khagadhvaja, Khagaruda, Varahi, Pugamalini, Aishvaryapadmanilaya, Virakta, Garudasana, Jayanti.\n (67) Hridguhagamya, Shankareshtaganagrani, Samyastha, Sankalpasiddha, Sarvvavijnandayini, Kalikalkavihantrui, Guhyanpanishaduttama, Nishtha, Drishti.\n (68) Smriti, Vyapi, Pushti, Tushti, Kriyavati, Vishvamareshvasreshana, Bhukti, Mukti, Shiva, Amrita.\n (69) Lohitasarpamala, Bhisani, Naramalini, Anantashayana, Ananta, Naranarayanodbhava, Nrisimhi, Daityamathini, Shankachakragadadhara, Ambika.\n (70) Sankarshanasamutpatti, Padasamshrava, Mahajvala, Mahabhuti, Sumurti, Sarvvakamadhuka, Suprabha, Sustani, Souri, Dharmakamarthamokshada.\n (71) Bhrumadhyanilaya, Purva, Puranapurusharani, Mahavibhutida, Madhya, Sarojanayana, Sama, Anadya, Nilotpaladalaprabha, Asthadashabhuja.\n (72) Sarvvashaktyasanaruda, Dharmadharmavivarjita, Vairagyajnananirata, Niraloka, Nirindriya, Vichitragahanadhara, Shvashvatasthanavasini, Sthaneshvari, Nirananda, Trishulavaradharini.\n (73) Asheshadevatamurti, Devatavaradevata, Ganambika, Giriputri, Nishumbhavinipatini, Avarna, Varnarahita, Trivarna, Jivasambhava, Anantavarna.\n (74) Ananyastha, Shankari, Shantamanasa, Agotra, Gomati, Goptri, Guhyarupa, Gunottara, Go, Gih.\n (75) Govyapriya, Gouni, Ganeshvaranamaskrita, Satyabhama, Satyasandha, Trisandhya, Sandhivarjita, Sarvvavadashraya, Samkhya, Samkhyayogasamudbhava.\n (76) Asamkhyeya, Aprameyakhya, Shunya, Suddakulodbhava, Vindunadasamutpatti, Shambhuvasa, Shashiprabha, Pishanga, Bhedarahita, Manojna.\n (77) Madhusudani, Mahashri, Shrisamutapatti, Tamohparepratishthita, Tritattvamata, Trividha, Susukshmapadasamshraya, Shantyatita, Malatita, Nirvikara.\n (78) Nirashraya, Shivakhya, Chittanilaya, Kashyapi, Shivajnanasvarupini, Daityadanavanirmukhi, Kalakarnika, Shastrayoni, Kriyamurti, Chatruvargapradarshika.\n (79) Narayani, Narodbhuti, Koumudi, Lingadharini, Karmuki, Kalita, Bhava, Paravaravibhutida, Vadava, Pararddhajatamahima.\n (80) Vamalochana, Subhadra, Devaki, Sita, Manasvini, Vedavedangaparaga, Manyumata, Mahamanyusamundbhava, Amanyu, Amritasvada.\n (81) Puruhuta, Purushtuta, Ashouchya, Bhinnavishaya, Hiranyarajatapriya, Hiranyarajani, Haimi, Hemabharanabhushita, Vibhrajamana, Durjneya.\n (82) Jyotishtomafalaprada, Mahnidrasamudbhyuti, Anidra, Satyadevata, Dirgha, Kakudmini, Hridya, Shantida, Shantivarddhini, Lakshyadishaktijanani.\n (83) Shaktichakrapravartika, Trishaktijanani, Janya, Shadurmiparivarjita, Sudhama, Karmakarani, Yugantadahanatmika, Sankarshini, Jagaddhatri, Kamayoni.\n (84) Kiritini, Aindri, Trailokyanamita, Vaishnavi, Parameshvari, Pradyumnadayita, Datri, Yugmadrishti, Trilochana, Madotkata.\n (85) Hamsagati, Prachanda, Chandavikrama, Vrishavesha, Vishyanmatra, Vindhyaparvatavasini, Himavanmerunilaya, Kailasagirivasini, Chanurahantritanaya, Nitijna.\n (86) Kamarupini, Vedavedya, Vratasnata, Brahmashailanivasini, Virabhadrapraja, Vira, Siddha, Mahakamasamudbhava, Vidyanadharanirakriti.\n (87) Apyayani, Haranti, Pavani, Poshani, Kala, Matrika, Manmathodbhuta, Varija, Vahanapriya, Sudha.\n (88) Karishini, Vani, Vinavadanatatpara, Sevita, Sevika, Sevya, Garudatmati, Arundhati, Hiranyakshi.\n (89) Mrigakshi, Manadayini, Vasuprada, Vasumati, Vasudhara, Vasundhara, Dharadhara, Vararoha, Characharasahsrada, Shrifala.\n (90) Shrimati, Shrisha, Shrinivasa, Shivapriya, Shridhari, Shrikari, Kalya, Shridhararddhasharirini, Anantadrishti, Akshudra.\n (91) Dhatrisha, Dhanadapriya, Daityasamuhaniyantri, Simhika, Simhavahana, Suvarchala, Sushroni, Sukirti, Chhinnasamshaya, Rasajna.\n (92) Rasada, Rama, Lelihana, Amritasrava, Nityodita, Svayamjyotih, Utsuka, Mritajivani, Vajratunda, Vajrajihva.\n (93) Mangalya, Mangala, Mala, Nirmala, Malaharini, Gandharvi, Garudi, Chandri, Kambalashvatarapriya, Soudamini.\n (94) Janananda, Bhrikutikutilanana, Karnikarakara, Kakshya, Kamsapranapaharini, Yugandhara, Yugavarta, Trisandhya, Harshavardhini, Pratyakshadevata.\n (95) Divya, Divyagandhathivasana, Shakrasanagata, Shakri, Sadhya, Charusharasana, Ishta, Vishishta, Shishteshta, Shishtashishtaprapujita.\n (96) Shatarupa, Shatavarta, Vinata, Surabhi, Sura, Surendramata, Sudyumna, Sushumna, Suryasamsthita, Samiksha.\n (97) Satpratishtha, Nivritti, Jnanaparaga, Dharmashastrarthakushala, Dharmajna, Dharmavahana, Dharmadharmavinirmatri, Dharmikamangalaprada, Dharmamayi, Dharmashakti.\n (98) Vidharma, Vishvadharmini, Dharmantara, Dharmamayi, Dharmapurva, Dhanavaha, Dharmopadeshtri, Dharmaksha, Dharmagamya, Dharadhara.\n (100) Mahadevaikasakshini, Sadashiva, Vishaynmurti, Vedamurti, Amurtika, Parameshvari, Shobha, Vishala, Prasannavadana, Hrishtatma.\n This completes the list of the one thousand names given to the goddess.\n Although Himalaya had used on thousand and eight names in the course of his prayers, ten of these names are missing in the list. You will also have noticed that a few of the names occur more than once. ", "next": "12.11", "prev": "12.9", "title": "PARVATI’S THOUSAND NAMES"}