{"index": "12.23", "image": "resized_images/THE YUGAS (ERAS).png", "text": " You probably remember that there are four yugas or eras - satya yuga or krita yuga, treta yuga, dvapara yuga and kali yuga.\n Lomaharshana next told the sages about the characteristics of these four eras.\n Kali yuga is the worst of the four eras.\n People are sinful and forget the dharma of the four varnas and the four ashramas.\n In fact, men are so sinful that no prescribed penance atones for their sins.\n The only place which is free from such sins is the sacred city of Varanasi.\n In satya yuga, the best course to be pursued is meditation;\n in treta yuga it is the pursuit of knowledge (jnana);\n in dvapara yuga it is the performance of yajnas;\n and in kali yuga it is the donation of alms.\n Brahma is the primary god in satya yuga, Surya in treta yuga, Vishnu in dvapara yuga and Shiva in kali yuga.\n Envy and jealousy were unknown in satya yuga and everyone was happy.\n There was no superiors and inferiors and all individuals were equally healthy and equally handsome.\n There were no fixed places for people to live in, no cities and no villages.\n men lived in the mountains and on the shores of the oceans.\n In satya yuga, water was always freely available.\n This was no longer the case in treta yuga.\n Water only became available when it rained.\n Rain was unknown earlier.\n And as it rained, trees began to grow.\n People lived on these trees.\n The fruit from these trees provided the sustenance required to make a living.\n But gradually, anger and jealousy came to be known and many of the wonderful trees disappeared as mankind picked up evils ways.\n However, enough trees were left to ensure that people did not die of starvation.\n They lived on honey gathered from the trees.\n Although men looked on satya yuga with nostalgia, ill- health and disease continued to be unknown even in treta yuga.\n But towards the end of treta yuga, people became really sinful.\n All the trees disappeared.\n To make a living, mankind had to resort to agriculture and animal husbandry.\n The weather became inclement and seasons like summer, monsoon and winter led to hardship.\n Notions of property were also introduced.\n Individuals appropriated mountains, rivers, land, trees and herbs as their own.\n To instil righteousness in the minds of people, the principles of varnashrama dharma were set out towards the end of treta yuga.\n In dvapara yuga, hatred, anger and jealousy became much more common.\n Fighting started.\n It was then that Vedavyasa spread amongst ordinary people, the knowledge that was in the Vedas, by dividing them.\n Drought, death and disease came to be known in dvapara yuga.\n In kali yuga, fraudulence is the norm.\n There are severe droughts and famines, revolutions take place.\n People are liars and sinners.\n They are easily angered.\n They d not respect the brahmanas.\n The brahmanas, on their part, forget all about the Vedas and yajnas.\n Shudras become kings and oppress the brahmanas.\n Some Shudras shave off their heads and wear saffron clothes.\n They pretend to be religious teachers.\n And horror of horrors, people start to believe in these fraudulent teachers.\n Women wear hairpins in their hair.\n As if this alone were not enough, they refuse to obey their husbands.\n Thieves are everywhere.\n The only redeeming feature of kali yuga is the fact that even if one worships Shiva just a little bit in kali yuga, one attains undying punya (store of merit). ", "next": "12.24", "prev": "12.22", "title": "THE YUGAS (ERAS)"}