{"index": "12.20", "image": "resized_images/THE LUNAR DYNASTY.png", "text": [" Budha was the son of the moon-god Chandra.", " Budha married Ila and they had a son named Pururava.", " Pururava married the apsara Urvashi and they had six sons.", " One of these sons was Ayu and amongst Ayu’s descendants was a king named Yayati.", " Yayati had two wives.", " The first was Devayani, daughter of Shukracharya, the preceptor of the demons.", " The second wife was named Sharmishtha and she was the daughter of Vrishaparva, the king of the danavas.", " Yayati and Devayani had two sons, Yadu and Tursavu.", " Yayati and Sharmishtha had three sons, Druhya, Anu and Puru.", " When it became time for Yayati to retire to the forest, he gave puru the bulk of the kingdom and Puru’s descendants came to be known as the Pauravas.", " Yadu was given some land towards the south-west and his descendants were the Yadavas.", " Turvasu ruled to the south-east, Druhya to the west and Anu to the north.", " One of Yadu’s descendants was the king Kritavirya and Kritavirya’s son became famous as Kartavirya Arjuna.", " he had a thousand arms and was the most skilled of fighters.", " He eventually met his death at the hands of Parashurama.", " Kartavirya Arjuna had several hundred sons.", " But the five most important ones were Shura, Shurasena, Krishna, Dhrishna and Jayadvaja.", " Jayadvaja was devoted to Vishnu, but his brothers were more inclined towards the worship of Shiva.", " The four brothers told Jayadhvaja.", " “Stop worshipping Vishnu.", " Our father was a devotee of Shiva’s and it is our duty to follow the example set by our father.", " Let us worship Shiva.", "” “It is my duty to worship Vishnu,” replied Jayadhvaja.", " “Vishnu is the lord of everything, he is the preserver.", " How can I do otherwise?", "” The brothers debated about the virtues of worshipping Shiva vis-a-vis Vishnu, but could arrive at no consensus.", " They therefore decided to seek the advice of the seven great sages (saptarshi), chief amongst whom was Vashistha.", " Vashishtha told the brothers, “One worships the god that one chooses, there are no rules in this regard.", " All gods yield the desired fruit, if properly worshipped.", " To the extent that there are rules, there are as follows.", " Kings worship Vishnu and Indra;", " brahmanas worship Agni, Aditya, Brahma and Shiva;", " the gods worship Vishnu;", " the demons worship Shiva;", " the yakshas and gandharvas worship Chandra;", " the sages worship Brahma and Shiva;", " and women worship Parvati.", " But for humans, the best way is to realise that Shiva is no different from Vishnu and that Shiva and Vishnu should therefore be worshipped simultaneously.", "” The Kurma Purana also gives the names of several kings belongings to the lunar dynasty.", " But these we will gloss over, as they are merely only a catalogue of names. "], "next": "12.21", "prev": "12.19", "title": "THE LUNAR DYNASTY"}