{"index": "12.26", "image": "resized_images/MANVATARAS.png", "text": [" You already know what a manvantara is.", " The titles of the seven great sages (saptarshi), the names of the gods and the title of Indra change from the manvantara to another.", " In the present kalpa (cycle), six manvantaras have passed.", " The first Manu was Svayambhuva.", " The second Manu was Svarochisha.", " The gods then were the paravatas and tushitas and the title of Indra was held by Vipashchita.", " The seven great sages were Urjja, Stamba, prana, Dambholi, Vrishabha, Timira and Arvarivana.", " Uttama was the third Manu.", " The gods of this manvantara were the sudhamas, stayas, shivas, pratardanas and vashavartis and the name of the Indra was Sushanti.", " Rajah, Gotra, Urddhavahu, Savana, Anagha, Sutapa and Shukra were the seven great sages.", " The fourth Manu was Tamasa.", " The gods of this era were the suravas, haris, satyas and sudhas and the title of Indra was held by Shibi.", " The seven great sages were Jyotirdhama, Prithu, Kavya, Chaitra, Agni, Varuna and Pivara.", " In the fifth manvantara, the Manu was Raivata and the title of Indra was held by Vibhu.", " The gods were the bhutis and the vaikunthas and the seven great sages were Hiranyaroma, Vedashri, Urddhavahu, Vedavahu, Suvahu and Suparjanya.", " (The name of the seventh great sage is missing.", ") The Manus Svarochisha, Uttama, Tamasa and Raivata were all descended from Svayambhuva Manu.", " The sixth Manu was Chakshusha and the Indra then was Manojava.", " The gods were known as the adyas, prasutas, bhavyas, prithukas and lekhas.", " Sumedha, Vrija, Havishmana, Uttama, Madhu, Abhimana and Sahishnu were the seven great sages.", " The seventh manvantara is the one that is now current and the Indra now is Purundara.", " The Manu is Shraddhadeva, the gods are the adityas, the vasus, the rudras and the maruts.", " The names of the seven great sages are Vashishtha, Kashyapa, Atri, Jamadagni, Goutama, Vishvamitra and Bharadvaja.", " In the present kalpa, there will be seven more manvantaras in the future.", " Thereafter, the world will be destroyed.", " (It should be mentioned that the names given in this section do not necessarily tally with the names given in the other Puranas.", " Not only do the names of the gods, the sages and the Indras differ, the names of the future manvantaras also sometimes differ from Purana to Purana.) "], "next": "12.27", "prev": "12.25", "title": "MANVATARAS"}