{"index": "12.21", "image": "resized_images/DURJAYA AND URVASHI.png", "text": " There used to be a king named Durjaya. He was learned in the shastras and a good king. His wife was a beautiful and good woman. One day, King Durjaya went to the banks of the river Kalindi. There he met the apsara Urvashi and fell in love with her. He married Urvashi and lived with her for many years. After several years had passed, Durjaya remembered his kingdom and wife. He told Urvashi, “Please let me return to my home now.” “Not yet, king,” replied Urvashi. “Please stay with me for one more year.” “I will return as soon as I have visited my kingdom,” said Durjaya. “I promise you that I will not tarry there. Therefore, let me return.” “I will let you go on condition that you do not live as the husband of any other woman,” replied Urvashi. Durjaya agreed to this condition and returned home. But because of the word that he had given Urvashi, he stayed away from his wife and did not venture near her. His wife tried to find out what the matter was, but Durjaya would not reply. Finally, the queen got to know what Durjaya had done and realised that her husband had committed a sin. He should not have married Urvashi while his wife was still alive. The queen therefore told Durjaya, “You have sinned. You must perform penance. That is the sort of action that befits a king, not this despondency that you have become addicted to.” King Durjaya went and met the sage Kanva to ascertain what sort of penance should be performed for the sin that he had committed. Kanva advised him to go to the Himalayas and meditate. While Durjaya was going to the Himalayas, he met a gandharva king. The gandharva king wore a divine garland, Durjaya remembered Urvashi. He thought that the garland was a fitting adornment for no one but Urvashi. He began to fight with the gandharva over the possession of the garland. Durjaya managed to defeat the gandharva king and obtain the garland. He immediately hastened to banks of the river Kalindi, because he thought that he might find Urvashi there. But Urvashi was not to be found, and Durjaya roamed the world in search of her. Finally, Durjaya arrived in the region of Mount Sumeru. The lake Manasa is located there. And by the shores of the lake, Durjaya found Urvashi. He gave the apsara the garland and lived happily with her for some time. After a few days had passed, Urvashi asked Durjaya, “King please tell me what transpired when you went home.” Durjaya thereupon told Urvashi about the conversation that he had with his wife and about what the sage Kanva had asked him to do. Urvashi was alarmed when she heard the king’s account. “What have you done?” she exclaimed. “Hasten back, otherwise Kanva and your wife will curse the two of us.” But Durjaya was so smitten with love for Urvashi that he refused to listen to Urvashi’s entreaties. Urvashi therefore made herself very ugly. This repelled Durjaya, and he gave Urvashi up. For twelve years Durjaya performed difficult tapasya, living only on fruits and roots. For another twelve years, he lived only on air. After having thus meditated for twenty-four years, Durjaya went to Kanva’s hermitage and told the sage all that he had done. “I am pleased that you have realised the folly of your ways and have performed tapasya,” said Kanva. “But that alone is not enough. Your sin has been too severe. Go to the city of Varanasi and live there. Shiva is ever-present in that city and he will pardon all your sins.” Durjaya did this and was pardoned all his sins. Such are the benefits of praying to Shiva and such are the virtues of the wonderful city of Varanasi. ", "next": "12.22", "prev": "12.20", "title": "DURJAYA AND URVASHI"}