{"index": "12.29", "image": "resized_images/THE ISHVARA GITA.png", "text": [" While Lomaharshana was reciting the Kurma Purana to the assembled sages, Krishna Dvaipayana Vedavyasa arrived on the scene.", " Lomaharshana and the other sages requested Vedavyasa to instruct them about the path to true knowledge.", " This is what Vedavyasa told them.", " The paramatman (the divine soul) is the only truth.", " It is ever pure and ever present.", " It is from the paramatman that the universe is created and it is into the paramatman that the universe merges at the time of its destruction.", " The paramatman is not the earth.", " It is not water, energy, wind or sky.", " It cannot be touched, nor can it be sensed.", " The paramatman is always present in the jivatman (human soul).", " Any sense of distinction between the paramatman and the jivatman is due to illusions and the presence of the ego.", " The truly learned rise above such illusions.", " Therefore, a wise person does not see any distinction between his own self and other objects.", " The same paramatman pervades everything.", " Just as all rivers unite with the ocean, a learned person realises that all individuals jivatmans unite with the paramatman.", " Yoga (literally, union) is a technique of meditation that helps to bring about this sense of identity between the jivatman and the paramatman.", " Yoga has eight components.", " The first is pranayama.", " This means the control of one’s breath.", " The breath of life is known as prana and ayama means control.", " There are three parts to any pranayama exercise.", " When the breath is being exhaled, that is known as rechaka;", " and the process of inhalation is known as puraka.", " When the breath is neither being inhaled nor exhaled, that is kumbhaka.", " The second component of yoga is pratyahara.", " This connotes the control of one's senses.", " Yoga must always be performed in a proper posture and this is the third component of asana.", " The fourth component is called yama.", " This means the practice of non-violence, truthfulness and pity.", " The fifth component is known as niyama.", " This encompasses worship, studying the Vedas, cleanliness and meditation.", " Yoga has a sixth component named dhyana.", " In this process, one conjures up an image of the paramatman and meditates continuously on it.", " The process of fixing this image in one's heart is the seventh component, dharana.", " And the final component, samadhi, is a situation where the individual realises the complete identity between the jivatman and the paramatman. "], "next": "12.30", "prev": "12.28", "title": "THE ISHVARA GITA"}