{"index": "12.25", "image": "resized_images/GEOGRAPHY AND ASTRONOMY.png", "text": " It is hoped that you have not forgotten that Svayambhuva Manu had a son named Priyavrata. Priyavrata had ten sons. Their names were Agnidhra, Agnivahu, Vapushmana, Dyutimana, Medha, Medhatithi, Bhavya, Savana, Putra and Jyotishmana. Medha, Agnivahu and Putra had no desire to rule. They were not interested in material pursuits and became hermits. Priyavrata divided the earth amongst the remaining seven sons. Thus it was that the earth came to be divided into seven regions or dvipas. The names of these regions are Jambudvipa, Plakshadvipa, Shalmalidvipa, Kushadvipa, Krounchjdvipa, Shakadvipa and Pushkaradvipa. Agnidhra ruled over Jambudvipa, Medhatithi over Plakshadvipa, Vapushmana over Shalmalidvipa, Jyotishmana over Kushadvipa, Dyutimana over Krounchadvipa, Bhavya over Shakadvipa and Savan over Pushkaradvipa. Agnidhra, the ruler of Jambudvipa, had nine sons. Their names were Nabhi Kimpurusha, Hari, Ilavrita, Ramya, Hiranyavana, Kuru, Bhadrashva and Ketumala. Agnidhra divided Jambudvipa into nine regions (varshas) and gave each of his sons a region to rule over. A king named Bharata was one of Nabhi’s descendants. After the name of Bharata, the region that Nabhi ruled over has come to be known as Bharatavarsha. There are fourteen regions (lokas) in the universe. Seven of them form the upper regions. Their names are bhuloka, bhuvarloka, svarloka, maharloka, janaloka, tapolaka and satyaloka. Bhuloka is the earth and its limits extend upto the points that can be lit up the rays of the sun and the moon. Take the distance from bhuloka to the solar circle. An equal distance beyond the solar circle constitutes bhuvarloka. The region from the limits of bhuvarloka to the region of Dhruva (the Pole Star) is svarloka or svarga (heaven). Above the solar circle is the lunar circle and above that come, successively, the regions of the stars (nakshatras), Budha (Mercury), Shukra (Venus), Mangala (Mars), Brihaspati (Jupiter), the saptarshis’ (the constellation Ursa Majoris or the Great Bear) and Dhruva. Shani (Saturn), Brihaspati and Mangala move slowly. The sun, the moon, Budha and Shukra move relatively fast. The sun’s chariot is drawn by seven horses named Gayatri, Vrihati, Ushnika, Jagati, Pamki, Anushtupa and Trishtupa. In each month, the sun adopts a specific form known as an aditya. There are thus twelve adityas - Dhatta, Aryama, Mitra, Varuna, Shakru, Vivasvana, Pusha, Parjanya, Amshu, Bhaga, Tvashta and Vishnu. Maharloka is above the world of Dhruva (dhruvaloka). It is reserved for those who have been freed from the bonds of the world. Janaloka is still further away. Brahma’s sons live there. Tapaloka is beyond janaloka and satyaloka is beyond tapaloka. Another word for satyaloka is brahmaloka, since Brahma lives there. Vishnu lives there as well. (The Kurma Purana does not mention the seven lokas that constitute the lower regions of the universe. This is the underworld (patala).) There are seven seas that surround the seven dvipas on earth. The names of the seas are Kshara, Ikshu, Sura, Ghrita, Dadhi, Kshira and Svadu. (The names of the seven oceans often differ from Purana to Purana.) Right in the centre of Jambudvipa is Mount Sumeru. To its south lie the mountains Himavana, Hemakuta and Nishadha; and to its north the mountains Nila, Shveta and Shringi. Bharatavarsha is to the south of Mount Sumeru. Brahma’s assembly is located on the peak of Mount Sumeru. ", "next": "12.26", "prev": "12.24", "title": "GEOGRAPHY AND ASTRONOMY"}