{"index": "12.3", "image": "resized_images/VARNASHRAMA DHARMA.png", "text": " Vishnu said that before creation began, there was only water in the universe and Vishnu slept on these waters. When it was time for creation to begin, Brahma emerged from Vishnu’s body. And Shiva emerged from Vishnu’s anger. Lakshmi too was created from Vishnu’s body and took her place by Vishnu’s side. Brahma told Vishnu, “Please use this goddess to delude the beings whom I will create. Tell her to sow the seeds of illusions in their minds. Please tell her to make the righteous prosper.” Vishnu complied. He requested Lakshmi, “Please delude and destroy gods, demons and humans who are about to be created. But please leave the righteous alone and make them prosper. I will tell you how to know the righteous. They are those that follow the precepts of varnashrama dharma.” The brahmanas constitute the first of the four classes. Brahma created nine sons from his mental powers. Their names were Marichi, Bhrigu, Angira, Pulastya, Pulaha, Kratu, Daksha, Atri and Vashishtha. These sons became sages and they were the first brahmanas. They were created from Brahma’s mouth There are six types of action that are recommended for brahmanas. These are yajana (performing sacrifices), yajana (acting as priests at sacrifices), dana (donation of alms), pratigraha (receiving gifts), adhyapana (teaching and adhyayana (studying). A brahmana who performs these tasks well, attains the wonderful place known as prajapatya. (This would seem to be synonymous with Brahma’s residence of Brahmaloka). The kshatriyas constitute the second of the four classes. They were created from Brahma’s arms. The duties of kshatriyas include dana (donation of alms), adhyayana (studying) and performing yajnas (sacrifices). But their primary duties are to take up arms and fight, It is their job to punish the evil and protect the good. A kshatriya who performs these tasks well, attains Indra’s residence of Indraloka. The vaishyas constitute the third of the four classes. They were created from Brahma’s thighs. Like the kshatriyas, the vaishyas can also donate alms, study and perform sacrifices, But their primary duty is agriculture, (In many other Puranas, trade and animal husbandry are mentioned in addition to agriculture). A vaishya who performs these tasks well, gets to live with Vayu, the god of the wind. The shudras constitute the last of the four classes. They were created from Brahma’s feet. Their primary duty is to serve the other three classes. In addition, a shudra can adopt artisanship as an occupation, A shudra who performs these tasks well, will live with the gandharvas (singers of heaven). Generally speaking, all four classes have to observe the religion that is prescribed in the vedas. There are various other shastras (religious texts) that circulate on earth. But many of them are against the Vedas. The religion that is prescribed in such anti-Vedic texts must not be followed. Only sinners follow such religions, and they are doomed to eternal damnation. There are four ashramas (stages of life). The first one is brahmacharya (celibate studenthood). The primary duties of a person who is in this stage of life are studying the Vedas and serving one’s guru (teacher) well. He has to live on alms that are obtained through begging. When this stage of life if over, there are two options that are available to the individual. In rare instances, he may desire to devote the rest of his life to studying and meditation. Such a person is known as naishthika. More commonly, individuals wish to step into the next stage of life, An individual who does so is known as an upakurvana. The second stage of life is garhasthya (householder stage). A householder’s primary duties are serving guests, performing sacrifices, donating alms, worshipping the gods and keeping the sacred fire burning in the house at all times. In cases where the householder is absent from the house, these functions are to be performed by his wife or sons, or even by his priest. A householder must not also forget to study a little bit of the Vedas every day. The householder stage is superior to the other three stages of life. The reason is that the alms provided by a householder are the means of sustenance for individuals who are in the other three stages of life. A householder may be one of two types. He may be a sadhaka, in which case his chief obsession is that of satisfying his friends and relatives. Alternatively, there may be a householder who is udasina. This means that he is not really interested in his wife, his sons or in the acquisition of material wealth. His chief obsession is that of being freed from the bonds of the world. The third stage of life is vanaprastha (forest dwelling stage). Such a person retires to the forest and lives on fruits and roots. He studies the Vedas, performs tapasya (meditation) and observes religious rites. One should never embark on a forest-dwelling stage unless one’s mind is ready for it. This also means that one must have had sons. Without sons to carry on the line, it is not recommended that a householder venture out on the forest-dwelling stage. There are two types of forest-dwellers. The first type consists of individuals who primarily devote themselves to worshipping the gods and performing religious ceremonies. Such an individual is known as a tapasya, because he does do some tapasya. But there are individuals who devote themselves entirely to meditation. Such a person is known as a sannyasika, since there is very little of difference between him and a sannyasi (hermit). The fourth and final stage of life is sannyasa (hermithood). Such individuals spend all their time in meditating. They beg food for a living. It is not proper to become a hermit unless one’s mind has achieved detachment from the world. There are two types of hermits. The first type consists of those who are trying to realise the true nature of the atman (human soul). Such a person treats all other individuals as he would treat himself and is known as a yogi, but there are also hermits who go through intense meditation so as to attain the supreme wisdom. Such a person is known as a parameshthika. There are various other traits that are demanded by the righteous way of life. One must forgive and display pity, one must not be jealous and must be ready to sacrifice one’s own selfish interests. One must be truthful, practice non- violence and learn to control the senses. One must also visit tirthas (places of pilgrimage). It is also important to realise that one does not perform actions for the sake of the fruits of the actions. The fruits of all actions vest with the brahman (the divine essence). In fact, it is a gross misconception to think that la specific action is being performed by an individual. All actions are performed by the brahman, the ordinary human being is merely an instrument. As long as this realisation is missing, an individual is ignorant and is doomed to the shackles of worldly bonds. ", "next": "12.4", "prev": "12.2", "title": "VARNASHRAMA DHARMA"}