{"index": "12.32", "image": "resized_images/SHIVA AND BRAHMA.png", "text": " Many years ago, Brahma lost his head slightly. He began to imagine that he was superior to Shiva and Vishnu. He told all the sages, “I am the supreme godhead. There is no one else but me.” While Brahma was thus instructing the sages, Vishnu arrived and was enraged at Brahma’s behaviour. “You are indeed ignorant,” he told Brahma. “I am the supreme godhead. You are only the creator. But I am, after all, the preserver.” While Vishnu and Brahma were thus arguing the four Vedas adopted animate forms and appeared before them. Each of the Vedas tried to persuade Brahma and Vishnu that Shiva was superior to both of them. Vishnu was persuaded by this reasoning, but Brahma was not. He told the Vedas, “You must be joking. How can Shiva be superior to the two of us? He is always wandering around with ghosts and demons for companions.” While all this was going on, who should arrive but Shiva? Brahma promptly proceeded to insult Shiva. Shiva then created a being named Kalabhairava from his own body and Kalabhairava started to fight with Brahma. In those days, Brahma used to have five heads. In course of the fighting, Kalabhairava chopped off one of Brahma’s heads. Ever since that day, Brahma has had four heads and four faces. (In many other Puranas, there is no mention of Kalabhairava. shiva performed the chopping off himself). Brahma died as soon as his head had been cut off. Shiva did manage to revive him. But the mere fact that Shiva had killed Brahma, meant that Shiva and committed the sin of killing Brahma, a brahmana. As a result of this sin, Brahma’s severed head got stuck to Kalabhairava’s palm and would not be dislodged. (In accounts where Shiva was himself responsible for the Killing, the severed head adhered to Shiva’s palm). Kalabhairava roamed around the world and the head accompanied him on his travels. for a thousand years of the gods, Kalabhairava continued to travel. Eventually, Vishnu advised Kalabhairava to go to the sacred city of Varanasi. As soon as Kalabhairava arrived at the city of Varanasi, the head (kapala) got dislodged (mochana). A tirtha is a place of pilgrimage. The exact spot where this wonderful happening took place is accordingly known as Kapalamochana tirtha. There are many other tirthas that the Kurma Purana describes, Among these are Prayaga, Kurukshetra, Gaya and Madhuvana (Mathura), The glories of the river Narmada are also described. The waters of the river Sarasvati purify a sinner after three days of bathing, while the waters of the river Yamuna takes an entire week. The mere touch of a drop of water from the river Ganga purifies a sinner. But as for the river Narmada, the sight of the waters alone is enough. ", "next": "12.33", "prev": "12.31", "title": "SHIVA AND BRAHMA"}