{"index": "12.30", "image": "resized_images/RITUALS.png", "text": " The sacred thread (upavita) ceremony is very important and must always be performed at eight year of age.\n Brahma had created the cotton tree so that sacred threads might be made out of cotton.\n But on occasions it is permissible to make sacred threads out of grass.\n A guru (teacher) is always to be respected and worshipped.\n In principle, a guru is anyone from whom knowledge might be gained.\n But apart from usual teachers, a father-in-law, a grandfather and an individual belonging to a superior varna are also recognised as gurus.\n A mother, a grandmother, a guru's wife, an aunt, a mother-in-law and the wife of an elder brother are recognised as being equivalent to a guru.\n One must a guru ever be show disrespect or argued with.\n A person who hates his guru is certain to go to hell.\n Amongst gurus or those who are equivalent to gurus, the most important are a father, a mother, a teacher, an elder brother and a husband.\n These have to be respectfully served at all costs.\n A brahmana must always wash his mouth after eating, drinking, sleeping, bathing, spitting or changing clothes.\n The mouth must also be washed before sitting down to study.\n It is also recommended that the mouth be washed after talking to those who do not believe in the Vedas, shudras, outcasts and women.\n If a mouthwash is not possible, one can cleanse oneself by touching a piece of clothing is touched inadvertently, the act of purification requires the touching of water, wet grass or the earth.\n One of the most sacred mantras (incantations) that one can chant is the gayatri.\n Before chanting, thirty-two-cells must be drawn, as shown, and the letters of the mantra must be written down in the cells, as indicated.\n To recite the gayatri, one now reads the letters as they occur in the numbered cells.\n That is, one starts with cell number one, moves to cell number two and so on and so forth.\n 5 13 21 29 28 20 12 4 vvr sya pra se ja nah va tu 6 14 22 30 27 19 11 3 re dhi cho sa ra yo de vi 7 15 23 31 26 18 10 2 ni ma da va ro yo rgo tsa 8 16 24 32 25 17 9 1 yam hi yat dom pa dhi bha ta A person who kills a brahmana, drinks wine, or steals gold from a brahmana, has to perform penance by killing himself.\n A person who kills a brahmana may also build a hut in the forest and live there for a period of twelve years.\n But throughout the period, he has to bear a mark signifying the dead brahmana’s head on his palm.\n He is also not permitted to visit another brahmana or a temple as long as the penance is going on.\n It needs to be mentioned that the sin of killing a brahmana can be thus pardoned only if the killing was done inadvertently.\n If the killing was conscious, no penance will suffice.\n Under such circumstances, the sinner had best immolate himself in a fire, drown himself, or fast to death.\n For other sins, the observance of a religious rite (vrata) is often indicated.\n The major vratas are as follows.\n (i) Santapana:\n This involves living for one whole day on cow’s urine, cowdung, cow’s milk, curds made from cow’s milk and clarified butter made from cow’s milk.\n The next day is a day of fasting.\n (ii) Mahasantapana:\n This is a more severe version of the earlier vrata.\n In the case of santapana vrata, five items were listed as permissible food.\n Mahasantapana vrata lasts for a period of six days, and on each of these days, only one of the five items mentioned may be partaken of.\n The seventh day is day of fasting.\n (iii) Prajapatya or krichha:\n If this vrata is to be observed, one can eat only during the day.\n For the first three days, one is only permitted to eat twenty-six handfuls of food, each handful being as large as a hen’s egg.\n For the next three days, twenty-two handfuls are permitted, but only in the evenings.\n And for the final three days, twenty-four handful are permitted.\n (iv) Atikrichha:\n This is a more severe version of the earlier vrata.\n For the first three days, a single handful of food is permitted during the day.\n For the next three days, one handful is permitted in the evenings.\n One handfuls of food, each handful being as large as a hen’s egg.\n For the next three days, twenty-two handfuls are permitted, but only in the evenings.\n And for the final three days, three-four handfuls are permitted.\n (v) Paraka:\n Twelve continuous days of fasting are required for this.\n (vi) Taptakrichha:\n This vrata lasts for a period of twelve days, during which time one is permitted to bathe only once a day.\n For the first three days one drinks only water;\n for the next three days one lives on milk;\n one has to live on clarified butter for the ensuing three days are days of fasting.\n (vii) Krichhatikrichha:\n If one is to observe this vrata, one has to live only on milk for the space of twenty-one days.\n (viii) Padakrichha:\n This vrata lasts for four days.\n For the first day one eats only one meal;\n the second day is a day of fasting;\n on the third day one can eat as much as one wants;\n and on the fourth and final day, one fasts.\n (ix) Chandrayana:\n This vrata lasts for an entire month and begins on the day of the full moon (purnima).\n On the first day, fifteen handfuls are to be eaten.\n Thereafter, one handfuls less is eaten on successive days, until on the day of new moon (amavasya), one fasts completely.\n On each day that follows, the amount of food eaten is increased by one handful.\n Finally, on the day of the next full moon, fifteen handfuls of food are eaten and the vrata is completed.\n As mentioned earlier, those who kill brahmanas, steal their gold, or drink wine, are sinners.\n Also sinners are those who associate with these aforementioned sinners for more than one year.\n Those who associate with outcasts for more than a year are also sinners.\n A brahmana who drinks wine should drink boiling wine as a penance.\n It is also permitted to drink cow’s urine as atonement.\n A person who steals gold from brahmanas will go to the king and confess his guilt.\n His penance will be completed when the king beats him to death with a club.\n The only exception is a case where the thief himself happens to be a brahmana.\n He can then perform penance by meditating.\n It is always a king’s duty to punish sinners.\n If the king fails in this task, the sins vest with the king.\n A person who associates with sinners has to observe taptakrichha vrata for one year.\n A man who takes on outcast for a wife has to observe taptakrichha or santapana.\n A brahmana who kills a kshatriya is required to observe prajapatya, santapana or taptakrichha for one year.\n In case the victim is a vaishya, krichhatikrichha or chandrayana are indicated.\n If a shudra is killed, five hundred cows have to be donated.\n If an elephant is killed, taptakrichha vrata has to be observed.\n Chandrayana will suffice if a cow is killed inadvertently.\n But if a cow is consciously killed, there is no penance that is adequate.\n For minor thefts, the stolen goods have to be returned to the rightful owner and santapana observed.\n But if a brahmana steals foodgrains, he has to observe prajapatya for an entire year.\n A cannibal can purity himself through chandrayana vrata.\n A person who eats the meat of a crow, dog or elephant, has to observe taptakrichha.\n Santapana is for those who happen to eat mongooses, owls or cats.\n An eater of camels or donkeys observes taptakrichha.\n A brahmana who becomes an atheist can cleanse himself through prajapatya.\n If he revolts against the gods or against his guru, the act of purification involves taptakrichha.\n A brahmana who recites the Puranas to outcasts has to observe chandrayana. There are several other forms of penance that are catalogued by the Kurma Purana. ", "next": "12.31", "prev": "12.29", "title": "RITUALS"}