{"index": "12.5", "image": "resized_images/A DIGRESSION ON TIME.png", "text": [" The smallest unit of time is a nimesha.", " Fifteen nimeshas make one kashtha, thirty kashthas are one kala and thirty kalas constitute one muhurta.", " There are thirty muhurtas in a span of day and night (ahoratra).", " Thirty such ahoratras make up a month.", " There are two pakshas (fortnight) in every month.", " Six months constitute an ayana and two ayanas a year.", " There are thus twelve months in every year.", " The names of the two ayanas are uttarayana and dakshinayana, While humans pass through uttarayana, the gods pass through only one day.", " Similarly, when humans pass through dakshinayana, the gods pass through merely one night.", " One year for humans is equivalent to a time span of one day and one night for the gods.", " Twelve thousand years of the gods make up one mahayuga.", " This is subdivided into four yugas (eras).", " The names of these eras are satya yuga or krita yuga, treta yuga, dvapara yuga and kali yuga.", " Satya yuga has four thousand years, treta yuga three thousand, dvapara yuga two thousand and kali yuga one thousand.", " This adds up to ten thousand years.", " But there are also periods that join two yugas:", " (sandhyamsha).", " Satya yuga has a sandhyamsha of four hundred years, treta yuga of three hundred, dvapara yuga of two hundred and kali yuga of one hundred, There will therefore be seven hundred additional years between satya yuga and treta yuga, five hundred between treta yuga and dvapara yuga of two hundred and kali yuga of one hundred.", " There will therefore be seven hundred additional years between satya yuga and treta yuga, five hundred between treta yuga and dvapara yuga, three hundred between dvapara yuga and kali yuga and five hundred between kali yuga and the next satya yuga.", " These are two thousand additional years, and when added up to the earlier figure of ten thousand.", " make up twelve thousand years.", " There are a little over seventy-one manvantaras (eras) in each mahayuga.", " Each manvantara is a time period that is ruled over by a Manu.", " The first Manu in the present kalpa (cycle) was Svayambhuva Manu and there were several other Manus after him.", " Each kalpa in fact passes during one of brahma’s days and there are fourteen manvantaras in a kalpa.", " Stated differently, there are one thousand mahayugas in every kalpa.", " Three hundred and sixty kalpas constitute one of brahma’s years.", " One hundred times this time period is known as a parardha.", " At the end of this period, the whole universe is destroyed and Brahma, Vishnu and Shiva are also destroyed.", " At the end of the destruction, creation starts afresh and this creation is known as sarga.", " There is a smaller process of destruction that takes place at the end of every kalpa.", " Brahma Vishnu and Shiva are not destroyed, but everything else is.", " The creation that comes at the end of this minor destruction is known as pratisarga.", " The present kalpa is known as varaha kalpa.", " The one that preceded it was known as padma kalpa.", " “Why is the present kalpa called varaha kalpa?", "” the gods and the sages asked Vishnu.", " Vishnu told them the story of his boar incarnation. "], "next": "12.6", "prev": "12.4", "title": "A DIGRESSION ON TIME"}