{"index": "12.7", "image": "resized_images/CREATION CONTINUED.png", "text": [" Brahma first created five sons through his mental powers.", " Their names were Sanaka, Sanatana, Sanandana, Kratu and Sanatakumara These five sons became sages and did not have any offspring.", " Brahma therefore had to create some more beings so that the population of the universe might increase.", " But prior to that, he decided to perform tapasya.", " However, the meditation did not yield him any results and Brahma became very angry and disheartened.", " He started to weep and a teardrop fell on the ground.", " From this drop, there emerged Shiva.", " Brahma bowed before Shiva and said, “Please create some living beings.", "” This Shiva proceeded to do.", " But all the beings that Shiva created were mirror images of himself.", " That is, they were all immortal.", " “I beg your pardon,” retorted Shiva.", " “That I refuse to do.", " Old age and disease are not objects that should be sought after.", " In fact, they are evil.", " I flatly refuse to create such evil.", "” “All right then.", "” said Brahma.", " “I will take care of creation myself.", " Please stop creating.", "” The first objects that Brahma created were water, fire, the sky, heaven (svarga), wind, rivers, mountains, oceans, trees, herbs and time.", " Brahma next created eleven sons from his mental powers.", " Their names were Marichi, Bhrigu, Angira, Pulastya, Pulaha, Kratu, Daksha, Atri Vashishtha, Dharma and Sankalpa.", " (In the earlier section on varnashrama dharma, only nine sons were mentioned.", " Dharma and Sankalpa did not figure in that list.", ") Thereafter, Brahma created four classes of beings.", " These were gods, demons, ancestors (pitris) and humans.", " The demons were born from Brahma’s thighs, the gods from his mouth.", " The snakes (sarpa), the yakshas (demi-gods), the ghosts (bhuta) and the gandharvas were born next.", " Cows were born from Brahma’s stomach, and horses, elephants, donkeys, deer, camels and mules from his feet.", " Herbs and trees emerged from Brahma’s body-hair.", " (This account contradicts a more common account given in some of the other Puranas, such as the Bhagavata Purana.", " In the more usual account, all beings are descended from the sage Kashyapa.", " Kashyapa married thirteen of Daksha’s daughters.", " These daughters were named Aditi, Diti, Danu, Kashtha, Arishtha, Surasa, Ila, Muni, Krodhavasha, Tamra, Surabhi, Sarama and Timi.", " Aditi’s offspring were the gods (adityas), Diti’s the demons (daityas).", " Danu’s offspring were other demons (danavas), Kashtha’s children horses, Arishtha’s gandharvas, Surasa’s demons (rakshasas), Ila’s offspring trees and herbs, Muni’s the apsaras (dancers of heaven), Krodhavasha’s ghosts (pishachas), Tamra’s birds, Surabhi’s cattle, Sarama’s wild animals and Timi’s marine creatures.", " The Kurma Purana itself refers to this alternative account subsequently).", " To return to the present account of the Kurma Purana, Brahma thereafter divided his body into two.", " One half was male and was called Svayambhuva Manu.", " The remaining half was female and was called Shatarupa.", " Manu and Shatarupa married and had two sons and two daughters.", " The sons were named Priyavrata and Uttanapada and the daughters were named Prasuti and Akuti.", " Since all humans are Manu’s descendants, they are known as manava.", " Prasuti married Daksha and they had twenty-four daughters.", " (The Puranas are not at all consistent about the number of daughters Prasuti and Daksha had.", " The number is sometimes twenty-four, sometimes fifty and sometimes sixty).", " Thirteen of the twenty-four daughters were married to Brahma’s son Dharma.", " Of the remaining eleven, Khyati was married to Bhrigu, Sati to Shiva, Sambhuti to Marichi, Smriti to Angira, Priti to Pulastya, Kshama to Pulaha, Sannati to Kratu, Anasuya to Atri, Urjja to Vashishtha, Svaha to the fire-god Agni and Svadha to the ancestors (pitris). "], "next": "12.8", "prev": "12.6", "title": "CREATION CONTINUED"}