{"index": "12.8", "image": "resized_images/BRAHMA, VISHNU AND SHIVA.png", "text": " The gods and the sages told Vishnu, “We are getting a bit confused.\n You have told us that Brahma emerged from Vishnu’s body And yet you have also told us how Brahma was born inside a golden egg.\n Which of these is the correct account?\n Then again, you have told us that Shiva was born from one of Brahma’s tears.\n But we have sometimes heard otherwise.\n Which is right?\n Please remove this confusion.\n” “There is no confusion,” replied Vishnu.\n “Let me explain it for you.\n” Brahma was born from the golden egg right at the beginning, at the time of the original creation.\n But at the end of every kalpa there is a minor destruction when all living beings other than Brahma, Vishnu and Shiva die.\n When the destruction is over, creation has to start afresh.\n At the end of the last kalpa, there was water everywhere in the universe.\n The heaven, the earth and the underworld, were all flooded with water.\n There were no gods and no sages.\n Only the great Vishnu slept on the water.\n He had a thousand hoods, a thousand eyes, a thousand arms and a thousand feet.\n This was his form of Ananta, the snake (naga).\n (The Kurma Purana completely identifies Vishnu with Ananta.\n More commonly, the Puranas state that the snake Ananta was the son of Kadru and the sage Kashyapa.\n He pleased Brahma through his prayers and obtained from Brahma the boon that he would be permitted to hold up the earth on his hoods.\n The Kalika Purana specifically states that, at the time of destruction, Vishnu and Lakshmi rest on Ananta’s central hood.\n The Vishnu Purana adds the information that Ananta was one of Balarama’s avataras.\n The names Shesha Vasuki and Gonasa are often used synonymously with Ananta.\n) While Vishnu thus slept on the water, a wonderful lotus sprouted from his navel.\n the lotus was gigantic and shone like the sun.\n Its fragrance spread in all directions.\n Brahma appeared inside the lotus.\n Since padma means lotus and yoni means place of Birth, Brahma is also known as Padmayoni.\n Brahma saw Vishnu sleeping on the water and woke him up.\n “Who are you?\n” asked Brahma.\n “I am Vishnu.\n” replied Vishnu.\n “I am the origin of everything.\n That will be there in the universe is inside my body.\n” “Is that really so?\n” asked Vishnu.\n “Let me see.\n” Vishnu thereupon entered Brahma’s body.\n He really found the three worlds, the gods, the demons and the humans inside Brahma’s stomach and was greatly surprise.\n He emerged from Brahma’s mouth and told Brahma, “What I have seen inside your body is truly wonderful.\n But I too can show you many worlds inside my body.\n Please enter and see for yourself.\n” It was now Brahma’s turn to enter Vishnu’s body.\n But when Brahma did this, he could find no end to Vishnu’s stomach.\n It was true that there were many worlds inside Vishnu’s body.\n However, Brahma could find no way of coming out from Vishnu’s stomach.\n He finally jab to emerge through Vishnu’s navel, through the stalk of the lotus that was there.\n “How dare you try to confine me inside your body?\n” demanded Brahma, as soon as he managed to get out.\n “Please do not get angry.\n” replied Vishnu.\n “I merely thought that I would play with you for a while.\n Otherwise, it is inconceivable that anyone should dare to confine the great Brahma.\n Please pardon me.\n And as a token of your pardon, please grant me the boon that henceforth, you will be known as my son.\n After all, you did emerge from a lotus that grew out of my navel.\n” “Agreed.\n” said Brahma.\n “Let us make peace.\n After all;\n there is no one else.\n We are the lords of everything, we are parts of the brahman.\n” “Please do not forget Shiva,” responded Vishnu.\n “Your words will anger him and bring about your undoing.\n” While the two were thus conversing, Shiva appeared on the scene.\n He had a third eye in the middle of his forehead and his hair was matted.\n A trident could be seen in his hand.\n “Who is this fellow?\n” asked Brahma.\n “He looks like an upstart.\n” Vishnu calmed Brahma down.\n He also gave Brahma divine eyes so that Brahma could comprehend the true nature of Shiva.\n Brahma then started to pray to Shiva.\n Pleased with Brahma’s prayers, Shiva agreed to grant Brahma a boon.\n “Please grant me the boon that you will be born as my son,” said Brahma. Shiva agreed to do so and went away. ", "next": "12.9", "prev": "12.7", "title": "BRAHMA, VISHNU AND SHIVA"}