{"index": "12.9", "image": "resized_images/RUDRA.png", "text": [" Brahma returned to his seat on the lotus flower.", " Suddenly, two demons named Madhu and Kaitabha appeared, They were exceedingly strong and threatened to destroy everything that Brahma would create.", " Brahma therefore requested Vishnu to kill these two demons.", " Vishnu created two beings from his own body and these two beings killed the demons.", " (The Madhu and Kaitabha story is given in greater detail in other Puranas, such as the Kalika Purana.", " While Vishnu was sleeping, the two demons were born from his ears.", " One of them desired to have some honey as soon as he was born, Since the word for honey is madhu, he came to be known as Madhu.", " The other one looked like an insect.", " Since the word for insect is kita, he came to be known as Kaitabha.", " these brothers attacked Brahma and Vishnu had to fight with them so as to rescue Brahma.", " The fight went on for five thousand years before Vishnu could kill them.", " after the demons were killed, the fat (meda) from their bodies formed the earth.", " That is the reason why the earth is known as medini.", ") After Madhu and Kaitabha had been killed, Brahma could start to create.", " He first created, through his mental powers, the sons whose names have earlier been mentioned.", " since Shiva had promised that he would be born as Brahma’s son, Brahma decided to perform tapasya so as to accomplish this.", " He prayed for many years, but nothing happened.", " In utter frustration, Brahma began to cry.", " the ghosts (bhuta and preta) were born from these tears.", " Brahma was so disgusted at having created these awful creatures, that he committed suicide.", " It was then that Shiva was born from Brahma’s mouth and Brahma revived.", " (You will have noticed the contradiction.", " Earlier, it had been stated that Shiva was born from a teardrop and there had been no mention of Brahma’s suicide, The suicide is not mentioned in other Puranas either, nor is there any mention of Shiva or Rudra being born from a teardrop.", " In the Vishnu Purana, he suddenly appeared in Brahma’s lap.", " In the Padma Purana, he was born from Brahma’s furrowed brows).", " The baby started to cry as soon as he was born.", " “Don’t cry,” said Brahma.", " ”Since you cried when you were born, you will be known as Rudra.", "” (The Kurma Purana is not specific on why the baby cried.", " The other Puranas state that the baby cried for the want of a name.", " Brahma therefore gave the boy the name of Rudra, as the word rub means to cry.", " The boy continued to cry and Brahma gave him several other names as well.", " The Puranas however disagree about what these various names were).", " In addition to Rudra, Brahma gave the boy the names Bhuva, Sarva, Ishana, Pashupati, Bhima, Ugra and Mahadeva.", " In these eight different forms, Shiva was to live in the sun, the water, the sky, the fire, the wind, the trees, the bodies of brahmanas and the moon. "], "next": "12.10", "prev": "12.8", "title": "RUDRA"}