{"index": "13", "image": "resized_images/MATSYA PURANA.png", "text": [" It’s the sixteenth Purana.", " During the period of Mahapralaya, Lord Vishnu had taken Matsya avatar (fish incarnation) to save the seeds of all lives and Manu.", " Matsya Purana contains a comprehensive description of Manu and Matsya avatar.", " General contents of this Purana are Description of the greatness of Narsimh incarnation.", " Description of all the ten incarnations of Lord Vishnu.", " Greatness of fasting like Anant Tritiya and the places of pilgrimage like Prayag.", " Tales of Chandra vansh, Surya vansh and Kuru vansh and the kings like Yayati, Kartveerya etc.", " Description of the Kalpa and Yugas.", " Appearance of idols.", " Appearance and construction of Deva-mandapa (canopy for the deities).", " Tale of Savitri and Satyavan.", " Results of auspicious and inauspicious motion of the planets.", " Birth of Parvati.", " Immolation of Madan (Kamadeva) Wedding of Lord Shiva with Parvati.", " Birth of Kartikeya.", " Duties of a king.", " Description of the future kings.", " This Purana is said to be narrated by Matsya avatar of Lord Vishnu to Manu, who was awaiting Lord’s arrival during Mahapralaya in his boat anchored on a very high mountain.", " <WORK IN PROGRESS…> According to the Matsya Purana (47.", "32), \"When the end of an Age rolls around and time has lost its strength, then Lord Vishnu is born among men.", " When the gods and demons go to war, then Hari [Vishnu] is born.", "\" The Matsya Purana (47.", "32-52), for instance, enumerates twelve avatars.", " Matsya Purana (221.", "2), Prosperity forsakes those who always dream of fate and favors those who persevere.", " One should therefore always be active and alert.", " Matsya Purana (180.", "5-7), Even the worst problems have solutions if one only perseveres.", " Matsya Purana (53.", "65,68,69):", " A Purana has five characteristics as opposed to an Akhyana.", " (The scriptures are divided into three classes - sattvika, rajasika, and tamasika.", ") The glory of Lord Hari is greater in the sattvika Puranas;", " the glory of Lord Brahma is more in the rajasika Puranas;", " the glory of Lord Siva and Agni is more in the tamasika Puranas.", " In the mixed scriptures the glory of Sarasvati and the Pitrs is explained.", "\" The verse cited from the Matsya Purana refers to the five characteristics of a Purana.", " These characteristics are given in another verse of the Matsya Purana, 53.", "65:", " sargasca pratisargasca vamso manvantarani ca vamsyanucaritancaiva puranam pancalaksanam \"Creation, dissolution, genealogy, manvantaras and descriptions of the activities of famous kings, these are the five characteristics of a Purana.", "\" The characteristics of Srimad Bhagavatam are given in the Matsya Purana (53.", "20-22), \"That which explains the topmost principles of religion, basing it on Gayatri, and which has the incident of the killing of Vrtrasura is to be known as the Srimad Bhagavatam.", " This Purana has eighteen thousand verses.", " Whoever makes a copy of the Srimad Bhagavatam and, placing it on a golden lion throne, donates it on the full moon day in the month of Bhadra (August- September), will attain the supreme goal\".", " According to Matsya Purana (Chapter 53) the Hayagriva avatara of Visnu preceded Matsya;", " when the worlds were burnt down, Visnu in the form of a horse re-compiled the four Vedas, Vedangas, etc.", " The Devi Bhagavata and the Skanda Purana in its Dharnmranya Khanda, however, allude to two different accounts on the origin of the Hayagriva form of Visnu. This Purana consists of xx chapters: "], "next": "13.1", "prev": "12.34", "title": "MATSYA PURANA"}