{"index": "14.1.5", "image": "resized_images/The Beginning of Creation.png", "text": " Lord Shiva requested Vishnu to shed light on different topics like Sarga (world), Pratisarga, Vansh (dynasties), Manvantar (fourteenth part of Brahma's day) and Vanshanucharit (genealogy).\n Lord Vishnu replied--' O Rudra! Lord Vasudeva in his incarnation of Nara-Narayan performs his responsibilities of the creator, protector as well as the annihilator.\n Each particle that is found in this universe whether perceptible or imperceptible is nothing but the medium through which the Almighty makes his presence felt.\n In the beginning of the creation, on account of HIS will subtle matter of nature (imperceptible) came into being.\n HE is the one to whom 'Atma' or 'Purush' owe its existence.\n Subsequently, intelligence or 'Buddhi' manifested itself from the subtle matter of nature, mind or 'Mun' from intelligence, space or 'Aakash' from mind, air or 'Vayu' from Space, Fire or 'Teja' from air, water from 'Teja' and finally the earth manifested itself from water.\n' ' O Rudra! Then came into existence an enormous sized egg.\n I dwell within that egg and so do all the other deities.\n In fact, the whole universe is situated within that egg.\n The almighty Vishnu creates in the form of Brahma, nurtures in the form of Vishnu and annihilates in the form of Shiva at the end of each kalpa.\n The creations of the almighty are known as 'Sargas'.\n First of all, the almighty creates the Mahat tatva, which symbolizes his gross quality.\n Since it was his first creation therefore it was called the first Sarga.\n The second Sarga consisted of the creation of the Panch-Tanmatras or the five basic elements- Earth (Prithvi), Water(Jala), Fire(Teja), Air(Vayu) and Sound(Shabda).\n These five basic elements are the stuffs from which matter is made.\n The third Sarga namely Vaikarik sarga comprising the creation of all the sense organs and the organs of the actions, is basically intelligence oriented, because the sense organs can not function without intelligence.\n All these above mentioned three sargas come under the category of Prakrit sarga or natural creation.\n' ' The fourth sarga is known as Mukhya sarga or the main creation and consisted of immovable things like mountains, trees, etc.\n The fifth Sarga is known as Tiryak sarga and consisted of animals and birds.\n The sixth sarga comprised the creation of the deities and other celestial beings and hence it is also known as Deva sarga.\n The seventh sarga comprised the creation of human beings and hence it was called Maanush sarga.\n The eighth sarga, which is also called Anugrah sarga, consisted of creations that are both 'satvik' (pure) and 'tamasik'(dark) in nature.\n The ninth sarga is called Kaumar sarga.\n' ' Lord Brahma commenced his creation of supreme entities by expressing his will resulting into the manifestation of all the ten Manasputras.\n Subsequently, Lord Brahma created different other entities like deities (deva), demons (danav), ancestors (pitra) and human-beings (manushya).\n He then created the Ashuras from his thighs and subsequently abandoned his body.\n The dark qualities emanating from the body resulted into the creation of night, a creation that immensely pleased the demons.\n' ' Lord Brahma then attained a new physical form, which was pure (satvik) in nature.\n He created the deities from his mouth and once again abandoned his body resulting into the creation of day this time.\n All the deities became extremely pleased by this particular creation of Brahma.\n Once again Lord Brahma attained another form and created the 'pitras' and when he abandoned that body, 'sandhya' (evening) manifested from it.\n' 'Lord Brahma then attained a form that was 'Rajomaya' in nature and created human beings.\n His abandoning that particular form resulted into the creation of 'Pratahkaal'(dawn).\n Subsequently, Lord Brahma created the different species like 'yaksha', 'sarpa', 'Gandharva' and 'Apsaras' and many more creatures from the different parts of his body.\n All the four Vedas namely Rigveda, Yajurveda, Samveda and Atharvaveda manifested themselves from each of Brahma's four mouths.\n Similarly, all the four castes such as Brahmin, Kshatriya, Vaishya and Shudra manifested from Brahma's mouth, arms, thighs and feet respectively.' ", "next": "14.1.6", "prev": "14.1.4", "title": "The Beginning of Creation"}