{"index": "14.13.2", "image": "resized_images/Brahm-Gita.png", "text": [" Anybody who studies the sacred texts of 'Brahm-Gita' is certain to attain salvation for it brilliantly propounds the theory of divinity of man by proclaiming that in each individual dwells 'Brahm'-the supreme Almighty.", " Eulogizing the glory of 'Brahm Gita' Lord Vishnu said-' Brahm-Gita declares that in each individual dwells 'Brahm' and one who has understood this fact becomes free from the bondage of the world i.", "e.", " attains salvation.", " Nobody can deny the fact that God exists because the Almighty manifests himself all around us in various forms both perceptible and imperceptible.", " All the five elements (space, air, water, fire and earth) are nothing but the manifestations of Almighty God.", "' ' Unfortunately, most of the people are unaware of the presence of divinity in them- the existence of 'Brahm' in each of them.", " The reason for this is not much difficult to comprehend because this fact is so subtle that only enlightened souls can experience it.", " HE lies dormant and cannot be experienced until and unless HE is awakened by means of austerities and penance.", " 'Brahm' is ever present in a man and does not abandon him in any of the three states of his consciousness- while he is awake, while he is dreaming or even while he is asleep.", " Despite being present in every individual he still remains unaffected by his deeds because by nature HE is eternally pure.", " One more reason why man is unable to feel the presence of 'Brahm' in himself is his own ego, with which he falsely develops deep association.", " So, a person who is desirous of realizing God must first subdue his ego so that 'Brahm' manifests himself in all his glory.", " Without subduing his 'ego' a man can never realize God because the sense of dualism is the greatest impediment in the path of God realization and 'egotism' only strengthen this sense of dualism.", "' 'Once man has successfully subdued his ego, the dawning of God realization becomes imminent because 'Brahm' now has no problem in manifesting himself in the changed scenario.", " 'Brahm' who is absolute truth, eternally pure and the supreme Almighty.", " HE is the eternal bliss dwelling in each individual- the realization which made the Vedas to proclaim 'Tatvam Asi'(Thou is me) and who is beyond the confinement of time and space.", "' Ultimately, Lord Vishnu revealed to sage Narad that 'Brahm' whose glory he had praised was none other than himself. "], "next": "14.14", "prev": "14.13.1", "title": "Brahm-Gita"}