{"index": "14.1.1", "image": "resized_images/Lord Vishnu’s Incarnations.png", "text": [" Sutji once reached Naimisharanya in course of his pilgrimage.", " There he found numerous sages engaged in austerities and penance.", " All of them were delighted to find Sutji in their midst and considered it as a God sent opportunity to get their doubts related with religious topics cleared.", " Sage Shaunak was also present there and he asked Sutji --' O revered sage! Who is the creator of this world?", " Who nurtures it and who annihilates it in the end?", " How can one realize the supreme Almighty?", " How many incarnations the Almighty has taken till now?", " Please enlighten us on all these things, which are shrouded in mystery.", "' Sutji replied--' I am going to reveal to you the contents of Garuda Puran, which contains the divine tales of Lord Vishnu.", " This particular Puran is named after Garuda because he was the one who first narrated these tales to sage Kashyap.", " Kashyap subsequently narrated them to sage Vyas.", " I came to know about these divine tales from sage Vyas.", " Lord Vishnu is the supreme almighty and the source of all creations.", " He is the nurturer of this world and the annihilator as well.", " Though he is beyond the bondage of birth and death yet he takes incarnations to protect the world from the tyranny of sinners.", " His first incarnation was in the form of the eternal adolescent Sanat kumar and others who were all celibates and extremely virtuous.", "' 'Lord Vishnu took his second incarnation in the form of a boar (Varah) to protect the Earth from the mighty demon named Hiranyaksha, who had abducted her to Patal loka (Nether world).", " In his third incarnation as Narad, he propagated the virtues of 'nishkaam karma' (performing one's duties without bothering about the results).", " In his fourth incarnation as Nar-Narayan, he performed arduous austerities for the protection and propagation of Dharma or religiousness.", " Lord Vishnu's fifth incarnation was as Kapil, which he took to protect the Saankhya shashtra, which was on the verge of becoming extinct.", " He took his sixth incarnation in the house of Atri and Anusuya as Dattatreya with the specific objective of propagating the most secret Brahma vidya to worthy people.", " His disciples included virtuous souls like Prahalad and others.", " Lord Vishnu took his seventh incarnation as the son of Ruchi Prajapati and Aakuti and was known as Yagya deva.", " His eighth incarnation was as Rishabh deva- the son of sage Naabhi and Merudevi.", " In this incarnation he established the norms for Grihashtha ashram, which later on became the guidelines for every householders.", " Lord Vishnu took his ninth incarnation as Prithu and 'milked'(extracted) various nutrients (cereals, pulses etc.", ") from the Earth who had disguised herself as a cow and thus protected the populace from getting starved to death.", " In his tenth incarnation as Matsya (fish), he protected the life of Vaivaswat Manu, who would not have survived otherwise.", " Lord Vishnu took his eleventh incarnation in the form of a tortoise (kurma) and held the Mandarachal mountain on his back at the time when the ocean was being churned.", " His twelfth incarnation was as Dhanvantari and thirteenth as the most enchanting beauty- Mohini to retrieve the ambrosia pot from the possession of the demons.", " He subsequently distributed it among the deities as the result of which they became immortal.", " In his fourteenth incarnation, Lord Vishnu manifested himself as 'Nrisimha' (partly human and partly lion) and to protect his devotee- Prahlad killed the wicked demon Hiranyakashipu by tearing apart his abdomen with his sharp claws.", " His fifteenth incarnation was as Vaman (dwarf) in which he demanded all the three worlds from Bali-the most benevolent demon king and then sent him to Patal loka.", " In his sixteenth incarnation as Parshuram, he wiped out the whole caste of kshatriyas from the face of the earth for twenty-one times, as they had all become immoral.", " In his seventeenth incarnation he was born as Vyas to Parashar and Satyavati and accomplished his mission of propagating the knowledge of Vedas by categorizing them into four parts.", " In his eighteenth incarnation he manifested himself as Sri Ram.", " His nineteenth incarnation was as Krishna and his twentieth incarnation as Balram.", " He will take his twenty-first incarnation as Buddha to bring the mankind back to virtuous path by preaching against the rituals and proving that it is not proper for a seeker to get bound by them.", " Lord Vishnu would take incarnation as Kalki and will be born to a Brahmin named Vishnuyasha to liberate the earth from the sinners.' "], "next": "14.1.2", "prev": "14.1", "title": "Lord Vishnu’s Incarnations"}