{"index": "14.14", "image": "resized_images/GARUDA’S QUERIES.png", "text": " This chapter contains 2 sections as follows:\n Sutji once reached the forest of 'Naimisharanya' in course of his journey.\n Naimisharanya was a holy place where sages and hermits went to do penance.\n After reaching there Sutji met many prominent sages who were pleased at his arrival.\n They took it as a God sent opportunity to get their doubts cleared on the mystery called death and what exactly happened after a man died.\n Sage Shaunak, one of those sages, asked Sutji-' O Revered Sage! We were just awaiting your arrival.\n It seems God has listened to our prayer.\n We are confused by so many diverse and contradictory opinions expressed on the mystery of 'death' and what happens after death.\n Some people are of the belief that a man takes rebirth soon after his death whereas there are some who believe that a man after his death first goes to 'Yamloka' to taste the fruits of his 'Karmas' and only then he takes rebirth.\n We request you to clear our doubts and enlighten us on the mystery called death.\n' Sutji recounted the tale of Garuda, who had once posed the same query to Lord Krishna.\n While narrating the tale, Sutji said- 'Garuda-son of Vinta, once decided to get a first hand experience of all the three 'Lokas'(worlds).\n After visiting all the three worlds he returned to 'Vaikunth loka' and narrated his experiences to Lord Krishna.\n Garuda said- ' After visiting all the three 'Lokas' I found the Earth (Prithvi) little overcrowded as compared to other 'Lokas'.\n I also found that it provided better opportunities to a man both for materialistic enjoyments as well as his spiritual advancement.\n So, I have come to the conclusion that 'Prithviloka' was the best of all the 'Lokas' in every respect.\n But, all round prevalence of sorrow and misery in 'Prithviloka' made me sad.\n I was really perplexed to see people performing complex rituals after the death of their relative.\n All these rituals appeared so absurd to me.\n I was really amazed to see people laying down their dead relatives on the ground.\n I could also not understand why a dead body is laid on the bed of 'kusha' grass and sesame seeds.\n I witnessed so many rituals that surprised me, for instance I could not understand the reason why donations are made after a man dies.\n I am puzzled by the mystery called death or, what becomes of him after he dies.\n The sight of sons lifting the dead body of their father on their shoulders is still fresh in my memory.\n I could not understand the reason why 'ghee'(clarified butter) is applied on a dead body or why the relatives of the deceased chant 'Yama sukta' facing north.\n I was also surprised to see the son of the deceased being debarred from having meal along with his other relatives.\n O Lord! Please reveal to me the significance of making 'pinda- daans' or, the significance of 'tarpan' rituals?\n Please tell me the proper method of offering 'pinda daan' and invoking ancestors?\n I find it hard to believe that all the deeds virtuous or evil committed by a man follows him after his death.\n' This way Garuda flooded Lord Krishna with a barrage of questions and sought clarifications on them. ", "next": "14.14.1", "prev": "14.13.2", "title": "GARUDA’S QUERIES"}