{"index": "14.14.2", "image": "resized_images/Death and After.png", "text": [" Continuing with his narration, Lord Krishna said--\" O Garuda! Death comes at the predetermined time, which remains fixed and unaltered under all circumstances.", " A man's sense organs become weak and his body feeble, which gets inflicted with numerous diseases in his old age.", " At the time of his death, man experiences unbearable pain and he begins to loose his consciousness.", " Yamdoots arrive and begin to retrieve the soul from the body and this aggravates the pain.", " Ultimately, the soul, which is not more than the size of a thumb, reluctantly comes out from the body as the attachment with the world exists even after his death.", " But, a virtuous person does not go through all these painful experiences at the time of his death.", " The soul has to take birth in different species as well as go through cycles of countless births, deaths and rebirths in order to taste the fruits of his Karmas.", " Describing the significance of 'Pinda daan' rituals, Lord Vishnu told Garuda that they are performed so that manes are satiated.", " He also revealed to him that six pinda daans are offered to the manes while performing the rituals of last rites-- \" The first 'pinda-daan' is made at the place where person has breathed his last while the second, third, fourth, fifth and sixth 'Pinda daans' are made at the main entrance of the house, the nearest cross-roads, the cremation ground, on the pyre itself and at the time of collecting last remains (Asthi) respectively.", " After reaching the cremation ground the dead body should be laid down with its head towards south.", " The mortal body then should be consigned to flames and after some time sesame seeds and ghee should be poured into the burning pyre so that it continues to burn without any problem.", " For the next ten days the relatives coming from the same gotra of the deceased should observe a period of 'Ashaucha'- a period during which he observes strict austerities and avoids social contacts.", " The son of the deceased is prohibited from having food along with his relatives simply because he is believed to be impure during this period.", "\" This way, being satisfied by Lord Krishna's answers, Garuda thanked him for clearing whatever doubts he had in his mind.", " Lord Krishna blessed him.", " END OF GARUDA PURAN "], "next": "15", "prev": "14.14.1", "title": "Death and After"}