{"index": "14.14.1", "image": "resized_images/Salvation through Rituals.png", "text": " Lord Krishna replied--\" I am so delighted that you have asked such important questions for the benefit of mankind. I am revealing to you the secrets, which were hitherto unknown even to the deities and yogis. O Garuda! A man should try to beget a son with the help of means as mentioned in the scriptures because there is no salvation for a person bereft of son.\" Lord Krishna then went on to describe the proper rituals which are performed after the death of a man and said-\" First of all, the area should be purified by coating it with a layer of cow-dung. This purified area is called 'mandal' and it is graced by the presence of the 'Trinity'-- Brahma, Shiva and Myself. Sesame seeds are then sprinkled on the purified area and kusha grass is spread. A person whose death is imminent is then laid down on the bed of kusha grass. Scriptures say that a person who does not leave his mortal body in the above mentioned way, wanders hither and thither in the form of a restless spirit. No amount of rituals can put such a soul to rest. O Garuda! Sesame seed has manifested from my sweat and hence is extremely pure. All kind of evil forces like, ghosts, spirits, demons, etc. keep away from the place where it is used. Similarly, Kusha grass has manifested from my body hair and is graced by the presence of 'Trinity'-- Brahma, Shiva and Vishnu. Deities are satisfied if kusha grass is offered to them while ancestors are satisfied by the offerings of sesame seeds. Scriptures say that if dying man is laid down on the bed of kusha grass spread on the land purified by cow-dung, he becomes absolved of all his sins. There is a great significance of donating salt after the death of a person. Salt owes its origin to Me and donating it helps ancestors in attaining heaven. Donating salt also helps in reducing the pain and sufferings of a dying man and this is why it is donated along with other articles after a death of a person. The relatives of the deceased should chant the sacred 'Yama sukta' facing north because it helps him to attain liberation.\" Lord Krishna then explained to Garuda the appropriate way of carrying the corpse to the cremation ground--\" The dead body should be carried to the cremation ground by the sons an other relatives of the deceased. In the cremation ground the dead body should be kept in such a way that it's head should be either towards east or north. The pyre should be made either of sandal or 'palash' wood.\" Describing the experiences of the soul when it leaves the body, Lord Krishna said--\" The soul leaves the mortal body with great reluctance because the attachment with the mortal world exists even after his death. Yamdoots, descend down to earth to take the soul of the dying man to Yamloka. Those who have committed grave sins are tied with ropes and taken to Yamloka with great humiliation but virtuous souls are taken with honour and due respect. Yamraj- the lord of death receives the virtuous soul with all the honour and respect and metes out punishment to those who had committed sins during their lives. In his dark complexion and with a buffalo as his mount and with a noose and iron stick in his hands, Yamraj appears terrifying. On the other hand, the sight of lifeless body appears disgusting and people try to dispose it off as quickly as possible because it is worthless without a soul. So, one must try to make the best use of this mortal body by indulging in good deeds before the day of his final journey arrives otherwise he would be left with nothing but regrets at the time of his death. ", "next": "14.14.2", "prev": "14.14", "title": "Salvation through Rituals"}