{"index": "14.10", "image": "resized_images/THE TALE OF MAHABHARAT.png", "text": [" Giving the reasons that lead to the great battle of Mahabharat, Lord Brahma told sage Vyas that Sri Krishna had planned this great battle and executed it to perfection to relieve the earth from the burden of tyrants.", " While giving the names of lineal ascendants of Kauravas and Pandavas, he said-' I (Lord Brahma) manifested from the lotus which itself had its origin in the navel of Vishnu.", " Atri manifested from me while Chandra from Atri.", " Buddh was born to Chandra while he himself was the father of Pururava.", " Aayu was Pururava's son while he himself was the son of Yayati.", " The names of few famous descendants of Yayati were Bharat, Kuru and Shantanu.", " Shantanu had two wives- Ganga and Satyavati.", " The former was the mother of Bhishma, the indomitable warrior, who had vowed to remain a bachelor throughout his life.", " The latter i.", "e.", " Satyavati gave birth to two sons- Chitrangad and Vichitraveerya.", " A Gandharva killed Chitrangad while Vichitraveerya died issue-less despite having two wives- Ambika and Ambalika(both daughters of the king of Kashi).", " In order to expand their clan both Ambika and Ambalika begot one son each from sage Vyas.", " Ambika gave birth to Dhritrashtra while Ambalika to Pandu.", " The same Vyas also had a son from a maid servant who became famous as Vidur and who was famous for his statesmanship and tactfulness.", " Dhritrashtra married Gandhari and begot one hundred sons from her among whom Duryodhan was most notorious.", " These one hundred sons of Dhritrashtra became famous as Kauravas.", " Pandu had two wives Kunti and Madri from whom he begot five sons-Yudhishthir, Bhima, Arjun, Nakul and Sahdev, who all grew up to be very powerful and mighty.", " All five of them became famous as Pandavas.", " Pandu, their father had died while they were still young and Madri, unable to bear the sorrow had given up her life by jumping into the burning pyre of her dead husband.", " So, the Pandavas were brought up under the guardianship of Kunti.", " Kauravas and Pandavas were bitter rivals right from their childhood.", " Duryodhan never missed a chance to torment the Pandavas- his cousins.", " Both Kauravas and Pandavas were brought up under the tutelage of Kripacharya and Dronacharya, both prominent scholars of their times.", " Once, Duryodhan tried to kill Bhima by poisoning him but fortunately Bhima not only came out unscathed but also with renewed strength and vigour.", " Duryodhan tried his luck for the second time to eliminate his enemies by setting ablaze the house of wax in which Pandavas were living but once again they came out unharmed.", " Pandavas then went to 'Ekchakra Nagar' and took refuge in the house of a Brahmin family.", " A demon named 'Baka' used to torment the people of Ekchakra Nagar.", " Bhima killed that demon and the people were relieved at the news of their tormentor's death.", " Thereafter Pandavas went to attend the Swayamvar ceremony of Draupadi.", " Arjun won Draupadi as his wife by piercing the eye of the fish hanged above his head by looking at its image in the water-pot kept below.", " At the insistence of Dronacharya and Bhishma, Yudhishthir reluctantly agreed to share half of his Kingdom with the Pandavas.", " Thus Pandavas started living at Indraprashth, the capital of their newly acquired Kingdom.", " Arjuna married Subhadra, his second wife and the sister of Sri Krishna.", " He pleased Agni Dev by his austere penance and received divine weapons like- a divine chariot, Gandiv (bow), imperishable arrows and an impenetrable shield.", " After being armed with these divine weapons he successfully defeated many powerful monarchies and gave the whole acquired wealth to Yudhishthir, his elder brother.", " Dhrithrashtra invited Yudhishthir for a game of 'Dyuta' (gamble) but Duryodhan defeated him by employing unfair and deceitful tactics with the active connivance of Shakuni- his cunning maternal uncle.", " Yudhishthir lost everything in the gamble- his whole wealth, his kingdom and even Draupadi.", " Pandavas had to go into exile for twelve years with an additional year of 'Agyatwas'(they were not supposed to be recognized during this period) as per the terms and conditions laid down for the game.", " After completing their total period of exile, Pandavas reached Virat Nagar to spend their year of 'Agyatwas', which posed more dangers and challenges because if they were recognized during this period it would have meant another twelve years of exile for them.", " Having successfully completed their period of exile, Pandavas demanded back their Kingdom but Duryodhan was not even willing to part away with five villages.", " Thus Pandavas were left with no option but to fight for their legitimate rights.", " Both the rival armies boasted of mighty and brave warriors on their sides.", " Duryodhan appointed Bhishma as the chief commander of his army whereas Shikhandi was leading Pandava's army.", " The first ten days of the battle saw a fierce fight between both the rival armies during which period many warriors from each side achieved martyrdom.", " Finally, while Bhishma lay down injured, his whole body pierced with Arjuna's arrows, but still alive because he had received a boon of 'Iccha Mrityu'(death by his choice) prominent warriors from both sides stood around him.", " It was only after the Sun came north of equinox (Uttarayan), the auspicious time Bhishma had chosen to leave his mortal body that he died after preaching the Pandavas on wide range of subjects.", " After Bhishma's death Dronacharya led the Kaurava's army.", " This was the most crucial phase of the battle.", " Dronacharya had become so demoralized after his son's death, that he had just no motivation left in him to fight the battle.", " Finding an opportune moment, Dhrishtadyumna severed his head and Kauravas thus lost their most able and experienced commander.", " Duryodhan appointed Karna as the next commander of Kaurava's army.", " The most decisive phase of the battle began and after a fierce battle of two days Arjuna managed to kill his brave rival.", " Subsequently, Yudhishthir killed Shalya.", " After loosing all his mighty warriors, Duryodhana, in a fit of rage challenged Bhima for a duel of mace.", " Bhima killed him after a fierce fight.", " The revengeful Ashwatthama, son of Dronacharya, attacked the Pandava's camp at night, much against the norms of battle and killed all the five sons of Draupadi and thousand of other Pandava soldiers.", " Arjuna avenged the death of his sons by defeating Ashwatthama and extracting the diamond set in his forehead.", " After the battle ended, Yudhishthir performed the rituals of Shraddh in the name of all the dead warriors and ascended the throne.", " He ruled in a just manner just according to the instructions given by Bhishma.", " After Sri Krishna left this mortal world, Yudhishthir appointed Parikshit as his successor and left for Himalaya accompanied by his brothers as well as Draupadi. "], "next": "14.11", "prev": "14.9", "title": "THE TALE OF MAHABHARAT"}