{"index": "14.13.1", "image": "resized_images/Self Realization.png", "text": " Once, on being asked by sage Narad about the means that helped a man in attaining self realization, Lord Vishnu told him that only those privileged few who have understood the impermanent nature of this world and have successfully controlled their sensual desires can attain self realization. All the mysteries of this Universe are unraveled to a man of self-realization and he attains salvation. Lord Vishnu said-' It should be the prime objective of a man to make incessant efforts so that he can experience this divine knowledge of self realization-the real knowledge, for every other kind of knowledge is superficial and of least significance.' Lord Vishnu went on to describe how self-realization could be attained- 'YADASARVE VIMUCHYANTE KAMA YESHYA HRIDI STHITAH; TADAMRIT TWA MAPNOPATI JIVANNEVA NA SANSHAYAH. Meaning- When there is no desire left in the heart then a man is certain to experience the divine taste of this nectar (self realization) in his life time-- and there is no doubt about it. Unraveling the mystery of Universe to sage Narad, Lord Vishnu said-' 'Brahm' is the cause behind this universe and one who has understood this fact can be rightly called a man of self realization. A man being under the influence of his sensual perceptions falsely believes this world to be real and is unable to understand the real cause behind the existence of this world, which is not the case with a man of self-realization. Instead of searching 'without' a man should seek 'within' because within him exists the Universe just like our sense organs perceive them externally. The whole mystery of Universe is unraveled to a man who makes incessant efforts to undertake this inner journey for if his efforts are made with a pure heart and a firm determination then he is sure to reach his goal of self realization one day or the other. The soul (Atma) is 'Brahm' but this fact becomes apparent only to those privileged few, who have attained self- realization. Self realization illuminates the soul in the same way just as a lightning illuminates the dark sky at night.' Lord Vishnu went on to describe himself in the following words-' I am Pure and beyond the limits of human intelligence. I am beyond the confinement of three basic qualities (Satva guna, Rajas guna and Tamas guna). Only he can experience ME who possesses an enlightened soul because I manifest MYSELF in the heart of every individual as a divine effulgence in order to drive away the darkness which engulfs it.' ", "next": "14.13.2", "prev": "14.13", "title": "Self Realization"}