{"index": "14.1.7", "image": "resized_images/The Dhruva Dynasty.png", "text": " Lord Vishnu, continuing with the tales of Garuda Puran told Shiva-' Uttanpad had two wives-Suruchi and Suniti.\n From his former wife he begot a son named Uttam, while Suniti gave birth to Dhruva, who became immortal because of his unflinching devotion in me.\n Dhruva had a mighty son named 'Shlishta'.\n Prachinvarhi was Shlishta's son and Dhruva's grandson.\n Few other prominent personalities coming from the lineage of Dhruva were- Udardhi, Divanjaya, Ripu, Chakshush, Ruru, Anga, Ven etc.\n Ven was an atheist and was eventually killed by sages for his immoral deeds.\n Since Ven had no progeny, his death put a question mark on his successor.\n Sages tried to solve this problem by churning his thighs, which resulted into the emergence of Nishad.\n But, Nishad went to Vindhyachal to do penance.\n Seeing their whole effort go in vain, all the sages once again churned Ven's hands.\n This time Lord Vishnu himself incarnated as Prithu.\n' ' Prithu was an extremely kind hearted king and cared for his subjects.\n Once, when his kingdom was experiencing an acute famine, he successfully extracted the essential nutrients from the earth and thus saved his subjects from starvation.\n Prithu had ten sons prominent among whom were Antardhan, Havirdhan, Prachinvarhi and Praachetas.\n In course of time Praachetas married Marisha.\n' ' Just according to the curse of Shiva, Daksha Prajapati was reborn in the clan of Dhruva.\n His father's name was Praachetas and his mother was Marisha.\n In the beginning, Daksha Prajapati tried to do creation by merely expressing his will but his efforts went futile because of Shiva's curse.\n So, he had no option but to take the help of copulative creation and to meet his objective he married Asikni- the daughter of Viran.\n In course of time he became the father of one thousand sons, all of whom perished while on their impossible mission of finding out the circumference of the earth.\n Actually sage Narad had incited all of them to undertake this impossible mission.\n Daksha though angry did not loose heart and in course of time he once again fathered one thousand sons.\n Once again, Narad was successful in convincing them to emulate the deeds of their elder brothers.\n All of them set out on an impossible mission never to return.\n Now, Daksha's anger crossed all limits and he cursed Narad by saying that he would take birth as a human for inciting his sons' to death.\n This is the reason why Narad was born as Kashyap's son.\n' ' In the years to follow, Daksha Prajapati begot sixty beautiful daughters from Asikni among whom he gave away two daughters in marriage to sage Angira, two to sage Krishashva, ten to Dharma, fourteen to sage Kashyap and twenty- eight daughters to Chandrama.\n The names of Krishashva's wives were Supragya and Jaya while Dharma's wives were Arundhati, Vasu, Yami, Lamba, Bhanumati, Marutvati, Sankalpa, Muhurta, Saadhya and Vishva.\n The names of Kashyap's wives were Aditi, Diti, Danu, Kala, Anayu, Sinhika, Muni, Kadru, Saadhya, Ira, Krodha, Vinta, Surabhi and Khaga.\n' Dharma's wives Vishva and Saadhya gave birth to the Vishvedevas and Saadhyaganas respectively.\n Similarly, Marutvati gave birth to Marutvaans and Vasu to Vasuganas.\n Dharma's wife named Bhanu gave birth to twelve Bhanus while Muhurta gave birth to Muhurtaganas.\n Lamba gave birth to Ghosh while Yami gave birth to Naagvithi.\n Sankalpa gave birth to Sankalpa.\n Kashyap's wife Aditi gave birth to twelve Aadityas while Diti gave birth to two sons (demons)- Hiranyakashipu and Hiranyaksha.\n Diti also had a daughter named Sinhika, who was married to Viprachiti.\n Hiranyakashipu had four sons- Anuhlad, Hlad, Prahlad and Sanhlad.\n Aayushman, Shibi and Bashkal were the sons of Sanhlad.\n Prahlad had a mighty son named Virochan who himself had a son named Bali.\n Bali had one hundred sons in all and Baan was the eldest among them.\n Hiranyaksha had six sons all of whom were very brave and valiant.\n Their names were Utkur, Shakuni, Bhutsantapan, Mahanam, Mahabahu and Kaalnaam.\n Danu had numerous sons who were all very brave-Dwimurdha, Shankar, Ayomukh, Shankushira, Kapil, Shambar, Ekachakra, Mahabahu, Tarak, Mahabal, Swarbhanu, Vrishaparva, Puloma, Mahasur and the mightiest among them-Viprachiti.\n Puloma and Kalka, both daughters of Vaishwanar were married to sage Kashyap.\n Kashyap had sixty thousand sons (demons) from both of them.\n Demons such as Nighat Kavach came from the lineage of Prahlad.\n Tamra had six daughters and their names were Shuki, Shyeni, Masi, Sugrivi, Shuchi and Gridhika.\n Shuki gave birth to numerous species of birds like Shuka (Parrot), Uluka (owls) and Kaak(crows).\n Similarly Shyeni gave birth to Shyen (hawks) and Gridhika to Gridh (vultures).\n Shuchi was the mother of aquatic birds while Sugrivi gave birth to various animals like, horses, camels, donkeys, etc.\n' Arun and Garuda were born to Vinta while Sursa and Kadru gave birth to serpents.\n Krodha gave birth to powerful Pishachas, Surabhi to cows and buffaloes, Era to various vegetation like, creepers and grass, Khaga to Yakshas and Rakshas, Muni to Apsaras and Arishta gave birth to Gandharvas.\n Diti gave birth to fourty- nine Marutganas, all of whom are in fact the incarnations of Lord Vishnu. ", "next": "14.2", "prev": "14.1.6", "title": "The Dhruva Dynasty"}