{"index": "14.4.3", "image": "resized_images/Tale of King Vishal.png", "text": " Lord Brahma then narrated a tale glorifying the significance of performing 'Shraddh rituals' at Gaya- ' O Vyas! Once upon a time there lived a trader who was sonless.\n One day, while he was on his pilgrimage, he met a restless ghost, who requested him to perform the rituals of Pinda daan at Gaya so that not only he became liberated from the pains and tortures of being a spirit but also he (Trader) went to heaven.\n The trader went to Gaya accompanied by his younger brother, as per the request of the Ghost and not only performed the rituals of 'Pinda-daan' for the ghost but also for his own ancestors.\n As a result not only the ghost but all his ancestors became liberated.\n On account of his virtuous deeds, the trader was blessed with a son.\n He enjoyed a long life full of joy and contentment.\n After his death he was reborn as Vishal, in the princely state of Vishala.\n After growing up he got married but even after a long time he did not beget a son and this made him very sad.\n One day he asked the royal priests about the reason he did not beget a son.\n All the priests advised him to offer Pinda daan at Gaya as they felt that by doing so the king would definitely get blessed with a son and they were not wrong, as Vishal indeed was blessed with a son after he had offered Pinda daan at Gaya.\n' One day while Vishal was having a walk in the royal garden he was amazed to see three entities descending down from the sky.\n After all three of them had landed on the ground, Vishal had a close look at them.\n One of them was fair while the second one's complexion was reddish.\n The third and the most ferocious among them was of dark complexion.\n For a moment Vishal was dumbstruck by this mysterious sight but it did not take him long to gather his composure.\n He asked them as to who they were and was stunned by the answers he got.\n Actually, these three entities were none other than the souls of his Father, Grand Father and Great Grand Father, all of whom had died long ago.\n They had come to thank Vishal, who by performing the rituals of Shraddh had helped them in getting liberated from all their sins.\n The entity appearing fair, who in fact was Vishal's father said- Thank you for helping me attain to Indra loka.\n If it were not for you, I would have still been languishing in hell.\n The entity with reddish complexion is your Grand Father, who had committed grave sins while he was alive and as the consequences he went to the most ferocious hell named Avichi after his death.\n Even he has been liberated because of you.\n The third entity among us and having dark complexion is your Great Grand Father.\n He had committed heinous of sins while he was alive but even he has become liberated because of you.\n We have come to express our gratitude and to thank you for having liberated us from our miserable conditions.\n All three of us are now departing for heaven.\n' Having said this all three of them disappeared in a moment.\n Vishal was extremely satisfied that he had been successful in fulfilling one of the major obligations towards his ancestors (pitra-rina) by helping them attain to heaven.\n He enjoyed a long life and after his death he too went to heaven. ", "next": "14.4.4", "prev": "14.4.2", "title": "Tale of King Vishal"}