{"index": "14.4.1", "image": "resized_images/The Significance of Gaya Teertha.png", "text": [" Once, while narrating how Gaya, a prominent place of pilgrimage in eastern part of India got its name, Lord Brahma told sage Vyas-' During ancient times there lived a mighty demon named Gaya.", " He used to torment the deities, who ultimately went to seek the help of Lord Vishnu.", " Lord Vishnu successfully killed Gayasur after a fierce mace-duel.", " The place where Gaya died became famous by his name.", " There is a grand Vishnu temple situated at Gaya where there is a magnificent idol of Lord 'Gadhadhar' (Lord Vishnu holding a mace in his hand).", " Gaya is considered to be the most ideal place of pilgrimage for performing the shraddh rituals.", " It is believed that a person goes to hell if he dies in the following circumstances- if he dies without his consecrations being performed, or if a wild animal kills him, or if he meets an accidental death no matter what the reasons are.", " But, if 'Shraddh rituals' are performed at 'Gaya' then the soul of such a man gets rid of the tortures of the hell and goes to heaven.", " The importance of performing 'Shraddh rituals' over there can be gauged by the fact that a person becomes liberated from 'pitra rina' (debts towards one's father) once he touches the sacrosanct soil of 'Gaya'.", " The reason being that Lord Vishnu himself dwells there in the form of 'Pitra devata' and by having his divine glimpse a man is freed of all his three debts.", " The entire area stretching from the foothills of Vishnu mountain to 'Uttar Manas' is considered extremely holy and this is the same area where river Falgu flows.", " Offering 'Pinda daan' to ancestors at this place helps them to attain salvation.", " While performing the rituals of 'Pinda daan' he should chant the following matra- 'ESHA PINDO MAYA DASTRATAV HASTE JANARDANAH;", " PARLOKAM GATE MOKSHAM KSHAYMU PATISHTHATAAM.", " There are many other places as holy as the banks of Falgu and performance of 'Shraddh rituals' over there give undiminished virtues to the ancestors - Dharma-Prishtha, Brahmasar, Gayashirsha, Akshay-Teerth, Dhenukaranya are few such places capable of liberating twenty generations of a man.", " The entire city of 'Gaya' is considered sacrosanct and performing the rituals of 'Shraddh' or offering Pinda daan to ancestors at any place within 'Gaya' helps the soul of the ancestors to attain to Brahmaloka. "], "next": "14.4.2", "prev": "14.4", "title": "The Significance of Gaya Teertha"}