{"index": "14.4.2", "image": "resized_images/The Rituals of Pindadaan.png", "text": " Before setting out for Gaya to offer Pinda daan, a man should appropriately perform 'Shraddh rituals' in the village or town he lives. Each step taken towards Gaya acts as a stepping stone to the heaven for the ancestors. Getting one's head tonsured or observing fast is prohibited in some places of pilgrimage like Badrinath, Kurukshetra, Jagannathpuri and Gaya. There is no time restriction on the performance of Shraddh rituals at Gaya and they can be performed anytime. After reaching Gaya, a man should first of all invoke his ancestors while taking bath in the holy Falgu and offer pinda daan to them. He should then visit the temple of Lord Gadadhar(Vishnu) and worship the deity. The next day, he should once again perform the Shraddh rituals at Dharmaranya and Matangwapi, two sacrosanct places having great religious significance. On the third day, he should perform the rituals of 'Tarpan' on the banks of 'Brahmasada teerth' and then go to 'Koop-teerth' and 'Yoop-teerth' to repeat the performance of Shraddh rituals. He should then feed the Brahmins at 'Goprachar teerth', an act considered to help ancestors attain salvation. On the fourth day he should take a holy dip in river Falgu and once again perform 'Shraddh rituals' at a place called 'Gayashirsh'. There are many more holy places in the vicinity where he is required to perform Shraddh rituals'- Vyas, Dehimukh, Panchagni, Surya- teerth, Som-teerth and Kartikeya-teerth are few of them. Finally, on the fifth day, he should take a holy dip in 'Gada-lolak' teerth and offer 'Pinda-daan' under the Banyan tree called 'Akshay vat'- an act believed to liberate all his predecessors as well as coming generations from the bondage of Earth. After that Brahmins are fed. Feeding one Brahmin at Gaya brings the same virtues what one would get by feeding one crore Brahmins elsewhere.' ", "next": "14.4.3", "prev": "14.4.1", "title": "The Rituals of Pindadaan"}