{"index": "14.5.1", "image": "resized_images/Upanayana Sanskara.png", "text": " Dwelling on length about the appropriate way of performing 'Upanayan sanskar' (Sacred thread ceremony) rituals, Lord Vishnu said-' A Brahmin child should get consecrated with the sacred thread in his eighth year while a Kshatriya child's consecration should be performed when he has attained the age of eleven. 'Upanayan sanskar' of a Vaishya child should be performed in his twelfth year.' A dwija, whose 'Upanayan sanskar' has been performed, must face southwards while relieving himself in the night whereas during daytime he should face northward. Subsequently, he should purify himself by properly washing his urinary organ with mud (soap) and water. He should also wash his hands and feet. The purification is believed to be incomplete until and unless the rituals of 'Aachman' (ritualistic rinsing of the mouth) have been performed. Next morning, after having a bath, he should do 'Pranayam' and chant the sacred Gayatri mantra facing east. In the evening he should chant Gayatri mantra facing south. After this the ritual of 'Bhikshatan' is performed whereby he seeks alms and donates everything that he gets to his Guru as a mark of respect to him. This particular ritual is symbolic and emphasizes the absolute necessity of subduing one's ego before acquiring knowledge from his Guru. A celibate is supposed to wear nothing but a Deer skin and a waist band made of long reeds on his person with a sacred thread hanging across his shoulder and carry a stick in his hand. The celibate whose Upanayan sanskar has been performed should stay at his Guru's hermitage till he completes his education. It is also his duty to collect food grains from the neighbourhood to meet the food requirement of all the people living in the hermitage. A Brahmin celibate should chant 'Bhavati bhiksham dehi' while seeking alms whereas a Kshatriya celibate should chant the same mantra with a slight modification ' Bhiksham bhavati dehi'. Similarly, a Vaishya celibate should chant 'Bhiksham dehi bhavati' while seeking alms.' ", "next": "14.5.2", "prev": "14.5", "title": "Upanayana Sanskara"}