{"index": "14.5", "image": "resized_images/DESCRIPTION OF VARIOUS CONSECRATIONS.png", "text": " This chapter contains 6 sections as follows:\n While describing the significance of various consecrations, Lord Vishnu told Shiva that the union of man's sperm and woman's ovum results into the birth of a child.\n This union along with the whole process of foetus getting transformed into a baby is a lengthy affair during which it imbibes numerous impurities.\n Consecrations purify a man from all these impurities.\n Lord Vishnu said -' The mankind has been categorized into four prominent castes- Brahmin, Kshatriya, Vaishya and Shudra.\n The former three castes are also known as 'Dwijas' (Twice born.\n The solemnization of a consecration named Yagyopavit is believed to be their second birth.\n) because only they are entitled to get consecrated into this particular ceremony.\n Right from his birth till he takes his last breath, a 'Dwija' has to undergo various consecrations.\n' Giving the names of some prominent consecration ceremonies that a Dwija has to go through, Lord Vishnu said- ' Garbhadhan Sanskar is performed at the time of conception.\n The scriptures have clearly stated about the best time for a woman to conceive- twelve days after her menstruation has started, beginning from the fifth day as the first four days are not considered auspicious for this purpose.\n 'Punsavan sanskar' is performed in the third month after conception while 'Seemantonayan sanskar' is performed in the sixth or eighth month after conception.\n After the birth of a child the consecration named 'Jaat karma' is performed while 'Naam karan sanskar' is performed on the eleventh day after his birth whereby the new born baby is given a name.\n 'Nishkraman sanskar' is performed in the fourth month and 'Annaprashan sanskar' in the sixth month.\n The consecration named 'Chudamani sanskar' can be performed either in the first, third or fifth year of the child.' ", "next": "14.5.1", "prev": "14.4.5", "title": "DESCRIPTION OF VARIOUS CONSECRATIONS"}