{"index": "14.6", "image": "resized_images/KARMA AND ITS CONSEQUENCES – KARMA VIPAK.png", "text": [" This chapter contains 1 section as follows:", " Continuing with his discourses, sage Yagvalkya told the assembled sages that an enlightened soul is aware of the fact that the mortal world being impermanent in nature has its beginning as well as its end.", " He is also aware that a man reaps the fruits of his evil deeds in the form of 'Adhidaivik'(heavenly wrath), 'Adhyatmik'(obstacles in spiritual development) and 'Adhibhautik' (worldly problems like diseases, poverty, etc.", ") That is why he endeavours to follow the path of virtuosity so that he can attain salvation-the ultimate objective of man's life.", " Anybody engaged in sinful deeds is definite to go to hell whereas virtuous deeds help a man to attain to heaven.", " After tasting the fruits of his actions he once again has to take birth to realize the unfulfilled wishes of his previous birth.", " This cycle of transmigration is an endless process, leading to countless births and deaths of a man.", " He experiences unbearable pains in his mother's wombs lying in an inverted position for nine months.", " Once again he has to go through the same dreadful experiences of youth, old age, diseases and death.", " A sinner, after tasting the fruits of his actions in the heaven or hell, depending on his virtuous or sinful deeds takes re-birth on the basis of the gravity of sins committed.", " Killing a Brahmin is believed to be the most heinous of sin and the person who has committed such a sin after having suffered the tortures of hell takes re-birth as a donkey or a dog.", " In the same way a person who has stolen gold takes re-birth as lowly creatures such as worms or insects.", " A drunkard takes re-birth as a frog and a person developing illicit relationship with his teacher's wife takes re-birth as grass or hay.", " One who shows disrespect to his parents is reborn as a tortoise whereas anybody who wishes ill of his friends is reborn as a donkey. "], "next": "14.6.1", "prev": "14.5.6", "title": "KARMA AND ITS CONSEQUENCES – KARMA VIPAK"}