{"index": "14.7.15", "image": "resized_images/The Power of Chastity.png", "text": [" Once, sage Vyas went to Brahmaloka to get his doubts cleared on certain spiritual matters from Lord Brahma.", " While dwelling on a wide range of religious topics such as importance of austerities and various incarnations Lord Vishnu took to protect righteousness, Lord Brahma narrated a tale of a Brahmin woman who possessed divine powers on account of her chastity.", " Lord Brahma said- ' During ancient times there lived a Brahmin named Kaushik in Pratishthanpur Nagar.", " He was inflicted with leprosy but still his wife was very chaste and faithful towards him.", " His wife used to be on her toes attending to all his demands and looking after all his requirements.", " But still, he used to scold and abuse his wife at the first given opportunity without any rhyme or reason.", " However, his wife did not mind his behaviour understanding quite well the frustrations of a man suffering from dreaded disease like Leprosy.", "' One day, something happened which made Kaushik extremely angry and in a fit of rage he made an impossible demand thinking that his wife would never comply by it giving him an opportunity to curse her to the satisfaction of his heart.", " Shouting angrily at his wife, Kaushik said- Age has started showing effect on you.", " You don't look beautiful as before.", " You have also started neglecting me.", " Take me to a beautiful prostitute so that I can satisfy my sexual urge.", " Kaushik's wife was deeply hurt by his rude and unfair remarks but she remained cool and calm.", " Being a chaste and faithful wife she had no option but to obey her husband's command.", " So, she left for a prostitute's house carrying Kaushik on her shoulders.", " The prostitute's house was far and it became dark while they were still on the way.", " Because of darkness, Kaushik's wife could not see sage Mandavya, who in spite of his innocence was given a severe punishment by the king- he had been made to sit on a pointed cone which after having penetrated through his body had pierced even his skull.", " But, being a great sage, Mandavya was engrossed in his meditation even in such a painful physical condition.", " Unfortunately, Kaushik's feet, which were hanging down the shoulders of his wife, touched Mandavya's body.", " Mandavya's meditation was disturbed and he came out from his meditative level.", " As a result he became conscious of his unbearable physical pain and cursed that whoever had disturbed his meditation would not live to see the next day.", "' Kaushik died the next day but his wife, who had full confidence in her power of chastity, knew that her husband would be alive once again.", " She cursed angrily - ' Mandavya has a misconception about his power.", " He thinks that only he can control the natural phenomena but perhaps he does not know what feats a chaste woman is capable of performing.", " Its my command to the Sun not to rise from tomorrow onwards.", "' And indeed, the Sun stopped rising from the next morning leading to catastrophic fallout.", " Everything went haywire in the world, which made the deities extremely worried.", " They came to me (Lord Brahma) with a request to reveal why Sun had stopped rising.", " I told them that it was all due to the curse of a chaste woman and then I narrated the whole story.", " I revealed to them that nobody except Sati Anusuya was capable of bringing back order in the world.", " I advised them to seek the help of Sati Anusuya who was famous for her exceptional chastity.", " So, all the deities went to Sati Anusuya and requested her to make the Sun rise so that everything became orderly in the world once again.", " Sati Anusuya agreed to lend her help in bringing back normalcy in the world.", " She, by the virtue of her chastity not only made the Sun rise daily but also made dead Kaushik alive once again.", " Such is the power commanded by a woman practicing the austerity of chastity.", " There are numerous examples of such women famous for their chastity and Sita was one of them. "], "next": "14.8", "prev": "14.7.14", "title": "The Power of Chastity"}