{"index": "14.8", "image": "resized_images/THE TALE OF RAMAYANA.png", "text": " Lord Brahma then went on to describe the famous tale of Ramayana the mere listening to which absolves a man from all his sins. He began by giving the details of Sri Ram's lineage and said-' I (Lord Brahma) manifested from the Lotus originating from the navel of Lord Vishnu. Sage Marich manifested from me while Kashyap was Marich's son. Surya manifested from Kashyap, Vaivaswat-Manu from Surya and Ikshavaku was born to Vaivaswat-Manu. The great King Raghu was also the descendant of Ikshavaku. Raghu's son was Aja, whose son was Dasharath. Dasharath had three queens-Kaushalya, Kaikeyi and Sumitra. Kaushalya gave birth to Sri Ram while Kaikeyi was the mother of Bharat. Sumitra had two sons- Laxman and Shatrughan. Sri Ram had great devotion towards his parents. Sage Vishwamitra, who was tormented by the demons, took Sri Ram and Laxman along with him so that he could do his penance peacefully. He assured Dashrath that he would make both his sons proficient in all the scriptures as well as in the usage of various weapons. With great reluctance, Dasharath allowed Sri Ram and Laxman to go along with Vishwamitra. Once in the forest Sri Ram assured his Guru to do his penance without bothering about the demons. Vishwamitra commenced his penance and Sri Ram killed all the demons trying to disturb him. The names of few demons killed by Sri Ram were Tadaka, Subahu, etc. Janak, the father of Sita had organized a grand 'Swayamvar' ceremony to which he had invited all the prominent kings of that time. He had also sent invitation to Vishwamitra. Vishwamitra set out for Janakpur accompanied by Sri Ram and Laxman. Janak had a huge bow gifted to him by Lord Shiva and which he worshipped daily with appropriate ritual. Once during the process of cleaning the area where Shiva's bow was kept, Sita lifted the bow and kept it a distance. Later on she forgot to keep it back at the original place. When Janak came to worship the bow he was surprised to find it to be kept at a different place. He made an inquiry and Sita confessed that she had kept it while cleaning the place of worship. Janak just could not believe that his tender looking daughter possessed such strength and power. No wonder he decided to give Sita's hand in marriage to such a man who could break Shiva's bow. So, he made a declaration that anybody capable of breaking Shiva's bow could have Sita as his wife. There were many mighty warriors present at the 'Swayamvar' ceremony but none had the strength to even lift the bow what to say about breaking it. Finally, as the destiny would have liked it, Sri Ram broke the bow into three pieces and thus married Sita. Laxman married Urmila- another daughter of Dasharath while Bharat and Shatrughan married Mandavi and Keertimayi respectively, both daughters of King Kushadhwaja. Later on, when Dasharath decided to crown Sri Ram as the King of Ayodhya, Kaikeyi played a spoilsport and demanded her son-Bharat to be made the King of Ayodhya and Sri Ram to be sent into exile for fourteen years. Actually, Kaikeyi had taken undue advantage of Dasharath's helpless condition to serve her own interest. Once, Dasharath was busy fighting a battle oblivious of the fact that one of the wheels of the chariot was about to eject from its axle as the nail supporting it had fallen off. Kaikeyi, who was also accompanying him, saved his life by preventing the wheel from falling off and thus maintaining the balance of the chariot. When Dasharath learnt how Kaikeyi had saved his life he promised to grant her two boons. At that time Kaikeyi did not ask for any thing and merely said that she would demand at the appropriate time. So, when the time for Ram's coronation came she thought it was the best opportunity for her to remind Dasharath about the two boons he had promised to grant her. Dasharath, bound by his deep love for Sri Ram on the one hand and by his vow on the other, agreed to Kaikeyi's demand with a heavy heart. Sri Ram without any hesitation followed his father's order and left for the forest. How could have Sita and Laxman lived without him? So, they too accompanied him to the forest. In course of his journey, Sri Ram passed by many holy places and finally after reaching Chitrakoot he made a 'Parna kuti' (hermitage made of leaves) and started living there. The shock caused by Sri Ram's separation proved to be fatal for Dasharath, who died with an unfulfilled desire of having a glimpse of his dearest son. Bharat, who at that time was at his maternal uncle's place, returned to Ayodhya after hearing the news of his father's demise and performed his last rites. He then went to Chitrakoot and tried his level best to convince Sri Ram into returning back to Ayodhya. But, Sri Ram did not agree, as it was against his principle to disobey the commands of his father. Sri Ram gave his pair of wooden sandals to Bharat as a token of love and requested him to return to Ayodhya. Bharat returned to Ayodhya and kept Sri Ram's sandals on the throne. He then stationed himself at Nandigram- a city situated at the outskirts of Ayodhya and started ruling from there on behalf of his elder brother. He had vowed not to return to Ayodhya till the completion of Sri Ram's period of exile. From Chitrakoot, Sri Ram reached Dandakaranya accompanied by Sita and Laxman and started living in a hermitage made of leaves. There they also met prominent sages like Atri and Agastya. Once an ogress named 'Surpanakha' (Ravan's sister) attacked Sri Ram but Laxman retaliated by severing both her ears as well as her nose. Surpanakha, badly injured and bleeding profusely, went to Khardushan and narrated her woeful tale. Khardushan attacked Sri Ram with a huge army consisting of fourteen thousand soldiers but lost all his men in the battle. The revengeful Ravan went to the hermitage disguised as a hermit and abducted Sita while Sri Ram was away in pursuit of Marich-the golden deer. Actually, Marich was a demon, who had disguised himself as a golden deer on the instruction of Ravan so that Sita could be abducted successfully. Ravan knew quite well that it was impossible for him to abduct Sita in the presence of Sri Ram. So, he hatched a plan according to which Marich was to disguise himself as a golden deer and enchant Sita. Ravan was sure that Sita after being enchanted by the beauty of the golden Deer would ask her husband to get it at any cost. Everything happened as per the plan of Ravan and he was successful in abducting Sita. When Sri Ram did not find Sita in the hermitage he became worried and started searching for her frantically. On the way he met old Jatayu, who had got injured while trying to resist Ravan from taking away Sita. Jatayu informed him that Ravan had taken Sita towards south. Jatayu was so badly injured that he died soon after giving Sita's information to Sri Ram. Sri Ram performed his last rites and continued with his search. He proceeded towards south as per the instructions of Jatayu and reached 'Rishyamook' mountain where he met Sugreeva, whom he befriended. He killed Bali, who harboured enemity against his brother- Sugreeva. He then made Sugreeva the King of 'Kishkindha' and himself went to live at 'Rishyamook' mountain. Sugreeva sent monkeys in all directions to find out Sita's whereabouts. Hanuman went towards south and with the help of Sampati managed to find out the exact location where Ravan had kept Sita. Hanuman took a giant leap and the next moment he found himself on the other side of the ocean. He went to 'Ashok- Vatika' where Ravan had kept Sita in captivity. He presented the ring to her, which Sri Ram had given him. Sita, in turn gave her 'Chudamani'(ornament) and requested him to give it to Sri Ram. Jumping from one branch to another, hungry Hanuman ate all the fruits and in the process destroyed the beautiful garden. When Ravan came to know about the destruction caused in the beautiful garden of 'Ashok Vatika', he sent many demons to capture Hanuman. But, all of them were killed including Akshay Kumar, Ravan's son. Ultimately, Hanuman was made captive by Meghanad and produced before Ravan, who ordered his tail to be set ablaze as a punishment. Hanuman, with his tail ablaze, jumped from one palace to another and burnt the golden city of Lanka within no time. He then returned to his master Sri Ram and described everything in detail. Finally, Sri Ram attacked Lanka with a huge army comprising of mighty warriors like Hanuman, Sugreeva, Angad and many others. A fierce battle took place in which all the demons including Ravan were killed. The victorious Sri Ram returned to Ayodhya along with his consort Sita. The residents of Ayodhya danced in joy at the return of their prodigious son. Sri Ram ruled over Ayodhya for eleven thousand years. Finally he ascended to the heaven taking along all the people of Ayodhya with him but before doing that he appointed Lav and Kush-his Sons, as his successors. ", "next": "14.9", "prev": "14.7.15", "title": "THE TALE OF RAMAYANA"}