{"index": "14.9", "image": "resized_images/SRI KRSHNA.png", "text": [" Making a revelation to Vyas that the Almighty God manifests himself whenever the civilization is endangered by the dominance of sinners, Lord Brahma said- 'In Dwapar yuga, Lord Vishnu incarnated as Sri Krishna to protect Dharma from being subjugated by 'Adharma', which had become all pervasive at that time.", " He was born to Vasudev and Devaki.", " Both his parents had been kept under captivity by Kansa, who was aware of the prophesy that he would be killed by Devaki's eighth son.", " In due course of time Devaki gave birth to seven sons all of whom were mercilessly killed by Kansa one by one.", " In order to protect the life of Sri Krishna- the eighth child born to Devaki, Vasudev exchanged him with the baby girl born to Yashoda and Nand.", " Vasudev had no problem in moving out of the prison as Krishna by his divine power induced all the guards to sleep.", " Sri Krishna, being an incarnation of Lord Vishnu performed great feats right from his childhood.", " Once, Kansa sent an ogress named Putna, who tried to kill Sri Krishna by breast-feeding him.", " But, Krishna sucked her breasts with such ferocity that Putna met an instant death.", " In due course of time Sri Krishna killed many more ferocious demons like Shakatasur, Kaliya Nag, Dhenukasur and mesmerized the residents of Gokul by his divine bravery.", " He also performed many other divine feats like lifting Govardhan mountain and performing Raas- Lila with the Gopis.", " Seeing all his plans of killing Sri Krishna go in vain, Kansa sent him a message challenging for a 'duel- bought' with his court-wrestlers named 'Mushtik' and 'Chanur'.", " Sri Krishna killed both the dreaded demons without much difficulty.", " Ultimately, Sri Krishna climbed up the throne sitting on which Ravan had been watching the wrestling bout and pulled him down by his hair.", " He then punched Kansa on his chest so hard that he died an instantaneous death.", " Having accomplished his most important mission of killing the demon king- Kansa and liberating the earth from his tyranny, Sri Krishna went on to complete his education under the tutelage of Sage Sandipani.", " During ancient times it was customary for a disciple to offer Dakshina to his teacher, as a mark of respect after his education was complete.", " Sri Krishna following this tradition gave an invaluable Dakshina to his Guru by bringing all his dead sons alive to earth from 'Yamloka'.", " Sri Krishna was subsequently crowned as the king of Mathura but on account of the relentless attack by Jarasandha he had to abandon his dear city and shift his base to Dwarka.", " He had eight queens among whom Rukmini and Satyabhama were prominent.", " Later on he rescued sixteen thousand and one hundred women from the captivity of Narakasur and married all of them.", " From Rukmini he had a son named Pradyumna, who killed Shambarasur.", " Aniruddha was Pradyumna's son and he married Usha- daughter of Banasur.", " Banasur was a great devotee of Lord Shiva and was blessed with one thousand hands.", " Lord Shiva came to his rescue at the time when he was battling against the might of Sri Krishna.", " A fierce battle was fought between both the deities, which remained inconclusive even after a long time.", " Lord Shiva then requested Sri Krishna to spare Banasur's life to which he agreed albeit partially.", " Sri Krishna severed all the hands of Banasur barring two.", " Finally, after accomplishing his mission of liberating the earth from the darkness of sin Sri Krishna left for heavenly abode. "], "next": "14.10", "prev": "14.8", "title": "SRI KRSHNA"}