{"index": "15", "image": "resized_images/BRAHMANANDA PURANA.png", "text": " It is the eighteenth Purana.\n Presently available in separate pieces, Adhyatma Ramayana is also included in this Purana, but the present versions of Brahmand Purana do not contain Adhyatma Ramayan.\n It has four parts- Prakriya, Anushanga, Upotaghat and Upasamhar.\n This Purana is said to be narrated by Sutaji on the bank of the river Drishdvati in Yaksh kshetra (identified with Sutlej in modern Himachal Pradesh).\n From his narration, it is clear that Sutaji had heard the Purana from Veda Vyasa who, in his turn, received it from Vayudev.\n Creation of the universe, determination of Kalpa, differentiation of Yugas, description of Manvantaras, description of Jambudweep and Bharatvarsh, description of Kimpurush.\n Anudweep, Ketumaal varsh etc.\n and description of Bharat vansha, Prithu vansha, Dev vansh, Rishi vansh, Agni vansh and preceptors are the main topics of Brahmand Purana.\n Described in the Purana, Adhyatma Ramayana has seven parts.\n First part describes the Brahmaswarup (cosmic appearance) of Shri Rama.\n Incarnation of Lord Rama to relieve the earth from the atrocities of the demons.\n Baal-leela (childhood plays).\n Emancipation of Ahilya.\n Removal of Bhargava?\ns (Parashuram?\ns) ego.\n Second part contains:\n Lord Rama?\ns going into exile.\n Demise of Dashrath.\n Aranyakand describes killing of the illusionary deer and abduction of Sita.\n Kishkindha khand describes the killing of Baali.\n Search of Sita.\n Sundar Khand has the tales of Hanuman?\ns entry into Lanka.\n Lanka khand contains the description of killing of Ravana and coronation of Lord Rama upon his return to Ayodhya.\n In Uttar Khand reasons for Ravana?\ns birth have been described.\n It also contains the description of Sita?\ns desertion by Rama.\n Desertion of Lakshmana.\n Coronation of Luv and Kush and departure of Rama to his original Vaikunth loka.\n This Purana consists of xx chapters: ", "next": "15.1", "prev": "14.14.2", "title": "BRAHMANANDA PURANA"}