{"index": "16.11.3", "image": "resized_images/Lord’s Departure to his Abode.png", "text": " To remind the Lord about the moment of His departure, Brahma arrived in Dwaraka accompanied by all the gods. He prayed to Him: \"O Lord, you have completed your duty of what we had once requested you. Now, You please return to your abode. Lord said: \"On the seventh day from now, Dwaraka shall submerge in the sea and Yadavas shall fight among themselves to death. I too shall depart then. The arrow of a hunter shall be the cause of my departure.\" When Uddhav learned that Lord was about to wind up His plays, he approached Him and said: \"I understand, O Lord, that this all is happening by your wish. But I cannot part for a moment from your feet. Hence, take me also with you to your abode.\" Lord said: \"Uddhav, I will not go anywhere. My entire brilliance will be present in Shrimad Bhagwad. You stay here preaching Bhagwad dharma.\" Saying thus, lord preached Uddhav about the Geeta Gyana through the tale of Avadhoot. Lord narrated thus: \"Uddhav, Once, our ancestor Yadu happened to see Lord Dattatreya in a forest. Lord was indulged in the supreme joy in the guise of Avadhoot. Yadu asked him about the reasons for his whimsical state.\" Avadhoot had said: \"O king, making the various animals, birds, insects etc as my teacher, I have learned about spirituality from them. That is why I am free from mourning and attachment. Earth, air, sky, water, fire, the moon the sun, pigeon, python, sea, grasshopper, bumblebee, honey bee, elephant, extractor of honey, deer, fish, prostitute, osprey, boy, girls, arrow-maker, snake, spider and wasp are all my teachers. I took refuge at these twenty-four teachers and learned from their behaviour. I learned forgiveness from earth, purity from the sky, holiness and cleanliness from the water, innocence and renunciation from the fire; indifferentness from the air, to remain unaffected by circumstances from moon, abdication from the Sun, incoherence from the pigeon, dependence upon fate and remain effortless from the python, to remain always happy and serious from the sea, to be under the control of sense organs and hence meet total destruction from the grasshopper, acquiring of virtues from bumblebee, fault in cumulating from honey bee, to abstain sensuous talks from the Deer, to eliminate greed from the fish, sorrow in hope and happiness in desperation from the prostitute, to feel happy in uncertainty from osprey, dispute among many from the girls, concentration from the arrow-maker, to roam alone and detachment from a particular place from the snake, virtues of the creator Lord from the spider, and I learned similarity from the wasp.\" In the guise of Avadhoot, Lord Dattatreya says: \"O king, I learned wisdom and apathy from my body also, because life, death, life and death again are inseparably intertwined with it. Hence the net result of loving this body is nothing but sorrow. Thus our own body also helps us to learn about metaphysical knowledge. Lord Krishna also explained Uddhav regarding futility of physical and heavenly luxuries. This human body is like a tree, on which two birds - Jeevatma and Paramatma (microcosm and supreme soul) - have taken shelter. Two fruits - happiness and sorrow - appear on it. These fruits are eaten by Jeevatma (micrososm) while Paramatma (supreme soul) stays as an indifferent onlooker. There are three kinds of Jeev - Baddh (Bound), Bhakt (devotee) and Mukt(liberated). Baddh Jeevas (bound souls) are those who indulge in sensual pleasures and those who dislike pious company. Mukt Jeev (liberated souls) are those who are free from attachment and bindings. Bhakt (devotees) are those who meditate on me and dedicate their everything in my feet and have love for my virtues. My devotee is kind, free from flaws, tolerant, has feeling of fraternity for all and controls his desires. ", "next": "16.11.4", "prev": "16.11.2", "title": "Lord’s Departure to his Abode"}