{"index": "16.11.1", "image": "resized_images/Curse of Sages to Yaduvanshis.png", "text": [" Shukdev said:", " \"O Parikshit, as the time passed, Yaduvanshis grew stronger and more influencial.", " Now no longer did they like the welcoming and treating of the great sages like Kanu, Dhrvasa, Maitreya, Dhannmy etc.", " by the Lord.", " Lord Krishna knew about their disliking, but secretly He was pleased by this change in Yaduvanshi's behaviour, for He knew that by disregarding the saints and the scriptures, they would meet their end sooner.", " Once the Yaduvanshis clothed Jambvati's son Samb in a woman's attire and, showing him to the sages asked mockingly:", " \"Maharaj, this is our sister-in-law.", " She is an expecting mother.", " She feels shy to ask but tell us what will be born to her?", " Through their unfailing vision, the Sages knew the reality and said:", " \"Fools, a pestle shall be born to her and that pestle shall exterminate the entire Yaduvansh.", " Now all the Yaduvanshis were perplexed by sages' prediction, and approached their king Ugrasen.", " But, even the king was helpless now because he could not change the words the pious sages.", " In due course , a pestle was born to Samb.", " Frightened of an imminent fate, Yaduvanshis crushed the pestle into a fine powder and threw it into the sea.", " Only a nail remained, that also was thrown into the sea where a fish swallowed it.", " A fisher caught the fish and cut it open and found the nail.", " He gave it to a hunter.", " The hunter fixed the nail in the head of his arrow.", " On the other hand, the sea waves washed the powder of the pestle ashore where it germinated and grew as luxuriant grasses.", " Later on, once all the Yaduvanshis assembled at the sea-shore for a picnic where they drank wine and began to fight with one another under intoxication.", " Soon their quarrel grew so high that they pulled out the grasses, which were growing there, to use as the arms.", " With the grasses the Yaduvanshis beat one another to death. "], "next": "16.11.2", "prev": "16.11", "title": "Curse of Sages to Yaduvanshis"}