{"index": "16.10.15", "image": "resized_images/Attachment of Brahmaji.png", "text": " Shukdev says:\n Parikshit, the cowherds told the tale of Aghasur's salvation to their parents only after a year of the incidence.\n During that period of one year, Lord Krishna multiplied himself and took the guise of his fellow cowherd and their stock of cattles to remove the Illusion of Brahma,who was the cause of the following incidence.\n After Aghasur's life mingled with God, Lord Krishna came with this fellow cowherd on the bank of Yamuna.\n They left their cattles to graze freely and they sat together to take their lunch.\n All of the cowherds tasted one-another's food, as they wanted to feed Krishna with the tasty food.\n Meanwhile surprised by Aghasur's salvation, Brahma too had arrived their and saw Krishna eating food defiled by the cowherds.\n With that sight, Brahma grew suspicious if Krishna was indeed an incarnation of lord.\n Thus driven by the illusion and to test the authenticity of lord's incarnation, Brahma kidnapped all the cattles first and when Krishna went out to search the cattles Brahma kidnapped and concealed the cowherds also.\n Soon lord Krishna understood the craftiness of Brahma, so he multiplicated himself into his fellow cowherds and cattles.\n Replicas resembled truly to the cowherds in appearance, complexion, nature, activities, voice, sticks and even in costumes.\n The replicas remain in existence for complete one year.\n Back there, when Brahma returned after hiding the cowherds and the cattles, he was stunned to see the cowherds and cattles as usual.\n Brahma was feeling dizzy when lord bestowed his grace on him.\n Brahma saw Narayana in every dust particle.\n Brahma therefore bowed his head at the feet of lord and said:\n \"O lord, I submit before you.\n You can be won only with devotion and not by ego.\n No one can know your omnipresent appearance.\n Thus praying and worshipping lord Narayana, Brahma returned to his abode.\n Shukdev says:\n The cowherds remained separated from God for one year.\n But they felt as if only half a second had passed because of the illusionary influence of God.\n That is why they related the incidence of Aghasurs killing to their parents only after a year it took place. ", "next": "16.10.16", "prev": "16.10.14", "title": "Attachment of Brahmaji"}