{"index": "16.10.9", "image": "resized_images/Childhood of Lord Krshna.png", "text": [" Shukdev says:", " \"O Parikshit, time passed in Gokul as usual.", " Balrama and Krishna too grew normally.", " Soon they began to walk on knees and palms.", " With their childish plays they both amused men and women folk of Gokul.", " Everyone took special care of them and looked after them to save them from any possible danger.", " Ladiesfolk were specially careful about them.", " Soon afterwards, both the kids began to walk trottingly.", " Now their movement no longer confined within the boundary of their home.", " Because of his special virtues, Krishna began to lead other kids of his age group whereas his elder brother Balarama was somewhat serious in nature.", " Krishna specially enjoyed teasing the girls and milkmaids of Gokul.", " Often he would eat stealing their milk, curd and butter.", " At other times, He did not hesitate even to break their pitchers.", " In such situations the ladiesfolk used to gather in Nand's home to complain against Krishna.", " And every time Yashoda promised them to punish Krishna.", " But every time, when she proceeded to punish him, she forgot everything before his sweet, innocent smile.", " One day, Balarama complained against Krishna, \"Ma, the little Kanhaiya has eaten mud.", " Worried about Krishna's health, Yashoda scolded at him:", " \"Tell me, O mischievous Krishna, why did you eat mud\".", " At that moment, little Krishna's eyes were moving with fear.", " He made an excuse:", " \"No Ma, I have not eaten any mud.", " They are telling yoou a lie.", " If you don't believe, me see yourself.", "\" Saying this, Krishna opened his little mouth.", " Yashoda peeped into his mouth and what she saw there amazed her.", " She could not believe it.", " The entire universe was visible in his little mouth.", " Yashoda saw strange places, entire Vraj and even herself in the little mouth of Krishna.", " She felt dizzy.", " With his illusionary powers, Lord wiped out the memory of this incidence from the mind of Yashoda, and she again immersed in love with her child. "], "next": "16.10.10", "prev": "16.10.8", "title": "Childhood of Lord Krshna"}