{"index": "16.10.49", "image": "resized_images/Message of Rukmani for the Lord.png", "text": [" Shukdev said:", " \"O Parikshit, Bheeshmak was the king of Vidarbh.", " He had five sons and a daughter Rukmani.", " Rukmi, the eldest son of Bheeshmak, had fixed his sister's engagement with Shishupal, the prince of Chaidi.", " Narada did not like this development.", " He went to Kundanpur, the capital of Vidarbh and said in the court of Bheeshmak:", " O King, I am coming from Dwaraka.", "\" Bheeshmak said! \"O great Sage, I have never heard about any city named Dwaraka\".", " Thus, in the court of Bheeshmak, Narad narrated about the life of Lord Krishna and the grandeur of Dwaraka.", " Bheeshmak heard the tale with full attention.", " His daughter Rukmani too enjoyed the tale.", " But Rukmi had a strong opposition against lord Krishna.", " Ignoring the wish of his father, he was not ready to get his sister married to Lord Krishna.", " On the appointed day, Shishupal appeared there, in a procession, to get married with Rukmani.", " But Rukmani was determined to marry Lord Krishna.", " She sent a love letter to Krishna through a loyal Brahmin and declared a fast unto death.", " Lord Krishna read her letter, which said:", " \"O Trilokkinath, since the moment, these ears have heard about your virtues, actions, character and plays, my soul experiences divine peace.", " O Achyut, my mind is dedicated in your feet.", " O great among the men, this Rukmani has dedicated herself in your feet.", " Now it is upto you to see that no jackal could take away the lion's share.", "\" The Brahmin, the carrier of the letter, returned to Kundanpur with an assurance from the Lord.", " Lord too called the charioteer and set out at once for Kundanpur.", " There in Kundanpur, Rukmani after getting the assurance from the Brahmin, was thus waiting for Lord's arrival.", " Preparations for Rukmani's marriage with Shisupal were on with full swing in Kundanpur.", " All the houses, streets and lanes were cleaned and sprinkled with scented water.", " All the men and women folk donned new clothes and ornaments.", " King Bheeshmak worshipped his ancestors and gods and welcomed the Brahmins liberally.", " Extremely beautiful princess Rukmani was given ceremonial bath and donned with auspicious clothes and bracelets.", " The king of Chedi, Damaghosh got the auspicious rites for the marriage of his son Shishupal, performed by Brahmins.", " All the Baratis (people in marriage procession) were given grand reception.", " Many great kings like Shalv, Jarasandh, Dantvaktra, Vidurath and Paundruk were present in the marriage procession.", " They had come with their armies with an intention of fighting Krishna and Balarama.", " After Krishna's departure, Balarama too set out for Kundanpur with chaturangini (with four wings) army, for he had known about their opponents' preparedness.", " Rukmani was eagerly awaiting Lord's arrival.", " She had received the news that Dwarakanath (Krishna) had resolved to take her away.", " She was feeling overwhelmed in her heart.", " Seeing Lord Krishna arrived intently in the marriage ceremonies of his daughter, king Bheeshmak welcomed him.", " Seeing him, even the common people of Vidarbh prayed \"May our princess Rukmani get Shri Krishna as her husband.", " At the same time, Rukmani emerged from her palace to go to the temple of Ambikadevi, soldiers were guarding her.", " In the temple, Rukmani prayed peacefully:", " \"O Mother Ambika I greet you and Ganapati, who is sitting in your lap.", " I seek your blessing that may my wish be fulfilled and may I receive Shri Krishna as my husband.", "\" On her way back, Rukmani was walking very slowly for she was awaiting Lord's arrival, which was due in any moment.", " Just then, Lord Krishna appeared before her.", " Before she could ride her chariot Lord lifted her from amidst the crowd.", " And in the presence of hundrerds of kings, Krishna and Balarama eloped away with Rukmani. "], "next": "16.10.50", "prev": "16.10.48", "title": "Message of Rukmani for the Lord"}