{"index": "16.10.73", "image": "resized_images/Salvation of Shalva.png", "text": " Shukdev says:\n \"Parikshit, now listen to the tale of how Lord caused salvation for Shalv.\n Shalv was the childhood friend of Shishupal and had attended the marriage of Rukmani as a member of Shishupal's wedding party.\n At that time, Yaduvanshis had defeated them all including Jarasandh and Shalv.\n Right at that moment, Shalv had resolved to destroy Yaduvanshis and began worshipping Gods of the gods Pashupati (Shiv).\n Lord Ashutosh Lord Shiva was pleased with him.\n As a boon, Shalv had got an aeroplane that was invincible even for the gods, demons, humans, nagas, etc and was particularly formidable for Yaduvanshis.\n By the dictate of Lord Lord Shiva, the demon Maya constructed such an aeroplane of iron.\n The aeroplane named Saubh was as big as a city and was difficult to be spotted or caught.\n It could move as fast as one's wishes.\n Soon after getting the aeroplane, Shalv launched an attack of Dwaraka.\n Surrounding Dwaraka, Shalv began to destroy buildings and houses there.\n Seeing the people terrorized, Pradyumn consoled them to be fearless and himself set out on a chariot to counter Shalv.\n He pierced Shalv with arrows.\n But Shalv's minister Dyumana attacked Pradyumn with a mace.\n By the blow of the mace, Pradyumn lost his consciousness.\n But soon he came around and began to slay Shalv's forces.\n The fierce battle continued for twenty-seven days.\n Lord was away then in Indraprastha Yagya.\n But He was sure that in his absence Kshatriya kings of Shishupal side would be attacking on Dwaraka.\n Lord reached Dwaraka and saw a fierce battle between Pradyumn and Shalv.\n Seeing Lord arrive, Shalv began to attack Him with sharp arrows.\n Lord hit Shalv with a powerful blow of mace and he began to spit blood from his mouth.\n He then tried to show many illusions and showered Lord with weapons.\n But Lord wounded Shalv with his arrows, broke his aeroplane with his mace.\n Very soon thereafter the aeroplane plunged in to the sea.\n Shalv then attacked Lord with mace but Lord cut his head with Sudarshan wheel.\n Seeing his end, all the gods showered flowers on Lord. ", "next": "16.10.74", "prev": "16.10.72", "title": "Salvation of Shalva"}