{"index": "16.10.3", "image": "resized_images/Birth of Lord Krshna.png", "text": " The long awaited day also arrived at last.\n It was the eighth day in the waning (darker) phase of the lunar month of Bhadrapada (corresponding to August/September).\n Rohini, the brightest star was rising while dense clouds had gathered in the sky.\n Before actual arrival, Lord manifested Himself before Vasudev and Devaki.\n They felt as if a full moon had risen in the east.\n Vasudev saw that an extraordinarily marvellous baby boy was standing before them.\n His eyes were as soft as lotus;\n He had four arms and held a conch, mace, wheel and lotus.\n He bore Kaustubh Mani in the neck and wore yellow clothes.\n Valuable ornaments adorned all parts of his body.\n Thus, seeing God himself arrived as his son, Vasudev was overwhelmed.\n Devaki too was overjoyed but feared Kansa first.\n Then she joyfully prayed to God.\n God said then, \"During Swayambhu Manvantar, both of you had worshipped me with a desire of son.\n Vasudev was a Prajapati Sutapa while you were his wife Prishni.\n You had worshipped me with pure hearts.\n Pleased by your penance I had asked you to seek a boon, so you had sought a son like me in virtues.\n I had arrived then as your son Prishnigarbh.\n In the next birth you were Kashyap and Aditi and I was Upendra.\n Now, in the third birth also.\n I have arrived as your son.\n\" Saying this, the Lord transformed Himself into an ordinary baby.\n From the inspiration of God, Vasudev wished to move the baby out of the prison.\n Instantaneously, all the locks of the jail opened automatically and the guards fell asleep.\n Carrying the baby in a winnower, Vasudev set out for Gokul across the river Yamuna.\n It was raining heavily, so Sheshnaga followed them shading the baby with his hoods.\n Vasudev entered the river Yamuna.\n Yamuna too felt overjoyed that her most beloved lord has come to her.\n Hence, she began to rise in order to touch His feet.\n Dangling his feet behind Vasudev, God let Yamuna touch them.\n Touching the feet, the swelling river receded at once and gave Vasudev a safe passage.\n Crossing the river, Vasudev reached Gokul.\n There, he entered the home of Nand and kept the baby beside Yashoda and took her new born baby girl and brought her to the prison.\n As soon as Vasudev kept the baby girl in Devaki's lap, the gates locked up again and the guards awakened.\n The baby who was actually Yogmaya (personification of illusion) began to cry.\n The guards at once ran to inform Kansa about the birth.\n Kansa came running and snatched the baby from Devaki and proceeded to throw her on the stone.\n But before he could throw her, the baby escaped from his hands and assumed Ashtbhuji (eight-armed) Durga appearance in the sky and reprimanded him:\n \"O fool, why are you trying to kill me, when you can't even harm me, the one who will kill you, has already appearred.\n Now stop killing the innocent children.\n\" Kansa stood stunned by the talks and appearance of the goddess.\n Goddess Bhagwadi disappeared and became omnipresent.\n She is now venerable with different names in different locations.\n After the disappearance of Goddess (Yogmaya) Kansa felt remorse.\n He at once fell at the feet of his sister Devaki and brother-in-law Vasudev and began to beg their pardon.\n Thereafter, Kansa released both of them.\n In the morning, Kansa held a discussion with his ministers.\n The ministers, who were formidable demons themselves, assured Kans that they would kill all the babies born within ten days and destroy the Brahmins, cows, gods, ascetics and all those who could pose potential danger to him.\n Shukdev says:\n \"O Parikshit, the demons were Rajoguni (having royal virtues) and Tamoguni (Virtues of darkness) and hence were unable to differentiate good from evils.\n Their extermination was imminent.\n That was why they cultivated hostility towards saints and saintly people.\n O King, those, who disregard saintly people, loose their life, wealth, reputation, religion and everything. ", "next": "16.10.4", "prev": "16.10.2", "title": "Birth of Lord Krshna"}