{"index": "16.10.45", "image": "resized_images/Bhramar Geet.png", "text": [" Next day, when the Gopis got the news of Uddhav's arrival, they thronged in and around Nand's residence.", " They recognized the chariot parked in front of the gate.", " It was the same chariot on which Krishna and Balarama had departed for Mathura.", " First they thought that their beloved Krishna had returned.", " But their belief did not last long.", " Some of them opined that Akrur might have come again.", " But what for?", " But then someone informed that it was Uddhav, Krishna's Savant friend, who had come to preach them about metaphysical knowledge.", " Soon afterwards, Uddhav came out and spoke out loud:", " \"O Gopis, listen to the preaching of Uddhav.", "\" But instead of listening to him, Gopis covered their ears.", " Feeling insulted, Uddhav expressed his dissatisfaction over their behaviour.", " Gopis said to him:", " O gentleman, firstly we are not familiar with you, secondly we have no capacity to hear your preaching.", " Yes if you wish to give us a message of our most beloved;", " thousand of ears are eager to hear that.", "\" Uddhav then introduced himself as the intimate friend of Lord Krishna.", " Knowing his identify Gopis welcome and treated Uddhav warmly.", " Uddhav then began to say again:", " \"O Gopis, the person, whom you are declaring as your beloved friend, in fact has no mother, no father.", " He has no form, no colour and no body.", " He is above all, non-existing all pervasive and the giver of joy.", " He is never separate from his devotee and beloved ones.", " All of you, too, feel the presence of that Supreme Being and be happy forever.", "\" Gopis said:", " \"Uddhav, as long as Ghanashyam stayed with us, we saw endless virtues in him.", " But only within six months of his stay in Mathura, you wiped out all of his virtues and turned him virtueless.", " Tell us with which mouth did he eat butter, with which hand did he break our pitchers, with which feet did he pasture cows in the forests and with which feet did he dance on the hood of Kaliy.", " Was he another Krishna?", "\" Harsh reaction of the Gopis startled Uddhav.", " He began to think where he had been caught.", " His knowledge of Vedant was proving ineffective on the Gopis.", " Who are sunk in so much love.", " On the other hand, Gopis too were feeling embarassed for treating the guest bitterly.", " But they were also not prepared to listen to such preaching that condemned love.", " Moreover, they had let out their long accumulating feeling.", " Meanwhile a bumblebee perched at Radha's feet mistaking them for lotus.", " Pointing to it, all the Gopis said:", " \"Beware O bumblebee, beware if you dare to touch the feet of our Radha.", " It appears that you are a disciple of Krishna.", " There is now no secret regarding the virtues and actions of your friend.", " But it is good that he and you tied in friendship.", " You are black and your friend has a black heart.", " Virtues of both of you are same.", " First He imbibed us in His love;", " then left us ruthlessly forever.", " He is not sorry for us.", " But why does Lakshmi serves in those feet?", " She must be careful, lest she should be deceived like us.", " O bumblebee you also appear to be a polymath who has come here to preach us.", " But you won't get an audience in Braj.", " You should better go to Mathura.", " There is one Kubja go and relate your tale to her.", " You will receive ample donations from her.", " What will you get from the Gopis here?", " They have already lost their mental balance, because of their separation from the beloved Krishna.", " If you have come to ask, why we loved Krishna.", " O bumblebee, we have no knowledge.", " But we know that our love for Krishna was not a mistake.", " Even the goddess Lakshmi does not leave His feet for a moment.", " Why should we leave his feet then?", " But O bumblebee, have you really come to convince us.", " When He could not come out of shame, He sent you to console us - the deaf and dumb Gopis, But be careful if you put your head at the feet of Radha.", " Get away, we have already seen enough of flattery and flirtation of your friend.", " Deserting our affection for ephemeral things, we loved that eternal one.", " but He too abandoned us.", " Can you guess about our condition?", " Tell us, O Uddhav, shall we ever get the sight of Shri Krishna again?", " Hearing the tragic tale of the Gopis, Uddhav too felt very sorry for them.", " He felt as if Mathuranath, lord Krishna was indeed neglecting those Gopis.", " Uddhav stayed in Vrindavana for six months.", " There he saw every place, every spot where lord Krishna had played once.", " When he was returning to Mathura, mother Yashoda presented him with butter, Radha gave him the flute.", " Thus immersed in the love and overwhelmed by its feelings, Uddhav reached Mathura.", " He said to Krishna:", " \"Lord, the real appearance of love, that I saw in Vrindavana is the only truth.", "\" Shri Krishna said:", " \"Uddhav, You are weeping.", " Just look at me.", "\" Uddhav looked at him with wide, opened eyes.", " In every single hair of Lord, there existed Gopis.", " Uddhav was indeed a Savant. But Lord had sent him to Braj only to be taught a lesson of love. "], "next": "16.10.46", "prev": "16.10.44", "title": "Bhramar Geet"}