{"index": "16.10.75", "image": "resized_images/Sudama – The Lord’s Friend.png", "text": " During his stay as a disciple at the hermitage of sage Sandipani, Lord Krishna had a Brahmin friend named Sudama. He was very indifferent in nature with no desires for the material things. After their education, Lord Krishna came to Dwaraka while Sudama, who had no any inclination for accumulating material wealth, got married and began to pass his life with his wife Susheela abject poverty. One day his wife Susheela said: \"O lord, your friend Krishna is the king of Dwaraka. He is very benevolent to Brahmins and his devotees. If you go to see him, he will understand your miseries and grant you a lot of wealth.\" But Sudama plainly refused saying: \"Devi, I have chosen the path of devotion for self upliftment and not for the wealth.\" Susheela, however, kept of insisting: \"All right, don't go for the wealth. But at least you can go to see your old friend. Sudama accepted this proposition, thinking that only the sight of Lord yields supreme benefit to the devotee. But he wanted something as a gift to present to his old friend. At this, his wife tied four handfuls of raw rice in a bundle. With that humble gift, Sudama set out for Dwaraka. His poverty was at its helm. But he kept on reciting Lord's name all along the way. After walking for some distance, Sudama felt thirsty. He drank water, quenched his thirst and thanked God that He at least does give water to drink. Sudama kept on walking the whole day. In the evening, he kept the bundle of rice under his head as a pillow and slept. Now it was God's turn to show His gratitude for the devotee. When Sudama awoke in the morning, he found himself right in front of Lord Krishna's palace. At first he could not believe his eyes; but the people told him that he was in Dwaraka and standing right before the lord's palace. Sudama requested the gatekeeper to inform Lord Krishna that his childhood friend Sudama had come. Lord Krishna was sitting in the company of Rukmani when the gatekeeper delivered the message. As soon as Lord Krishna learned about Sudama's arrival, He stood up and ran helter-skelter to welcome his childhood friend. At the gate He cordially embraced Sudama and escorted him into his private chamber and made him sit on the throne. Krishna and queen Rukmani both washed Sudama's feet one by one. By the mere touch of his friend, Krishna was feeling overjoyed. His eyes filled with tears. He and Sudama were holding each other's hands. Their hearts were beating with the memories of their period as disciples at the hermitage of Sandipani. For long, none of them could uttered a word. At last Sudama said: \"O Jagadguru Krishna, I have the fortune of being your friend. What remains for me to do?\" Lord Krishna said: \"Brother, have you brought for me something sent by my sister-in-law? I love to accept even the pettiest thing presented with affection.\" Shukdev says: 'O Parikshit, at the Lord's words, Sudama felt ashamed and he did not reveal the four handfuls of raw rice that he had brought as gift. With shame, Sudama began to look at the ground. Lord knew everything that his dear friend Sudama had never remembered him with a desire for wealth. This time too he has come at the insistence of his wife. 'Hence, I will give him the wealth that is rare even for the gods...' thought Lord Krishna and snatched the bundle of raw rice and opened it with great respect. He put one handful of it in his mouth. When Lord proceeded to take next handful, queen Rukmani held his hand and prayed: \"O Vishvambhar (fosterer of the world) for the prosperity of entire world this one handful is sufficient.\" Sudama stayed that night in the palace of Shri Krishna. There he experienced the comfort of Vaikunth (abode of God). Staying there for many days, Sudama at last, took leave of Shri Krishna and set out for his home. Lord did not give Sudama anything apparently nor did Sudama asked for His favour. He was travelling overwhelmed by a divine sense of devotion and felt that Krishna might have not given him wealth lest he should forget Him. Thus, sunk in myriad kinds of thoughts, Sudama reached his home. But at the place, where his dilapidated hut stood once there was now a divine palace surrounded by verdant gardens. The floors of the palace were embedded with precious gems and stones. Standing at the gate, Sudama felt confused, when his wife Susheela came out with scented water to welcome him. Tears were rolling on her cheeks. With love she greeted Sudama and escorted him inside the palace. Sudama was still reflecting over the God's grace and praying: \"May I have the friendship of lord in every birth, may my affection increase for Lord's feet. I don't want wealth.' Since then, Sudama enjoyed the comforts of the palace as the bounty of Lord bestowed upon him by non other than the Lord Krishna himself. His devotion increased day by day. ", "next": "16.10.76", "prev": "16.10.74", "title": "Sudama – The Lord’s Friend"}