{"index": "16.10.80", "image": "resized_images/Prayers of Vedas.png", "text": [" King Parikshit asked:", " \"Brahmin, Brahma is beyond the limit of do's and why's.", " He is free from the virtues like Sat, Raja and Tama.", " He cannot be seen by mind.", " On the other hand Guna (Virtues) is the subject of all the Shrutis (Vedas).", " How do Vedas then depict Brahma?", "\" Shukdev says:", " \"Parikshit, Lord is omnipotent and a treasure of all the virtues.", " Shrutis (Vedas) do depict Saguna (with virtues) clearly.", " But reflect on them deeply and you get virtuesless meaning from them.", " Once, Lord Badrinarayana had arrived among the inhabitant sages of Kalaygram.", " Devarishi Narad had asked him the same question.", " In the assembly of the great sages, Lord then narrated the same tale, which the inhabitants of Janloka had asked.", " The supreme sages like Sanakadi and his brothers were equal in knowledge, penance etc.", " Yet they chose Sanandan as the narrator, and rest three became the audience.", " Sanandan had said:", " \"Such as the savants and balladiers sing in praise their king to wake him up in the morning, similarly annihilating the entire universe in Him, Paramatma (supreme soul) lies asleep with all His powers.", " At the end of Pralaya, Vedas (Shurtis) wake Him up through the words that demonstrate Him.", "\" Shrutis (Vedas) says:", " \"O Ajit (invincible one), you are supreme, no one can conquer you;", " may you win everywhere.", " O Lord, you are complete with all the luxuries, hence destroy the illusion that allures all the living beings.", " We are unable to describe your appearance.", " But when your powers manifest in creation.", " We get some ability to describe you.", " Description of Brahma, Indra, Agni, Surya and other gods, by us (Vedas) appears as separate, The complete universe is not different from you.", " It is a description of your various forms.", " You are unborn, even in those idols.", " You do not take birth.", " All the Vedas describe your merits.", " All the savants love none but you through hearing and remembering of your auspicious, benevolent virtues.", " O, endless, if anybody in human incarnations does not recite or remember your name he is breathing in vain.", " Dharma(duty), Arth (Wealth), Kama (Sensual pleasure) and Moksha (Salvation) have no meaning for those who remember you with pure heart.", " O endless, glorious Lord, common people are wandering in abject darkness of unnecessary disputes.", " Your realization is impossible.", " When will that moment arrive in my life.", " When I shall recite your names like Madhav, Vamana, Trilochan, Govind etc.", " with joy and get free from all the miseries.", " O Lord, this entire universe is false.", " But still appears as real.", " We pray to that God who is present as an illuminating truth in this false creation.", " O Lord of all, people can not sail across this ocean of death without you, no matter what they do to achieve salvation.", " Their all efforts are futile.", " O Lord, all the living beings are wandering in your illusion.", " But the learned ones don't regard themselves separate from the cycle of life and death.", " In your shelter, they have nothing to fear.", " Shukdev says:", " \"Parikshit as per your query, I told you how Vedas describe Parabrahma Paramatma who is free from natural virtues and invisible.", " O king, it is the lord who conceptualizes the universe and is present in the beginning, mid and the end of it.", " He is the Lord of nature and creatures.", " It is He who created the universe and entered it with the creatures.", " He created the bodies and controls them.", " Such as a human being, who is immersed in deep sleep, is not aware of his body.", " Similarly, on receiving God, the creature is freed from illusion.", " So one must continuously reflect on the virtues of Lord Shri Krishna.\" "], "next": "16.10.81", "prev": "16.10.79", "title": "Prayers of Vedas"}