{"index": "16.10.4", "image": "resized_images/Festivities in Gokul for Lord’s Birth.png", "text": [" Devaki's seventh baby was transferred before birth into the womb of Rohini.", " The baby was born as Baldevji.", " At his birth, Brahmins blessed Nand.", " But laughingly Nand said:", " \"O holy Brahmins, this baby is not mine.", " It is born to my friend's wife.", "\" Brahmins said then:", " \"Okay Baba, we will return only when your wife bears a child.", " The Brahmins thereafter organised grand worships.", " By their blessings Yashoda conceived.", " It was Wednesday, the eighth day in the darker phase of the lunar month Bhadrapada (August/September), when Yashoda said to her sister-in-law Sunanda:", " \"Sister, kindly wake me up, when the baby takes birth,\" Sunanda laughed at that.", " It was in fact the influence of Yogmaya.", " When Yogmaya took birth, all the people around her were fast asleep and continued to sleep until Vasudev came there and replaced the baby girl with baby boy.", " Soon after Vasudev left, Yashoda awakened from slumber and saw an extremely beautiful baby boy beside her.", " Nand was meditating then in the cowshed.", " He was informed at once.", " His heart too filled with supernatural joy.", " He took his bath, and droned new clothes.", " Then he summoned the Brahmins and got necessary rituals performed.", " Served the gods and his ancestors and donated cows, clothes, ornaments and cereals to the Brahmins.", " As Nand was the chief of Vraj region, so all the people decided to celebrate baby's birth.", " All the houses, streets and lanes were cleaned and sprinkled with scented waters.", " All the gateways were embellished with flags, pylons and festoons.", " All the villagers began to gather in and around Nand's home.", " Ladiesfolk also felt overjoyed by the news of the birth of Yashoda's son.", " Even the cows, oxen and calves also were adorned beautifully.", " Brahma, Narad, Sanakadi etc.", " were all having the sight of lord from heaven.", " Even Lakshmi appeared in Gokul, illuminating all the azimuths.", " Gopis (ladiesfolk) decorated their palms with henna, anointed themselves with ubatan (a paste composed of gram floor and many herbs, supposed to enhance beauty) and took bath.", " Then they adorned themselves from tip to toes and set out for Nand's homes with various gifts.", " At Nand's home they sprinkled the baby with water containing turmeric and oil and sang auspicious songs loudly.", " Thus, when lord appeared in Braj, grand celebration was organised in His welcome, auspicious music was played.", " The menfolk celebrated the joy spraying one another with milk, curd, butter etc.", " Nand presented the people generously with clothes, ornaments and cows.", " Prisoners, ascetics and beggars were given alms.", " At the request of Nand, Rohini herself welcomed the womenfolk.", " Since the arrival of lord, prosperity too came to stay in Vraj. "], "next": "16.10.5", "prev": "16.10.3", "title": "Festivities in Gokul for Lord’s Birth"}