{"index": "16.10.72", "image": "resized_images/Salvation of Shishupal.png", "text": [" King Yudhishthir had invited great vedic Brahmins and Acharayas on the occasion.", " Those great Sages included Ved Vyas, Bhardwaj, Sumantu, Gautam, Asit, Vashishth, Chyvan, Kanv, Maitrey, Kavash, Chit, Vishvamitra, Vamdev, Sumati, Jemini, Kratu, Pail, Parashurama, Shukracharya, Asuri, Vitihotra, Madhuchchanda, Veersen and Akritvarn etc.", " Persons from Kauravas side like Drona, Bheeshma, Kripacharya, Dhritrashtra, Vidhur and Duryodhan etc.", " were too invited to witness the celebrations.", " Even Brahma, Shiv, Indra, Gandharvas, Vidyadhars had too arrived.", " But before the Yagya could start a dispute cropped up among the great sages as to who ought to be worshipped first in the Yagya.", " In the opinion of Sahdeva (youngest of the Pandava brothers, not the son of Jarasandh), Lord Krishna deserved the first worship.", " Every one supported him.", " Only Shishupal could not tolerate the decision.", " He stood up and said:", " \"In the presence of such great ascetics, savants, polymaths and sages, how can this cowherd deserve the first worship.", "\" Despite Shishupal bitter remarks Lord Krishna kept quiet.", " But Shishupal did not.", " Encouraged by Lord's silence he began to attack the kings, who stood by Lord's side, with sword.", " He was simultaneously abusing Lord Krishna also.", " Lord had assured Shishupal of this forgiveness for up to one hundred sins.", " But now Shishupal's sins have crossed that permitted number.", " So, quieting all, Lord cut his head with His wheel.", " As soon as the dead body of Shishupal fell on the ground, a flame emerged from it and merged with Lord Krishna.", " Shukdev says:", " \"O Parikshit, feelings of hostility had been accumulating in the heart of Shishupal for his past three births against Lord Krishna.", " It was because of these intense hostile feelings that Shishupal met salvation eventually.", " After the salvation of Shishupal, ceremonies and rituals of Yagya proceeded unabated.", " At the end king Yudhishthir presented all those present there with fitting gifts and took ceremonial bath.", " At the request of Pandavas, lord Krishna stayed in Indraprastha for many months. "], "next": "16.10.73", "prev": "16.10.71", "title": "Salvation of Shishupal"}