{"index": "16.10.35", "image": "resized_images/Departure of Krshna-Balarama for Mathura.png", "text": " When the Gopis heard about Krishna leaving Gokul to visit Mathura, they began to wail and cry.\n They were getting so much restless by the news that, they felt, their lives would end before the sunrise.\n They started imprecating fate that it had no kindness.\n First it provided them with a closer contact with their beloved Kanha, now it was causing a long separation from him.\n Some of Gopis even begged for death, they felt it better than living without Kanha.\n All the Gopis kept on crying and wailing nightlong.\n Mother Yashoda awoke early in the morning next day.\n She churned out butter and adding Mishri (sugar candies), she took it to Krishna to feed him.\n But there she found that both Krishna and Balarama were getting ready to set out for Mathura.\n They held mother's feet and said:\n \"Pardon us, O mother, we are going to Mathura.\n\" These words disturbed Yashoda.\n She ran and fell at Akrur's feet and said:\n \"I am your slave.\n O Akrur, please do not take my beloved sons to Mathura.\n They are inseparable from my heart.\n Why Kansa has summoned them to Mathura.\n O Akrur, go and tell him to take everything from us, but spare our sons.\n We are also ready to live in jail, but can't lose our beloved sons.\n\" Akrur consoled Yashoda.\n \"Bhabhi (sister-in-law), don't worry.\n These two brothers are going to Mathura to witness the festivities there and will return soon to comfort your heart.\n\" Yashoda said:\n \"Akrurji, Mathura is a town of gold and both of my sons are too young yet to be needed there for any reason.\n\" Touching the feet of Nand and Yashoda, both the brothers said:\n \"Father, mother, we will definitely return.\n Presently we wish to see the grandeur of Mathura.\n\" Meanwhile all the Gopis and Gopas had gathered there.\n Crying and wailing, the Gopis said:\n \"You are very Cruel, O Akrur, who named you as Akrur.\n You have come here to lacerate our hearts.\n\" Second Gopi said:\n \"No friend, it is not a fault of Akrur.\n Our complaints are with Shyamsundar.\n We left everything, our husbands, children, our homes and dedicated our entire selves in your service.\n And now you are deserting us so ruthlessly.\n We have no support for our life except you, O Madhusadan.\n\" Saying this, all the Gopis burst into tears again.\n All the Gopas, including Shridama surrounded the chariot and said:\n \"O Krishna we had not even dreamt that you would desert us so ruthlessly.\n O Kanhaiya we have seen with our eyes that even Indra, Varuna, Sanakadi and Brahma bow before you.\n But we have never regarded you as God.\n We regarded you as our friend.\n Are you angry with us?\n O my childhood friend Kanhaiya, we request you, we will never abuse you in future.\n If you were intending to go, why did you, then save us from the infernal forest fire.\n Why did you save from the deluging rains?\n We cannot live without you.\n Tell us O benevolent friend, When will you return.\n\" Lord Krishna consoled them all and took many of them with Him.\n The chariot began to move.\n As long as the flag of the chariot remained visible, people kept on crying and wailing.\n Even the eyes of Akrur filled with tears.\n Lord asked him:\n \"Kaka, why are you weeping?\n\" Akrur replied:\n \"O Lord, Kansa is the great sinner.\n I feel he will try to torment you by all means.\n So, my heart says, that I should take you back to Vrindavana, because if Kansa did any harm to you, their spirits will curse me for ever.\" ", "next": "16.10.36", "prev": "16.10.34", "title": "Departure of Krshna-Balarama for Mathura"}