{"index": "16.10.27", "image": "resized_images/Raas Leela.png", "text": " Shukdevji related to Parikshit the tale of Kamadev's humiliation.\n Shridhar Swami calls Raasleela as Kama-vijay leela (defeating of Kamadeva- Hindu equivalent of cupid).\n Jagad guru Ballabhacharyaji decribes it as Lords Divy Vihar (divine enjoyment).\n The purpose of describing this tale is just that common people should reflect on the selfless love of Gopis for Lord Krishna and experience the love of God for them as well.\n Lord is an embodiment of Rasa (Pleasure):\n \"RASOVAISAH | RASAMHYEVAL ABDHVAANANDI BHAVATI |\" After conquering Brahma and other gods, ego of Kamadev had surged to great heights.\n He, therefore, requested God to quench his thirst for war.\n God invited Kamadev to visit Vrindavana on the night of Sharad Purnima (Full moon night) in season preceding winter), and told him that on that divine night.\n He would enjoy the company of crores of Gopis.\n \"If I have slightest passion for any of them, you will win, otherwise you will lose.\n\" That night Lord Krishna added more divinity, more brilliance to it with a resolution of Raas with the help of Yogmaya (personified illusion).\n It was a perfect night for the purpose - flowers bloomed in Vrindavana, full moon shone, and gentle, cool breeze blew from the banks of river Yamuna.\n Amidst this stimulating ambience Lord Krishna began to play an enchanting tune on his flute.\n The tune attracted Gopis,their passion surged to its zenith and under the influence of love for lord Krishna and as if in trance, all of them ran to meet their beloved Kanhaiya leaving all their fear, Bondages, patience and shyness behind.\n Some of them were intercepted by their husbands and dragged back to home.\n But only their physical bodies stayed put, their souls reached Vrindavana.\n In Vrindavana on the bank of Yamuna, Gopis saw Vrindavana Vihari (epithet for Krishna) near their familiar cadamb tree.\n Yogmaya adorned all the Gopis from tip to toe.\n In fact those Gopis were not ordinary women.\n Parikshit asked:\n \"Gopis had not regarded Krishna as Parbrahma.\n What was the basis for their passion then?\n Shukdevji said:\n \"When a wretched person like Shishupal, who always abused lord Krishna could find supreme position, there should be no doubt for Gopis who had such a profound passion for Lord.\n\" So Gopis arrived and gathered around Lord Krishna.\n To test their devotion and to enhance the honour of Kamadev, Krishna said to them:\n \"O Gopis, the pure ones, it is not fit for you to stay here at this hour of night.\n Go and serve your husbands.\n Your duties must be first to your husband's children and cows.\n They will be waiting for you eagerly.\n Go and console them.\n You can gain me by hearing, reciting, seeing etc.\n You need not sit here.\n Go to your homes.\n\" Gopis, however said:\n \"Govind, we have come to you leaving all the mundane lusts behind.\n Now going back is like ruining over lives.\nIt is the greatest misfortune if someone returns to mundane affairs even after being at your feet.\n\" These words that reflected divine feelings of Gopis pleased Lord.\n He began to enjoy their company.\n But a feeling of ego began to creep in the minds of Gopis because of lord's closeness.\n They began to assume themselves as highly fortunate.\n To remove their ego, Lord disappeared right among them. ", "next": "16.10.28", "prev": "16.10.26", "title": "Raas Leela"}