{"index": "16.10.1", "image": "resized_images/Marriage of Vasudeva and Devaki.png", "text": [" Shursen's son Vasudev was married to Devaki, the daughter of Devak.", " After the marriage ceremony, Ugrasen's son and Devki's cousin Kansa was driving the chariot of newly wedded couple.", " On the way a celestial voice proclaimed \" O Fool Kansa, the eighth son of your beloved sister, whose chariot you are driving so affectionately, shall be the cause of your death.", ".", "\" Hearing the voice Kansa drew out his sword to kill Devaki.", " But Vasudev prayed to him politely, \"Prince Kansa, you are the descendent of Bhoj dynasty, you are a brave man.", " It does not fit you bravery that you are yourself ready to kill your sister.", " She is a woman and has just got married.", " She has not done any harm to you, she deserves pity.", " If you fear her children, I promise that I will give all her children to you.", "\" Thus assured by truth abiding Vasudev's words, Kansa dropped the idea of killing Devaki.", " As per his promise, Vasudev gave his first newborn child to Kansa.", " Pleased by Vasudev's abidance to truth, Kansa said, \"You eighth son will be my enemy, so I will kill only your eighth son.", " Take the child back.", "\" At the same time, singing in Lord's praise, Devarishi Narad appeared there and said, \"O Kansa in view of rising atrocities of demons, Lord Narayana himself will take birth in Yaduvansh.", " Besides Him, all the cowboys and all others who belonged to Yadav clan are none other than the gods in Human guise.", " The gods are making massive preparations to exterminate evil kings and as a lotus has only eight petals and no one can mark out its eighth petal, similarly, Devaki will have eight children and no one would be able to find out who is the eighth.", "\" Saying this, Devarishi Narad disappeared, Kansa got firm belief that all the Yaduvanshis were gods and that Lord Vishnu Himself would take birth as Vasudev and Devaki's son to kill him.", " He, therefore, put Vasudev and Devaki in the prison.", " Since then Kansa killed the children one by one soon after their birth, Shesh Narayana Himself appeared as the seventh son.", " While he was still unborn, Lord Vishnu through His Yogmaya (personified illusion), transfered the embryo in Rohini's womb.", " Lord dictated Yogamaa that she herself should take birth from Yashoda, the wife of Nand, in Gokul.", " He also blessed her that in future, people would worship her as Durga, Chandika, Bhadrakali, Narayani, Vaishnavi etc.", " When the seventh fetus was transferred, Kansa got worried how was it destroyed.", " His fears and melancholy increased since then.", " A fear gripped him that his death was very near now. "], "next": "16.10.2", "prev": "16.10", "title": "Marriage of Vasudeva and Devaki"}