{"index": "16.10.46", "image": "resized_images/Battles with Jarasandh: Construction of Dvarka-puri.png", "text": " After the death of Kansa his widowed queens Asti and Prapti returned to their father Jarasandh's home and informed him that Krishna and Balarama had killed their husband Kansa.\n Infuriated by the news, Jarasandh at once launched a massive attack on Mathura.\n The people of Mathura were frightened by the strength of Jarasandh's army.\n Lord Krishna too fell in deep thought.\n Just then, divine weapons and chariots appeared from the heaven.\n Both the brothers took the weapons and boarded their chariots.\n Then they fought a fierce battle and slayed all the army of Jarasandh.\n Balarama furiously caught Jarasandh and was about to kill him.\n But Lord Krishna stopped him.\n They then released Jarasandh and let him go unhurt.\n Jarasandh felt ashamed that Krishna released him because of his helpless condition.\n Shukdev says:\n O Parikshit, despite his shameful defeat, Jarasandh attacked Mathura seventeen times with huge armies.\n But every time, the Lord defeated him and released him in kindness.\n And every time Jarasandh felt more humiliated.\n\" At last, instead of attacking Mathura himself, Jarasandh sent Kalyavan to defeat Shri Krishna.\n Kalyavan launched an attack on Mathura with one crore strong Malechchh army.\n This time Lord Krishna decided to vacate Mathura instead of countering the attack.\n He got Dwarikapuri constructed by Vishvakarma and settled all the people of Mathura there.\n Then, unarmed, Lord Krishna walked past Kalyavan.\n Pointed by Narad, Kalyavan at once recognised Krishna and gave Him a chase.\n He also challenged Him, but the Lord did not listen to his challenges and kept moving with face turned away.\n Kalyavan chased Him for long, but could not catch up.\n Ultimately the Lord entered a cave.\n Kalyavan too followed Him into the cave.\n In the cave the Lord saw that someone was sleeping there.\n So He covered the man with his yellow length of cloth and himself hid inside the cave.\n Kalyavan too arrived there and saw the sleeping man.\n He mistook him for God and said:\n \"Krishna, you might have thought that braves do not attack on sleeping people.\n So I will first wake you up and then kill you.\n\" Saying thus Kalyavan kicked the sleeping man hard.\n However, as soon as the man awakened and glanced at Kalyavan, Kalyavan got incinerated at once. ", "next": "16.10.47", "prev": "16.10.45", "title": "Battles with Jarasandh: Construction of Dvarka-puri"}