{"index": "16.10.20", "image": "resized_images/Venugeet.png", "text": [" Shri Shukdevji says:", " \"O king, most of the time of Lord Krishna's boyhood passed in Vrindavana.", " There he grazed cattles and played flute.", " His flute had a divine, enchanting sound.", "The Gopis (girls) gathered around him under the influence of enchanting tunes.", "\" They also heard the enchanting Venu geet that fills one hearts with the memory of Bhagwad.", " One of the girl said to her friend:", " \"O dear friend, Having the privilege of seeing Lords beauty and receving his kindness is the real salvation.", " Another girl said:", " \"O friend, what penance this flute had observed that it has got a closer contact with lips of Nandnandan (an epithet for Krishna).", " Even the siblings of this flute, trees and other vegetation's are pleased with its fortune and are hence showering their leaves and flowers on him.", "\" One more said:", " \"O friend, look, even Bhagwadi Lakshmi has left her luxurious abode in Vaikunth and arrived in Vrindavana to have a look of lord Devakinandan.", "\" A Gopi expressed her jealousy:", " \"Even this doe is better than us, O friends, look how engrossed is she looking at God, that her eyes are not blinking.", "\" Hearing the sweet enchanting tunes of flute even the heavenly elves gather in the sky over Vrindavana.", " They also see the beauty of lord Krishna and showered the flowers of their braids on him.", " Even the cows forgot grazing when then heard the enchanting music of flute.", " The calves too forgot drinking milk and began to look at lord Krishna with joy.", " This is the real devotion for lord Krishna.", " You have to forget yourself in order to find him.", " Condition of girls of Vrindavana was exactly the same.", " After having the sight of lord Krishna they remembered nothing;", " not even the way back to home.", " They stood in the forests in a trance, completely tired, unaware of their self.", " A girl said pointing to the fauna:", " \"Look O friends, look at these birds.", " Do you know that these birds were the saints and sages in their previous births.", " In this birth also they are sitting in a state of trance.", " Look they have forgotten their knowledge hearing the sweet enchanting music of the flute.", " And look at Yamunaji.", " She is also ale to contain her exhilaration.", " She is eagerly spalshing her waves to wash lords feet.", " Yet another girl said:", " \"Look friends the clouds cannot see their lord scorching in the sun.", " So they have covered the sun and shaded Lord Krishna.", " Now they are drizzling as if showering petals.", "\" A girl said:", " \"Friends, look, these Bheelanis are better than us.", " They have such a strong urge of Krishna's sight that when Govind returns home, they smear their body with dusts of his feet.", " Blessed is this mountain which has dedicated its entire self in the feet of Brajnandan and feels overjoyed.", " It is his supreme devotee.", " Kanhaiya has infused even non-living things with life by his sweet tunes of flute. "], "next": "16.10.21", "prev": "16.10.19", "title": "Venugeet"}