{"index": "16.10.17", "image": "resized_images/Grace on Kalia, the Naga.png", "text": [" One day, Bala-Krishna arrived on the banks of Yamuna with their friends.", " Balarama was not with them that day.", " The water of the river Yamuna was toxicated by the poison of Kaliy- The Naga.", " It was exceptionally hot that day and all the cowherds and cattles were very thirsty.", " So without giving any thought, they all drank the water from Yamuna and died.", " But Lord Krishna resurrected them by his ambrosial sight.", " Then lord Krishna decided to purify the waters of Yamuna.", " Thus tying a cloth round his waist, Krishna climbed a Cadamb tree and jumped into the river.", " In the water the lord started playing and splashing water.", " Soon the waves began to rise high.", " When Kaliy- the Naga heard the noise.", " He got extremely angry and appeared before Krishna.", " He saw a beautiful, tender, dark complexioned boy playing joyfully in the waters.", " He stung him and tied him in his spirals.", " Tied in the spirals of Kaliy, lord became absolutely motionless.", " Seeing Krishna in death like situation, all the cowherds and even the cows felt very sorry.", " Just then lord freed himself from the hold of Kaliy.", " Then a game of hide and seek began between them.", " Lord dodged the Naga for a long time.", " Thereafter he rode on Kaliy's hood and began to dance there.", " The followers of God, like Gandharvas etc.", " began to play Mridang, Dhol etc.", " to give him a company.", " Tired from the blows of lord's feet, Kaliy soon began to vomit blood.", " Naga's wives began to pray God, \"O lord, your incarnation is to punish the evil ones for their sins.", " You have shown your grace on us also.", " We are fortunate to have a sight and touch of your feet.", " Pity O lord.", " This Naga can no longer bear your momentum.", " He will die.", " We are all your slaves.", " Kaliy is our lord.", " Kindly forgive him.", "\" With kindness, lord released Kaliy, who prayed thus:", " O lord in your creation we snakes represent Tamoguna (dark virtues).", " We are confused by your illusions.", "\" Lord dictated Kaliy to migrate with his family to Ramanakdweep.", " Since then water of Yamuna became pure for humans and animals. "], "next": "16.10.18", "prev": "16.10.16", "title": "Grace on Kalia, the Naga"}