{"index": "16.10.32", "image": "resized_images/Salvation of Sudarshan & Shankhchuda.png", "text": [" Shukdev says:", " O Parikshit, once on the occasion of Lord Shivaratri, Nand Baba and all other Gopas drove their carts with families and reached Ambikavana on a pilgrimage tour.", " There they took bath in the river Saraswati and with devotion worshiped lord Lord Shiva and Parvati.", " They also observed day long fast and decided to pass their night on the bank of Saraswati.", " But that place was inhabited by a huge python.", " During the night:", " the python emerged and caught hold of Nand's leg.", " Nandbaba cried loudly.", " All the Gopas gathered around him.", " He cried again:", " \"Kanhaiya, This snake is all set to strangulate me.", " Save me.", "\" Lord touched the python with his feet and instaneously, the python vanished.", " In its place appeared a divine-looking human.", " He said:", " \"O Lord, I was a Vidyadhar named Sudarshan.", " I was so much obsessed with my beauty, youth, luxury and comforts that I used to insult others.", " One day I had derided at the ugly appearance of the sage Angira.", " So indignantly he cursed me to become a python.", " But, pleased by my realization of mistake, he had told that when God himself would touch me, I would regain my original appearance.", "\" Thereafter, Sudarshan went round the God, worshiped Him and with his permission, departed to his abode.", " On another occasion, Lord arrived in Vrindavana during Vasant Ritu (spring Season).", " There He took part in Vasantik Raas (Raas of spring season) with the Gopis.", " During Raas itself, a demon Shankhchur tried to escape away kidnapping some of the Gopis.", " A stampede resulted among Gopis.", " Hearing their noise, Lord ran after the demon, carrying a huge Sal (shorea) tree in his hands.", " In no time He overtook the demon and killed him by just one blow.", " He picked up the gem from demon's head and handed it to Balarama. "], "next": "16.10.33", "prev": "16.10.31", "title": "Salvation of Sudarshan & Shankhchuda"}