{"index": "16.10.83", "image": "resized_images/Revival of Brahmin’s dead children.png", "text": [" There in Dwaraka lived a Brahmin.", " When the first son was born to his wife, it died immediately after birth.", " The Brahmin took his dead son to the royal court and complained:", " \"My Son has died because of anti-Brahmin and licentious actions of the king.", "\" One by one, thus, eight sons were born to the Brahmin couple;", " but they all died immediately after birth.", " And the Brahmin kept on dumping his dead sons at the gate of the royal palace.", " When his ninth son was born, and died, Arjun was also there in Dwaraka.", " He made a promise to the Brahmins:", " I shall guard your son or commit self immolation.", " At the time of next delivery, the agitated Brahmin came to Arjun.", " Training his bow and arrows, Arjun made all arrangements to protect Brahmin's tenth son.", " Sanctified by many mantras, Arjun's arrows constructed a fence around the labour room.", " A child took birth;", " but it too died after some time.", " Brahmin,then, cursed Arjuna.", " Arjun scouted through all the three worlds and even the netherworlds in search of the Brahmin's dead son, but he could not find him anywhere.", " Ultimately accepting his failure and as per his promise, Arjun proceeded to immolate himself.", " Meanwhile, Lord Krishna too learned about Arjun's vow and stopped him from self-immolation.", " Thereafter, riding a divine chariot, Lord set out with Arjun, towards west.", " Beyond the limits of cosmos.", " They reached the abode of Lord Vasudev in Tripadvibhuti.", " There Arjun saw that Lord was present in Purushottams appearance.", " Shri Krishna and Arjun greeted Him.", " Lord Purushottam said in a serious voice:", " \"O Krishna and Arjuna, only to have a sight of both of you, I brought the Brahmin's sons to me.", " Both of you had taken incarnation on earth from my part to protect the religion.", " All the demons have been slain by now.", " Now you too return to me.", " Shri Krishna and Arjun again greeted Lord and returned on earth with all the sons of the Brahmin.", " Arjun was greatly surprised to see the supreme abode of Lord.", " He felt that whatever strength a living being had, it was all by Shri Krishna's grace.", " Like common, ordinary people, the Lord stayed on earth enjoing mundane comforts, performed Yagyas like kings, behaved like idealistic people;", " deterred His subjects and slayed evil kings to re-establish religion on earth. "], "next": "16.11", "prev": "16.10.82", "title": "Revival of Brahmin’s dead children"}