{"index": "16.10.5", "image": "resized_images/Salvation of Pootana.png", "text": [" Shukdev says:", " 'Parikshit, after many days, entrusting other Gopals with the onus of guarding Gokul, Nand went to Mathura to pay annual taxes in Kansa's court.", " Vasudev too learned about his arrival and went to see him.", " Nand felt overjoyed to see Vasudev and embraced him affectionately.", " Vasudev asked Nand:", " \"Your age is declining now.", " It is very fortunate now that you have also got a son.", " My Son Balarama and wife Rohini are staying with you.", " He would be regarding you as his parents.", "\" Nand said:", " The evil Kansa killed many of your children.", " He did not even spare your daughter, No doubt, happiness and sorrow are bound to ones fate.", "\" Vasudev said:", " \"Brother, now your duties here are over.", " You should not stay here for long, because I fear some disturbances in Gokul in your absence.", " Hearing this, Nand at once set out for Gokul.", " In the way, he reflected over the words of Vasudev and prayed God:", " \"May God, everything thing be well in Gokul.", " There in Gokul however a curious incidence took place.", " After his discussion with evil ministers, Kansa had sent a cruel ogress Pootana to kill all the newly born babies in his kingdom.", " In the guise of an extremely pretty woman, Pootana entered Gokul.", " She hypnotized the menfolk with her sweet smile and flirting glances.", " She searched new-born babies here and there and entered Nand's home eventually.", " Baby Lord Krishna was sleeping in the cradle.", " He had known about her arrival;", " but posed as if He were asleep.", " Pootana is a form of non-knowledge with an alluring outward appearance.", " Lord Krishna was only six days old then.", " Pootana's breasts were filled with poison.", " Such as someone lifts a sleeping snake mistaking it for a rope.", " Similarly Pootana lifted the baby who proved her death.", " Pootana took the baby to secluded place and began to breast feed him.", " Lord prayed to Lord Shiva who came to stay in His throat and drank all the poison from the milk.", " Thereafter the Lord began to suck Pootana's life.", " Perplexed Pootana began to cry loudly and writhe nervously.", " As her death approached she regained her real, ogress appearance.", " All the men and women were frightened when they saw the huge, formidable body of Pootana.", " But when they saw Krishna playing nearby, their fear gone and with joy they lifted the baby and soothed him.", " Meanwhile, Nand and his fellow Gopas too arrived from Mathura.", " Pootana's body testified the truth of Vasudev's words.", " Gopas cut Pootana's body into many pieces and burnt them outside Gokul.", " When her body was burning, a sweet smell of Agar (a kind of scented wood used in incense making) spread all around.", " Because Lord himself had fed on her milk, So all her sins were destroyed.", " Lord regarded her as his mother and hence salved her. "], "next": "16.10.6", "prev": "16.10.4", "title": "Salvation of Pootana"}