{"index": "16.10.53", "image": "resized_images/Tale of Syamantak, the Gem.png", "text": " A person named Satrajit was a great devotee of Lord Suryanarayana.\n Pleased by his devotion, Suryadev presented him a gem called Syamantak.\n The gem had a radiance equal to the sun.\n Bearing that gem, Satrajit arrived in Lord's court.\n By the radiance of his gem, all the people and the courtiers mistook him for Suryadeva and stood in his regard.\n But the Lord recognised him and asked his coutiers to be calm.\n Then to Satrajit, Lord Said:\n \"Satrajit, your gem is really very beautiful.\n Nana (maternal grandfather) Ugrasen is the king of this region.\n If you present this gem to him, it will be very good.\n But Satrajit refused to present that gem.\n One day, later on, Satrajit's brother Prasenjit went hunting, wearing the gem in his neck.\n In the forest a lion killed him and snatched the gem.\n The lion was in turn killed by the Ursine king Jambvan.\n Jambvan took the gem to his cave and gave it to his children to play with.\n When Prasenjit did not return from hunting, Satrajit felt sorry and accused Krishna that He had killed his brother for the gem.\n When lord Krishna heard that he was being blamed for the mishap, He himself went to the forests.\n There he found the dead body of Prasenjit, but there was no sign of gem around the cadaver.\n He found only footprints of a lion leaving from there.\n Following the footprints, He discovered the dead lion and the foot prints of a great bear.\n Following the footprints, He reached in the cave where Jambvan's daughter Jambvati was playing with the gem.\n As soon as lord Krishna proceeded to take the gem, Jambvan arrived.\n A fierce duel resulted between them.\n They continued to fight for twenty-six days without truce.\n On the twenty-seventh day Jambvan requested Lord! \"Please wait O Lord.\n\" Lord said:\n \"Do you want to take rest?\n\" \"No\", said Jambvan, \"I have recognised you.\n You are non other than Lord Narayana Himself.\n Nobody else has the power to defeat me.\n\" Lord appeared before Jambvan as Shri Rama.\n Jambvan prayed and worshipped Him.\n He was feeling guilty that he dared to fight Lord.\n Lord said that He had arrived there for the gem only.\n Jambvan gave him the gem and also his daughter Jambvati.\n Lord returned the gem to Satrajit and married Jambvati formally. ", "next": "16.10.54", "prev": "16.10.52", "title": "Tale of Syamantak, the Gem"}