{"index": "16.10.10", "image": "resized_images/Ukhal Bandan & Salvation of Yamarjun.png", "text": [" Once, wishing to feed Krishna with butter, Yashoda began to churn milk in the morning .", " Very soon, Krishna too awakened and not finding the mother on her bed, He set out to search her.", " Soon He found her in the courtyard where she was churning the milk.", " He began to insist for breast feeding at once.", " So Yashoda stopped churning and began to breast feed Krishna.", " Affection played on her face.", " Suddenly the milk kept on the fire pot began to boil.", " Yashoda left Krishna in order to attend the boiling milk.", " But the unstiated Krishna filled with anger and broke the pitcher of curd.", " Then he went inside and began to eat butter, when Yashoda came back, she understood the matter and began to search him with a stick in her hand.", " After eating butter himself, Krishna was now feeding the monkeys with it.", " Seeing the mother come in hot pursuit, Krishna jumped over the mortar and ran away.", " Yashoda chased him, but soon felt tired because of her bulky body.", " Thereafter, Yashoda proceeded to tie Krishna as a punishment.", " She got a rope and tried to tie Krishna.", " But the rope fell short by two fingers.", " She joined many ropes together but the result was same.", " Every time the ropes fell short by two fingers.", " Soon, Yashoda was bathing in sweat.", " When Krishna saw his mother in depression, he himself tied in the ropes.", " Tethering little Krishna to a heavy mortar, Yashoda engaged in usual household tasks.", " Tethered to the mortar, Krishna glanced at the two Arjun trees, which were standing on the gate like two sentries.", " He resolved to salve them.", " King Parikshit asked Shukdev about the trees.", " Shukdev said:", " \"Parikshit, the lord of wealth Kuber had two sons Nalkubar and Manigreev.", " One day they were enjoying the sweet company of pretty women on the bank of Mandakini river.", " Just by coincidence, Devarshi Narad arrived there.", " Out of Shyness, the women folk at once covered themselves, but both the sons of Kuber stood boldly without feeling any shame.", " Indignant Narad cursed them to become trees and stay in that form for one hundred years.", " Narad showed kindness as well that despite being in tree forms, they would have the memory of God alive and would be salved by Lord Shri Krishna.", " Thus, to keep the words of his supreme devotee Narad, Lord dragged the mortar to the two Arjun trees.", " He walked in such a way that the mortar got stuck between the trees.", " Krishna then pulled the mortar and in no time the trees were uprooted.", " Two divine men appeared from the uprooted trees and bowed at the feet of Krishna and prayed him with pure hearts.", " Then they departed to their heavenly abode. "], "next": "16.10.11", "prev": "16.10.9", "title": "Ukhal Bandan & Salvation of Yamarjun"}