{"index": "16.10.34", "image": "resized_images/Kans sends Akrurji.png", "text": [" After the killing of Arishthasur, Devarishi Narad visited Kansa and asked:", " \"O Kansa, the girl who had slipped form your hand was in fact the daughter of Yashoda.", " Krishna and Balaram, who are staying in Vrindavana, are infact the sons of Devaki and Rohini respectively.", " Because of your fear, Vasudev has kept them under the supervision of his friend Nand.", " Those two boys have killed the demons sent by you.", "\" Hearing these words, Kansa shook with anger and put Vasudev and Devaki in prison again.", " Thereafter he called his minister Akrur and asked him to set out at once for Gokul.", " He said to Akrur:", " \"Akrurji, you are an old friend and well-wisher of mine, Go to Gokul and bring the sons of Vasudev, who are staying at Nand's home.", " Invite them to visit Mathura, to witness the festivities of Dhannsh-yagya.", "\" Akrur understood Kansa's intentions, but feared that if he refused, that demon would kill him.", " So he decided to visit Gokul, and also have the oppurtunity of seeing God.", " He was feeling overwhelmed by the mere thought of it.", " Next day, he set out on a grand chariot to meet his supreme Lord in Gokul.", " Meditating in the feet of Lord, Akrur was heading towards Vrindavana.", " He was feeling himself as the most fortunate one for he was sure to have a sight of Lord.", " Thus obsessed with many kinds of devotional feelings, Akrur alighted from the chariot at the border of Vrindavana and started walking.", " He found it unjust to ride a chariot on the land of Vrindavana where lord Krishna treaded.", " By the time, he reached Vrindavana, Lord Krishna and Balarama had returned home after grazing their cattles.", " Seeing them, Akrur fell at their feet.", " Both the brothers raised Akrur and addressed him as \"Chacha\" (uncle),and escorted him into the house.", " Akrur was given a warm welcome and treatment there.", " After the dinner, they assembled in Nand's drawing room.", " Nand inquired about the reason of his sudden arrival.", " Akrur said:", " \"Kansa is organizing a wrestling competition in Mathura.", " He has invited all the big and small kings to the competitions.", " He has invited you with Krishna and Balarama as well.", " Beautiful Mathura is worth seeing.", " Gullible Nand felt pleased by Akrur's talking and said:", " \"King Kansa has shown a great honour to me.", " He has sent invitation only to other kings, but has sent his minister to call me and a golden chariot for my kids.", "\" So it was announced in Gokul that all the people would go to Mathura the next day and witness the festivities there. "], "next": "16.10.35", "prev": "16.10.33", "title": "Kans sends Akrurji"}