{"index": "16.11.2", "image": "resized_images/Preaching of Narad about Bhagvad.png", "text": " Once Narad arrived in Dwaraka. Vasudev prayed him and requested to provide him with pious company of Bhagwad dharma. Narad said: \"O king, once upon a time, nine great sages arrived in the court of the king Janak. King Janak had put the same curiosity before them also. I will narrate the conversation that followed there between the sages and the king.\" First of all, the first Yogishwar Kavi said: \"O king Janak, dedication is the first duty (dharma) of a Vaishnav. He should devote everything - his actions, fruits of actions and even himself, at the feet of Lord. He ought to hear about Lord's virtues. Such a devotee shall be indifferent to the worldly affairs and shall laugh, dance or sing occasionally and sanctified all the three worlds.\" The king then asked about the characteristics of the Lord's devotees. Another Yogeshwar Hari said: \"A true devotee of the Lord remains unaffected by feelings like hunger, thirst, life, death, labour, pain, fear and desire. Such a devotee is the excellent kind of Bhagwad. Even the wealth of all the three worlds cannot shake the faith of such a devotee, because Lord Shri Hari himself stays in his heart.\" \"What is illusion?\" A Yogeshwar Antariksh replied: \"King, an illusion is also God's play. Having a possessive feeling about mundane is illusion. Thinking in terms of 'I', 'Me', 'Mine', 'My', 'You', 'Your' is also illusion. If one can have such an affection for God as he has for worldly things, one can easily surmount the illusion.\" King Janak then asked about the method of worshipping Lord. A yogeshwar, Karbhajan said: \" O king, the Lord had a fair complexion in Satyuga. People used to receive Him through methods like meditation, reconciliation, etc. In Tretayuga, the Lord had reddish complexion and Yagyas were the main means to achieve Him. In Dwaparyuga, the Lord had yellowish complexion and He could be pleased through worships. In the present Kaliyuga, Lord has dark complexion and one can receive Him through means like recitation, narration and hearing of His name and plays. Thus, narad preached Vasudev about Bhagwad dharma. Now the heart and mind of Vasudev were thoroughly clean and pure. ", "next": "16.11.3", "prev": "16.11.1", "title": "Preaching of Narad about Bhagvad"}