{"index": "16.10.78", "image": "resized_images/Revisiting of Devaki’s Six Sons.png", "text": [" In Dwaraka, Krishna and Balarama used to greet their parent's first daily in the morning.", " Now Vasudev had recognised His identity.", " So after their return from Kurukshetra, when Krishna-Balarama went as usual to greet their parents, Vasudev greeted them first.", " Lord Krishna then preached his father about the metaphysical knowledge.", " With that knowledge, Vasudev began to see Krishna everywhere.", " Mother Devaki was also present there.", " Memory of her six children, who were killed by Kansa, was still afresh in her mind.", " She had heard that Krishna had fetched the dead son of Sandipani from Yamloka.", " So she prayed to them \" You both are venerable even to the gods.", " Kindly grant me my desire.", " Show me my six sons who were killed by Kansa.", " By their mother's dictate and helped by Yogmaya, both the brothers reached Sutal Loka.", " The demon king Bali welcomed them there and offered them a seat, and washed their feet.", " King Bali then asked God what could he do for Him.", " Lord said:", " O demon king, in Swayambhuv Manvantara, six sons were born to Urna the wife of Prajapati Marichi.", " They were all gods.", " They had once seen Brahma trying to copulate with his own daughter and hence derided at him.", " Indignant Brahma had then curse them to take birth in demon incarnation.", " They therefore were born as the sons of Hiranykashipu.", " In the present era, Yogmaya had made them born as Devaki's sons who were killed by Kansa.", " They are all now in your Loka.", " Mother Devaki is mourning for them, so we shall take them with us.", " They will thus be freed from the curse and go to their heavenly abode.", "\" Thus Lord Krishna and Balarama brought those six babies to Dwaraka and handed them to mother Devaki.", " Seeing her babies again, Devaki's heart filled with love for her sons.", " Milk began to flood her breast.", " She breast-fed them.", " Drinking the milk, all the babies received salvation.", " They then departed to their heavenly abode. "], "next": "16.10.79", "prev": "16.10.77", "title": "Revisiting of Devaki’s Six Sons"}