{"index": "16.10.81", "image": "resized_images/Release of Lord Shiva from Crisis.png", "text": " Parikshit asked: \"Gurudev, those among the gods, human beings and the demons, who worship Lord Lord Shiva, get wealth very soon. But those, who worship Lord Narayana, remain afflicated with scarcity. What is the reason for that?\" Shukdev said : \"Parikshit, your grandfather Yudhishthir had put the same question before Lord Krishna.\" In reply, Lord Krishna had said: \"O Yudhishthir, I take away all the wealth from those whom I bestow my grace. When they are poor, their relatives desert them. I even render their efforts useless when they try to earn money. Thus being unsuccessful repeatedly, the people develop an attitude of indifference for wealth. Then they begin to take shelter as my devotee and mingle with me. Only then, I bestow my full grace on them and they receive me as Sachchidanand Parbrahma. Thus, pleasing me through my worship is extremely difficult. Hence, ordinary people give me up and worship other deities, which are in fact different forms of me. Lord Shiva is Ashutosh and bestows his devotees quickly with grace. He gives wealth and other riches to his devotees. But once they get wealth, the devotees become despotic and even forget the God who had blessed them.\" In this context Shukdev narrated one ancient tale to Parikshit. Once upon a time, there was a demon Vrikasur. He had pleased Lord Shiva and sought a boon that the person, upon whose head the demon put his hand, should be incinerated at once. Lord Shiva granted the boon without considering the consequences. But as soon as the demon got this supernatural power, he ran to incinerate Lord Shiva first. The demon was eyeing Gauri Parvati, so he was determined to eliminate Lord Lord Shiva. Now afraid of his own boon, Lord Shiva ran for his life, with the demon following him in hot pursuit. At last Lord Shiva reached in Vaikunth and told Lord Vishnu about his crisis. Lord at once illusioned the demon and made him put his hand, on his own head. By the virtue of the boon, the demon was incinerated in no time and thus Lord Shiva could be saved. ", "next": "16.10.82", "prev": "16.10.80", "title": "Release of Lord Shiva from Crisis"}