{"index": "16.3.5", "image": "resized_images/Description of 10 Ways of Creation by Maitrey.png", "text": [" 1.", " By the inspiration of God and because of imbalance in pious virtues, creation of Mahattatva (the soul) was the first (Mahattatva the soul).", " 2.", " From Mahattatva (the soul) originates Ahankaar (the ego) which generates five primitive elements (the earth, the fire, the air, the water and the ether), sense organs and motor organs.", " 3.", " Group of Tanmatras (the subtle forms of matter) that generate the five major elements, is the third creation.", " 4.", " Creation of organs that have the power of sensing and moving is the fourth creation.", " 5.", " Creation of the mind that governs the senses and was appeared from ego, is the fifth creation.", " 6.", " Appearance of mind and the illusions that misguide it, is the sixth creation.", " 7.", " The above mentioned six creations are known as natural creations also.", " Creatures other than these six have no power of knowledge, they can experience the touch only.", " These creatures like trees and other vegetables are known as the seventh creation.", " 8.", " Eighth creation is of the birds and animals.", " 9.", " Ninth creation is of those human beings who seek pleasure in action and luxuries which are infact the cause of sorrow.", " 10.", " Tenth creation is of the great sages like Sanatkumar etc.", " Thus at the beginning of the Kalp, God the creator used Rajogunas (royal virtues) to create himself in the form of the universe.", " Maitreyaji says, \" This whole creation is a manifestation of the plays of God.", " That omnipotent God created the universe just by His wish and for the sake of His play.", " For the extension of the creation, Lord Brahma wished and create four sons-Sanak, Sanandan, Sanatan and Sanatkumar.", " Thereafter, with a desire to create world, Lord Brahma ordered them to produce population.", " But Lord Brahma's sons had no interest in wordily affairs.", " Lord Brahma therefore cursed them to remain in children's form for ever.", " Then from Lord Brahma's eyebrows appeared a baby, blue-red in color.", " The baby appeared in eleven forms and began to cry immediately after his arrival.", " Lord Brahma consoled him! \"Don't cry my son, you will be named as Rundra.", "\" So the eleven forms of the baby came to be known as eleven Rundras.", " Rundranis (female Rundra) were also created.", " From Tamas Prakriti (malignant nature) Rundra created the ghosts, the spooks, the spectres, the devils, lamias etc.", " Afraid by their appearances, Lord Brahma prayed Rudra, \" O Mahadev, please stop creating such formidable organisms.", " They are already enough in number.", " Now, you please undertake penance to comfort all the creatures.", "\" Thereafter, Lord Brahma created ten more sons-Marichi, Bhrigu, Kratu, Pulah, Pulatsya, Angira, Atri, Vashishtha, Daksh and Narad.", " Nine out of them took permission for the creation of their offsprings, but Narad accepted celibacy and resolved to preach Bhagwad bhakti (devotion for God.", ") For the continuation of the creation, Lord himself appeared as a female from the left hand and as a male from the right hand of Lord Brahma.", " Those males and females forms were named Manu and Shatarupa respectively.", " They were the first in the whole creation to copulate and bring about sexual reproduction.", " They begot two sons- Priyvrat and Uttanapad, and three daughters- Devhuti, Akuti and Prasuti.", " As the primitive king, Manu was the fosterer of the earth.", " By then a demon named Hiranyaksh abducted the earth and hid it under the abyssimal depth of the ocean, causing worries for Lord Brahma.", " Instantly Lord appeared himself in Varah (boar) incarnation and to do away with Lord Brahma's worries, He at once entered the depth of the ocean and rescued the earth on His long teeth.", " On the way the Lord had an encounter with Hiranyaksh and killed the demon with His wheel.", " Maitreya:", " says Hiranyaksh represented anger.", " Those who don't want to discharge their duties, but still wish to live with all the comforts are abductors of others wealth.", " Such people, who continuously interfere with equal distribution of wealth, must be condemned as the demons.", " On the origin of the demons, Maitreya cryptic said, once Diti, the wife Maharshi Kashyap, expressed her desire to conceive.", " Maharshi Kashyap tried to disuade her that time was not suitable for an auspicious job like conception.", " But Diti kept on insisting and forced her husband shamelessly to assist her in the process.", " Consequently she conceived during the dusk.", " Kashyapji cautioned her \"you will give birth to the demons.", "\" And with the arrival of the demons in Diti's womb, nature began to manifest herself adversely.", " There was terror and famine all around, and darkness prevailed even during day, with stars appearing in the sky.", " Frightened by these manifestations, the gods asked Lord Brahma about the reason of all those disturbances.", " Lord Brahma informed them that two dread demons were to take birth from Diti.", " Those two demons, told Lord Brahma, were the two gatekeepers-- Jay-Vijay, of the Lord's abode.", " Once, Sanakadi Kumar had gone to Vaikunthdham (the abode of God) to see God but those two gatekeepers didn't let them in.", " Sanakadi tried thrice, but only to be stymied every time by those two gatekeepers at the gates.", " Hence, Sanakadi Kumar cursed them to take birth on earth as demons.", " Those two gatekeepers of the God's abode Jay-Vijay appeared first as Hiranyakashipu and Hiranyaksha, second time as Ravan and Kumbhkuran and third time as Duntvakra and Shishupal. "], "next": "16.3.6", "prev": "16.3.4", "title": "Description of 10 Ways of Creation by Maitrey"}