{"index": "16.3.8", "image": "resized_images/Lord Kapil Preaches Metaphysical Knowledge to Devhuti.png", "text": [" Mata Devhuti prayed lord Kapil to preach the way for the benefaction of the soul, which is attached with ephimeral body.", " Lord said 'O mother, Adhayatma Yoga (spiritual conjugation) is the main way of benefaction for the human beings.", " With devotion for me, soul becomes self-knowing.", " Total devotion of the soul in my form and virtues and listening my tales, unmistakably show devotion.", " This leads to an inseparable rapport between my devotee and me.", " This is the greatest benefaction for the humans.", " ETAVANEV LOKEASMIN PUNSAM NISHREY SODAYAH | TIVREN BHAKTI YOGEN MANOMARYARPITAM STHIRAM || The world is like an ocean of death and I cause salvation of those who give up all their lusts and recite my name with fervent devotion.", " This whole nature has different forms, but it is ephimeral and constantly changing.", " It has twenty-four divisions-five major elements (ether, air, fire, water and earth);", " five souls (sound, touch, appearance, fluid and smell);", " five sense organs (eyes, nose, ears, tongue and skin);", " five motor organs (mouth, hands, legs, penis and bones) and mind, intelligence, conscience and ego.", " That omnipresent Purush (an epithet of God) voluntarily accepted Prakriti (an epithet for female force).", " From her various virtues, Prakriti created various creatures that corresponded exactly to the virtues that caused their creation.", " In the mess, the mantle that covered the knowledge also caused illusion for the Jivatma (microcosm of omnipotent spirit) which thus forgot his original appearance.", " The creature then began to assume the nature as a reflection of his own appearance-- though she is different from and opposite to him-- and himself as the doer.", " Such an ego regarding ones duties leads to his entanglement in the cycles of life and death.", " Differentiating between the Prakriti and Purush and experiencing their real appearances respectively, introspecting sages have had a sight of the Supreme Being through their conscience and achieve the unparrlel Brahma Pada.", " Lord Kapil says, \"Through the union of the sperm and the ovum, the human body appears as a lump in the womb.", " His body forms completely within six months.", " Sense organs develop thereafter.", " Twenty fifth element, the soul, then enters the human body.", " With that, the body begins to experience hunger and thirst.", " Then suffering with many kinds of desires, the microcosm prays me to save him from the tortures of staying in the womb.", " I present him with a sight of me in his heart.", " It then takes birth because of my grace.", " But as soon as it appears on the earh the human being begins to forget me.", " Still, I present him with my sight for two to three months more, when he begins to laugh.", " But people arooound him think that he is laughing for his mother.", " Nobody reminds him of me in his childhood.", " Youth of a human being passes in futile activities.", " In old age, his organs begin to fail and a human being finds himself unable to recite my name.", " Thus, the whole life of a human being just passes in the illusion of 'I', 'me' and 'my' and he reaches his last stage, and begins to realize his mistake.", " But then it is usually too late for him to do anything for his benefaction.", " If he has done any good deed in life, he may meet fortune, but without a devotion for me, no one can be happy.", " Only when the soul comes in my refuge, he gets free from the bondages of life and death.", " Maitre says, O Vidur, thereafter Devhuti concentrated her mind in the divine appearance of Shri Hari, as presented by Lord Kapil.", " At once, she got free from all the sufferings.", " She got a sight of God in her conscience and her body transformed into a holy river.", " The place where Mata Devhuti received salvation is still known as Siddhi Pada.", " It is a renowned place of pilgrimage. "], "next": "16.4", "prev": "16.3.7", "title": "Lord Kapil Preaches Metaphysical Knowledge to Devhuti"}