{"index": "16.3.6", "image": "resized_images/Sage Kardam.png", "text": " Continuing the process of creation, Brahma produced Sage Kardam from his shadow and asked him to observe penance first. Thereafter, Brahma dictated Kardam to acquire physical strength and the strength of his sense and undertake the process of creating his offsprings. As per his father's dictate, Kardam observed severe penance. Pleased by his selfless penance, God asked Kardam to seek a boon. Karadam said, \"Lord all the things in the world are ephemeral; only you're eternal. It will be an abuse of the intelligence to beg for some ephemeral thing from an eternal God.\" Overwhelmed by Kardam's plain words, God said in benediction 'On the third day from now you will be married to Devhuti, the daughter of Manu. Nine daughters will take birth in your home. I will myself appear as your son' Saying this, God disappeared. As per the boon Kardam got married to Devhuti, the daughter of Manu. Their formal marriage was the first of it's kind in the creation, adopted as a religiously accepted means for continuation of life. Donating their daughter Devhuti to the sage Kardam, Manu and Shatarupa returned to their abode. As Mata Parvati used to serve Lord Lord Shiva, similarly Devhuti served Kardam with dedication. Once the sage Kardam noticed that Devhuti has aged and shriveled by harsh living. Pleased by her dedication, Kardam asked her to seek a boon. Devhuti only begged that there should never be any lethargy in any service on her part towards him. Pleased again by her pure feelings Kardam provided her with heavenly luxuries. Together they enjoyed those luxuries for many years during which nine daughters were born to them. All those daughters symbolised the Navadha Bhakti (nine kinds of devotion) and were married to nine Prajapatis like Marichi etc. Thus kala was married to Marichi, Anusuya to Atri, Shraddha to Angira, Havirbhu to Pulatsya, Gati to Pulah, Shanti to Atharva, Krita to Kratu, Khyati to Bhrigu and Arundhati was married to the sage Vashishtha. ", "next": "16.3.7", "prev": "16.3.5", "title": "Sage Kardam"}