{"index": "16.4.3", "image": "resized_images/Tale of Dhruv.png", "text": " The self-begotten Manu had two sons- Priyvrat and Uttanpad.\n King Uttanpad had two queens- Suniti and Suruchi.\n Uttanpad loved Suruchi more than he loved Suniti.\n So Suniti was forced to live outside the royal palace with her son Dhruv, while Suruchi and her son Uttam enjoyed all the luxuries in the palace.\n Once the King was playing with his soon Uttam who was siting in his lap.\n Meanwhile, Dhruv too arrived there and began insisting to sit in his father's lap.\n But for the fear of Suruchi the king did not take Dhruv in his lap.\n Just then, Suruchi too arrived there.\n Strutting at her fortune, she ridiculed Dhruv:\n 'Though you are also a son of the king, but you have no right to sit on the throne because you are not borne to me.\n You are the son of queen Suniti who is neglected by the King, and now lives like a mistress.\n So your desire is hard to accomplish.\n Even then if you wish to have the throne, you begin to worship Lord Narayana, and take birth through me by His grace and then wait for your chance to sit in the King's lap.\n' Hurt by his stepmother's harsh words, Dhruv came to his mother crying.\n When Suniti heard about the incidence, she felt very sorry.\n Still, with patience she consoled her son Dhruv, 'O my son, don't wish ill for the others.\n Those who cause sorrow for others, have to face the outcome themselves one day.\n Your stepmother is right.\n You have been born to me.\n Even then, if you wish to be enthroned like the prince Uttam, give up your jealousy and start worshipping Lord Narayan.\n Even you're grand father Manu and great grand father Lord Brahma worshipped him.\n Only Lord Narayan can remove your sorrow.\n' Mother's words shook the conscience of Dhruv.\n He at once set out with firm determination to please Shri Hari by penance.\n Leaving the town, while going in search of solitude he met devarshi Narad in the way.\n Dhruv respectfully greeted Narad.\n Narad lovingly caressed his head and tried to test his determination.\n Narad tried everything to convince Dhruv to send him back to his home, but he failed to shake the firm determination of the boy.\n Then with kindness, Narad preached Dhruv about Lord's appearance and gave him a mantra.\n Thus, Naradji performed his duty as Guru and blessing Dhruv, he disappeared.\n Dhruv arrived in Madhuvan and took a seat under a Kadamb (Cadamba) tree on the bank of the river Yamuna.\n There he began to recite the mantra and meditation.\n During the first month he ate roots and tubers.\n In the second month he ate dried leaves.\n During the third month he managed with Yamuna's water.\n During the fourth month he sustained himself on the air only.\n Dhruv even stopped breathing.\n Now, standing on one leg only, he was fully concentrated in Lord Vasudev.\n At the moment when Dhruv stopped breathing and concentrated in Parbrahma, all the three worlds shook with fear.\n All the gods ran to the refuge of Lord.\n Because of stopping of breath all the organisms stood still.\nAssuring them not to be afraid, Lord arrived in Madhuvan to see His beloved devotee Dhruv.\n Seeing the Lord Himself arrived before him, Dhruv's eyes filled with tears.\n He said, \" O Lord, I don't know how to worship you.\n\" Lord touched his cheek with His conch.\n With that, Dhruv came to realize the glory of God.\n With complete devotion and folded hands, he worshiped Shri Hari:\n \"I salute to such an omnipotent, omnipresent and all knowing Lord, whose power is present in everybody, and who entering my heart revived my speech.\n\" Pleased by his prayer Lord stroked Dhruv's head and said, \" Your desire shall materialize.\n After enjoying your kingdom, you shall come to my abode which is far above the Saptrishis?\n Then by God's permission, Dhruv returned to his father's palace.\n There he was given a grand welcome.\n Everyone wants to be kind with the one who has God's grace, his father handed him the kingdom of the entire earth.\n His brother, Uttam had gone to the forest for hunting where the Yakshas killed him.\n Indignant by his brother's death, Dhruv at once launched an attack on the Yakshas.\n But his grandfather consoled him that the devotees of God don't long for revenge.\n Thereafter Dhruv ruled the earth for a period of thirty-six thousand years.\n Even death bowed before him.\n Indeed, the devotees of God have no fear of death. The death fears them on the contrary. ", "next": "16.4.4", "prev": "16.4.2", "title": "Tale of Dhruv"}