{"index": "16.4.1", "image": "resized_images/Description of the Clans of Manu’s Daughters.png", "text": [" Maitrey then related the description of the Manu's daughters.", " Manu and Shatarupa had three daughters- Akuti, Devhuti and Prasuti.", " Akuti was married to a Prajapati named Ruchi.", " They begot two children-- a son and a daughter.", " The son later on came to be known as Yagyavatar of Lord Narayana, while the daughter was named Dakshina.", " In due course, Yagya and Dakshina begot twelve sons- Tosh , Pratosh, Santosh, Bhadra, Shanti, Indrapati, Idhm, Kavi, Vibhu, Swanh, Sudev and Rochan.", " Manu's second daughter Devhuti was married to the sage Kardam.", " They begot nine daughters who were married, in due course to nine Prajapatis.", " One of them, named Kala, was married to the sage Marichi.", " They begot Kashyap and Purnima.", " Their offsprings comprise today's population of the entire world.", " Gati was the wife of Pulah.", " They begot three sons Karmshreshtha, Variyan and Sahishnu.", " Pleased by the penance of Ansuya and Atri, the Tridevas (trinity of Brahma, Vishnu and Lord Shiva) sent their parts as the sons to the hermit couple.", " Among them Chandrama appeared from Brahma's part, Dattatreya from Vishnus part and sage Durvasa appeared from Lord Shiva's part.", " To Shardha and Angira were born four daughters- Simivali, Kuhu, Raka and Anumati.", " They begot two sons also- Utathya and Brihaspati.", " Havirbhu was married to Pulastya.", " They begot two sons- Agastya and Vishrava.", " In later course, sage Vishrava produced Yakshraj Kuber from Idvida, while his second wife Keshini gave birth to Ravan, Kumbhkaran and Vibhishan.", " Vashishth and his wife Arundhati begot seven Bramarishis like Chitraketu.", " Sage Atharva and his wife Chitti begot a son Taponishth.", " Geat sage Bhrigu and his wife Khyati begot two sons- Dhata and Vidhata, and a daughter- Shri.", " Manu's third daughter Prasuti was married to Daksh, the son of Lord Brahma.", " She got sixteen daughters.", " Daksh married thirteen of them to Dharm.", " Of the remaining three daughters, one was married to Agni, one to Pitrgana and one to Lord Lord Shiva.", " Shraddha, Maitri, Daya, Shanti, Tushti, Pushti, Kriya, Unnati, Buddhi, Medha, Titiksha, Hree and Murti are the wives of Dharma.", " Of these Murti begot the sages Nar-Narayan.", " Swaha the wife of Agni begot three sons- Pavak, Pawaman and Shuchi.", " Two daughters were born to Swadha the wife of Pitrganas.", " They were named Dharini and Vayuna.", " These both daughters were Brahma vadinis (expounders of vedas.", ") Sati, the youngest daughter of Daksh and wife of Mahadev, however could not begot any offspring because she had committed immolation in her youth as a protest against her father's misbehaviour with her husband Mahadev. "], "next": "16.4.2", "prev": "16.4", "title": "Description of the Clans of Manu’s Daughters"}