{"index": "16.4.2", "image": "resized_images/Misbehavior of Dakshaprajapati with Lord Shiva.png", "text": " Vidur asked Maitrey:\n 'Lord Shiva is an idol of peace.\n He has no enemity with anyone.\n He is self indulgent Why did then Daksh Prajapati misbehave with Him?\n Maitrey said, \" Once a meeting of Brahmavadis (expounders of vedas) was organized.\n Alongwith all the gods Lord Shiva and Brahma were also present in the meeting.\n Because of being a Prajapati, Daksh was allowed a late entry in the meeting.\n Moreover, when Daksh did arrive, all the gods, except Brahma and Lord Shiva, stood up to pay him regards.\n Honor by thousands of gods did not please Daksh as much as he felt insulted the by behaviour of Lord Shiva.\n Brahma was the father of Daksh, so he didn't mind his behaviour.\n But seeing Lord Shiva sitting there and not paying due respect to him, Daksh got angry.\n He said, \"He is like my disciple.\n I've married my daughter to him but he is uncourteous and irreligious.\n I committed a blunder by marrying my daughter to him.\n He smears ashes of pyre and roams at the cremation sites.\n Only the ghosts are his companions.\n\" Thus, Daksh cursed Lord Shiva.\n \"May this Lord Shiva not get his due share alongwith the Gods in oblations.\n\" Nandi, the prominent among Lord Shiva's servers, cursed Daksh in retaliation:\n \"May the unwise Daksh lose his mind and be like an animal always bound to a woman.\n\" Thereafter indignant Lord Shiva at once left the meeting alongwith his followers.\n But still Daksh didn't put the matter at rest.\n To behumble Lord Shiva,he organised a grand yagya named Barhaspati.\n All the Brahmarishis, devarishis, pitars, gods etc.\n attended the yagya alongwith their wives.\n From her abode on Kailash, Sati saw all the gods going through air to the grand occasion.\n She also learned about the grand yagya organised by her father Daksh.\n Out of curiosity, she insisted her husband Lord Lord Shiva, \"O Vamdev, your father-in-law, Daksh Prajapati has organised a grand feast.\n If you wish, should we also go there to attend the feast.\n I desire to see my beloved mother, sisters, and other relatives.\n\" Lord Shiva replied! \"O beautiful, though one may go without invitation to his parents' home, may visit teachers and siblings.\n But your father resents me.\n So it is not good if we go there uninvited.\n I will not tolerate if he humiliates you.\n So, you should not go there, because a humiliation by a near one may cause immediate death.\n' In fact, Sati had a logical mind, while Lord Shiva gave more weightage to faith than logic.\n Sati even had a doubt regarding God's incarnation as Lord Rama, that how could Parbrahma Parmatma, who is the father of all, be a son of any human being.\n Moreover, how could the Supreme Being be in so much sorrow because of his wife's separation.\n Lord Shiva and Sati, therefore, had a sight of Lord Rama in exile.\n Lord Shiva silently saluted Lord Rama's appearance, while Sati decided to give Rama a test.\n So taking a guise of Sita, Sati appeared before Rama.\n Lord Rama knew everything so he regarded her as Sati.\n He also showed her some of His glories.\n Now Sati had firm belief in Lord Rama.\n She returned to Lord Shiva and gave her verdict that Lord Rama was indeed an incarnation of supreme Being.\n But Lord Shiva was much disturbed by Sati because of her taking the guise of Sita.\n Lord Shiva had, therefore, acquired an indifferent stance towards Sati.\n Thus she was feeling anguished by Lord Shiva's behaviour.\n Hence she prayed silently:\n 'O Lord, may my body be destroyed soon, as this body is not able to serve Lord Shiva' Hence, when she heard about the grand feast organised by her father, in abject violation of her husband's dictate, Sati got ready to attend the feast.\n Lord Shiva too sent her with a lot of gifts and servants.\n There at Daksh's palace Sati found that all were ignoring her because of her father's fear.\nEven her sisters laughed at her for coming alone.\n In all, Sati found nothing favourable in her father's home.\n Only her mother welcomed her that too in isolation.\n Indignant, Sati went straight to the Yagya Mandap (canopy for performing oblation) and found that no seat had been allotted there for Lord Shiva.\n With anger she said;\n 'Even the mere name of Lord Shiva is enough to destroy all the sins of the humans.\n No one can violate His dictate.\n And you, O father, feel jealous of such an auspicious figure, holy, Lord Lord Shiva, who is soul of every living being.\n I am ashamed of having this body produced from an opponent of Lord Shiva, like you.\n' Saying these words, Sati threw herself in the flames of Yagyagni(the fire of the Yagya) Thereafter, Lord Shiva's ganas (servers) destroyed the Yagya.\n They beheaded Daksh and dropped his head in the altar.\n Other gods and the sages were also punished for showing disrespect for Lord Shiva.\n Ultimately, Lord Brahma, accompanied by the gods, went to Kailash and pacified Lord Lord Shiva.\n Ashutosh Lord Shiva granted them a boon to carry the Yagya to completion.\n In her next birth, Sati was born in the home of Himalayas.\n She was named as Parvati.\n Sober, cool, and an idol of faith, Mata Parvati dedicated herself fully to Lord Lord Shiva.\n Narad gave her a talisman to get Lord Shiva as her husband.\n Lord Narayan himself requested Lord Shiva to accept Parvati as his wife.\n Lord Shiva accepted to get married with Parvati.\n Thus, through hard penance, Mata Parvati got Lord Shiva as her husband.\n In due course the auspicious marriage of Mata Parvati with Lord Shiva took place. ", "next": "16.4.3", "prev": "16.4.1", "title": "Misbehavior of Dakshaprajapati with Lord Shiva"}