{"index": "16.4.4", "image": "resized_images/Tale of Prithu.png", "text": " In the lineage of the king Dhruv, had occurred a king named Anga.\n Anga's wife was Sumita, who was the daughter of Mrityadev.\n They had a son named Ven who was evil in nature.\n When he grew up and occupied the throne, he became a very cruel ruler.\n Day by day his atrocites increased.\n Then he began to openly insult the greatmen.\n When his atrocities became uncontrollable, sages killed him by their curse to salve the people.\n Thereafter, the sages churned Ven's dead body and produced a couple- a man and a woman.\n The man was born by the world-preserving part of Lord Vishnu.\n He came to be known as Prithu.\n He got an extremely pretty wife Archi.\n Prithu was the Acharya (master) of Lord Archan Bhakti.\n With his occupying the throne, the subjects became religious, happy and moral-abiding people.\n Everything was going well in his kingdom, when one day the farmers approached him and complained, \"O king, the earth has grown rude.\n She does not give us cereals, even though we sow a lot of seeds in every season.\n She eats them all.\n\" King Prithu set out at once to chastise the earth who ran in the form of a cow to save herself.\n Scolding at her king Prithu said, \"O Vasudhu (earth) I will kill you.\n You have violated my rule.\n\" The earth then came to his shelter and begged for pardon.\n \" O king it is not my fault my fertility has ended because of the sins of the king Ven.\n Now, I'm present before you in the form of a cow.\n Now, you please exploit me fully to make everybody happy.\n\" King Prithu resolved then and there to perform a hundred Ashvmedh Yagyas.\n His ninety-nine Yagyas completed unabatedly.\n But during the hundredth Yagya, Indra kidnapped the horse deceitfully.\n Indra had himself performed one- hundred Ashvmedh Yagyas.\n He could not tolerate anybody equaling him, for then the performer would have equal claim on Indraasana (the seat of Indra.\n) Prithu's son was Vijitashva.\n He had seen Indra stealing the horse deceitfully.\n He even chased Indra for some distance, but Indra transformed himself into a hermit.\n Somehow, the oblation completed, and God appeared and asked the king to seek a Boon.\n King Prithu begged, \" O Lord, my soul remains unsatiated by your tales.\n So if you are pleased with me, kindly give me a hearing equal to the hearings of ten thousand ears.\n\" Sanakadiks preached knowledge to the king Prithu.\n Thereafter, fostering his subjects religiously, king Prithu ruled the earth for thousand years.\n During the rule, king's popularity spread in leaps and bounds.\n At last he got the supreme position of god.\n\" Thus narrating the tale of Prithu, Maitrey says to Vidur:\n 'those who listen to this tale of Prithu, that shows the glory of God, get a strong affection for God and receive salvation ultimately, like Prithu.' ", "next": "16.4.5", "prev": "16.4.3", "title": "Tale of Prithu"}