{"index": "16.4.5", "image": "resized_images/Fable of Puranjan.png", "text": [" King Prithu's son was Vijitashu.", " In his lineage later on occurred a king named Prachin Barhi.", " King Prachin Barhi had many sons.", " All of them were known as Prachetas, they were all devotees of God and had been sunk in devotion since their childhood.", " Pleased by their devotion once Lord Shiva appeared before them.", " With simplicity, Prachetas asked, \" O Lord of the lords, we have been worshipping Narayana, how did you arrive before us?", "\" Lord Shiva said, \" Those who have devotion for Narayan, are also dear to me.", "\" Thereafter Lord Shiva gave them Rudra Geet which the Prachetas continued to sing for years immersed in the water.", " King Prachinbarhi had a great interest in oblations that involved sacrifice.", " One- day devarshi Narad asked him, \"What are you doing, O king?", "\" Miseries don't end by action alone, nor does one get supreme joy.", " The animals which you have sacrificed for your oblations also feel the pain given by you.", " They are all waiting for you in the heaven.", " When you go there after death they will take revenge one by one.", "\" Frightened by these words, King Prachinbarhi took shelter at Narad and said, \" Devarshi, my mind is caught in the actions.", " You kindly show me the way to the supreme salvation.", "\" At the request of the king, Narad narrated him the tale of Vigyat and Avigyat.", " At the behest of Avigyat, Vigyat migrated to and settled in a beautiful city.", " There he met the queen Puranjani and got married to her.", " He was so much indulged in sensual pleasures with Puranjani that he became a woman in the next birth.", " As a woman, Vigyat got married in due course, but was widowed soon.", " She wanted to commit Sati (self-immolation) but people prevented her.", " One-day she was travelling on an elephant, when she spotted some swans in the sky.", " She asked the mahout to look at them.", " As soon as the mahout's attention diverted, the elephant got out of control and both of them fell on the ground and died.", " As she was looking at the swans at her last time, she became a swan in her next birth.", " As a swan she reached the lake Manasarovar, where she met her old friend Avigyat who consoled the swan.", " \"You are neither a man nor a woman, We are both swans now.", " You are same as me, no different from me.", " It means that there is no difference between the living beings and the God.", " There is only one soul.", " It's because of non-knowledge that one sees the God and the living beings differently.", "\" Thus cautioned by his friend Avigyat, Vigyat realized and accepted his incarnation as a swan.", " But, the king Prachinbarhi didn't get the meaning of the spiritual tale.", " Narad then revealed.", " \"God is Avigyat while microcosm is Vigyat.", " Avigyat has established eighty-four lakhs cities and asked Vigyat to select any one of them.", " After sorting lakhs of cities the microcosm selects a city like the human body.", " That city has a lake in the center-the belly from where the whole city is controlled.", " Again it has nine gates-two eyes, two nostrils, one mouth, two ears, one reproductive organ and one anus.", " It is such a highway, treading which no one returns.", " It has two courtiers- mind and ego.", " The living being passes his life caught between them.", " Queen Puranjani is the intellect in this body.", " Because of this intellect or non- knowledge the living being or microcosm begins to feel in terms of 'I', 'My' and 'Me' for his body and organs.", " All the ten organs are his friends, through which the living being experiences the sensation and performs action.", " Inclinations of the organs are his friends.", " All the five Pranas (breaths) are the five-hooded serpent that guards the body.", " Old age is Kaal Kanya who launches an attack on the city (human body).", " Shoka and Moha (sorrow and attachment) are the two brothers of Kaal Kanya.", " Kaal Kanya is married to Chandveg who is also known as Varsh (year).", " It has three hundered and sixty Gandharvas (the days of the year).", " Twelve months are his twelve commanders and seven days are the ministers.", " They all together plunder the human body like the city of Puranjan.", " Thus, covered by Agyan (non-knowledge), the living being, which has a great pride on his body, virtually wastes his life suffering different kinds of pains.", " From this mystical preaching Prachinbarhis inclination for Vedic Karmkands (action) and temptation for mundane luxuries were removed.", " By the grace of Devarshi Narad, the king got a perception of God and living being.", " He at once abdicated his attachment for the body and concentrated his mind in God. "], "next": "16.5", "prev": "16.4.4", "title": "Fable of Puranjan"}