{"index": "16.5.2", "image": "resized_images/Tale of Bharat.png", "text": " Rishabhdev was married to Jayanti, the daughter of Indra. Jayanti gave birth to one hundred sons. Bharat was the eldest among them. The youngest nine sons became Yogeshwars. Eighty-one sons accepted Brahaminism. Remaining nine brothers followed their elder brother Bharat. One day Rishabhdev called a meeting of his sons and preached them about the well being of human beings. \"Sons\" he said, \"Never misuse this human body. You have got this human life by great luck and God's grace. He does not deserve to be called as a friend, teacher or father who does not preach his friend, disciple or son about the welfare of the self.\" Preaching that Rishabhdev enthroned Bharat and himself departed for his supreme abode. The king Bharat was a great devotee. By his father's permission he had married to Panchjam, the daughter of Vishurupa. They begot five sons. Bharat dedicated his religious actions to Lord Vasudev. Thus by the purification of his actions, his conscience was also purified. So he transferred the kingdom to his son and himself took an abode in Pulahashram (hermitage of Pulah) on the banks of the river Gandaki. There he passed his time in the worship of God. One fine morning, when he was performing libations in the river, a pregnant Doe arrived on the opposite bank to drink water. At that time a lion roared somewhere in the forest behind her. Frightened by the roar, the doe jumped into the river to save her life. But the doe lost her life in the action while her foetus fell in the river. Feeling pity for the fawn, Rajarshi Bharat took it and began to foster it. Day by day Bharat's affection grew for the fawn. Slowly he became irregular in his daily routine. But Bharat loved the fawn more than his routine. When the fawn grew into a deer, by its natural instinct it joined its mates. On his return, Bharat did not find the deer and grew so restless that he died out of depression. As his mind was fixed on the deer at death, he was born in his next birth as a deer. Bharat was a prudent man. But affection did not spare even him. What would be the fate of common people then? They are easy targets of the feelings and are more vulnerable to fall prey to attachment and affection. When a derangement occurs in the intellect of man, he begins to conduct irreligiously, but thinks that his behaviour is religious. Realizing his mistake, Bharat as a deer, came to his hermitage and once again began his penance before God. Even in deer incarnation Bharat had a strong feeling of detachment. When Bharat's deer incarnation ended, he took his next birth in a Brahmin's home. Sometime after the birth, his mother died. By God's grace Bharat had remembrance of his previous birth. So he always remained immersed in reflection on Hari (God.).To avoid attention he posed himself as an insane stupid, blind and deaf person. Even his brothers neglected him seeing his inertia. Now he was free to wander at will. He was satisfied with what he got and doing menial jobs. During that period, a thief, who had no son, wanted to offer a human-sacrifice to Bhadrakali in desire of a son. Searching a right person for the sacrifice, his men found and caught Jadabharat (In Brahmin incarnation, Bharat was known by this name because of his inactivity), who was guarding his farms then. Jada Bharat remained quite indifferent and did not even resist his kidnapping. The thieves took him into the temple. There as soon as the chief of the thieves raised his sword to kill Jada Bharat, Bhadrakali appeared from the idol and beheaded all the thieves. It shows that one has to bear the fruit himself of the crime committed. But Jada Bharat did not experience this and remained quite unmoved as before. In another incidence, the king Rahugana of Sindhu was riding a palanquin to the hermitage of the sage Kapil. On the way, he fell short for one Kahar(carrier of the palanquin). His men found Jada Bharat who was wandering nearby and yoked him also in carrying the palanquin. Jada Bharat was walking cautiously so as not to tread on even little creatures. Hence, the king was getting jerks and a bumpy ride. He scolded at the Kahars. The Kahars informed him that the new recruit was causing him those jerks. The king Rahungana then scolded at Jada Bharat. \"Hey, are you so frail that you can't balance the palanquin properly. Don't you know that your master is riding in it? Wait, I'll teach you a lesson.\" Jada Bharat stood fearlessly. The king was stunned to see him. It was then that Jada Bharat opened his mouth to utter is first words. He felt that he had carried the king on his shoulders, and though the king was a haughty man, '...but my life will be a sheer wastage if I don't preach the king a way to salvation...' So with a desire of benefiting the king Jada Bharat said, \" O king, life and death, strength and weakness are the virtues of the body. But the soul is sinless. I have put all my burden on the shoulders of the God. You too have great burden on your head. Lord of everyone is one. Even your senses are not in your control how then will you control your subjects? O king only knowledge is the form of the soul. By knowledge alone you can recognize the soul. Union with one homogenous and holy Supreme Being is the true introspection. But as long as you don't bear the dust of great men's feet on your head, you will not recognize the God. Hearing these words, the king Rahungana fell at the feet of Jada Bharat and begged his pardon. Jada Bharat then preached the king about the metaphysical knowledge. \"Listening to the tales of the God continuously is the only way to concentrate one's mind in Shri Hari. In my previous birth. I was the king of Bharatvarsh. But because of my attachment for a deer, I was deviated from the path of supreme knowledge. Hence, I had to take birth in deer form. But by the grace of Lord Krishna, memory of my previous birth persisted in a deer incarnation also. So in my present birth I prefer to stay away from the people and wander secretly. So, from now on drop your attachments and start reciting God's name. By the virtues of His tale alone you will easily get Him. O King, the body is like a merchant, who is roaming on the earth borrowing this wealth of age. It has lost its wealth in useless worldly affairs. One-day arrow of the Kaal will snatch everything from it. So, the human being must utilise their invaluable moments in the training of the supreme knowledge.\" ", "next": "16.5.3", "prev": "16.5.1", "title": "Tale of Bharat"}