{"index": "16.5.1", "image": "resized_images/Tale of Priyvrata.png", "text": " Hearing the tale of Prachetas' devotion and receiving God's grace by them, a curiosity arose in the mind of the king Parikshit about self-knowledge and Grihasth Dharm (duties of a married person). He asked Shukdev, \"O Brahmin, Priyvrat was a supreme devotee and self-indulgent. Why did he then live in Grihasthi (married life)? Married life is binding from all sides. Greatmen never long for married life. Even then the king Priyurata lived a married life yet he regularly prayed to God. This is an intriguing subject for me, kindly remove my doubts. Seeing Parikshit's curiosity and doubts, Shri Shukdev said, \"O king you are right that once receiving God's grace one can't leave it. No attachment, no love remains in him for life. The prince Priyurata was a great devotee of God (Bhagwad Bhakt). By the grace of Narad he had instinctively become aware of Parmarth tatva (knowledge that leads to salvation). He had dedicated all his actions into the feet of Lord Vasudev. Thus, an intense inclination for detachment developed in Priyvrata since his childhood. So, Lord Brahma tried to admonish him. \"Son, you are too young yet to be an ascetic. Since the moment you've acquired the human body, enemies like Kama (sex), Krodh (anger) Moha (affection), Lobh (greed), Mada (ego), Matsar (jealousy) etc. have been continuously chasing it. We're all bound to follow the path laid down by God. We should serve Him by our action, accepting our body, which the God has given to us and the merits associated with it. Hence, you first enjoy the luxuries given by God, thereafter you will be free to do what you wish.\" Thus, as per the dictate of Lord Brahma, the king Priyvrata accepted two wives. His first wife was Prajapati Vishwkarma's daughter Barhismati. She begot ten sons- Agnidhra, Idhmjihv, Yagyabahu, Mahavir, Miranyreta, Savan, Medhatithi, Dhriprishth, Vitihotra and Kavi. Priyvrat's second wife begot three sons- Uttam, Raiwat and Tamas. Out of these ten sons, three became celibate. All the three sons from the second wife became the lords of different Manvantaras. Despite leading married life, the king remained an ascetic. In his chariot, he travelled around the land and divided it into seven parts and appointed each of his seven sons as the lord of one island. Agnidhra, the eldest son was given Jambu Dweep. He was married to an elf Purvchitti. She had begotten nine sons who became the ruler of the nine parts of Jambu Dweep. Merudevi was the wife of Agnidhra's eldest son Nabhi. As a gift of Yagya, Lord had taken an incarnation in his home. That incarnation of Lord is known as Rishabhdev. ", "next": "16.5.2", "prev": "16.5", "title": "Tale of Priyvrata"}