{"index": "16.5.3", "image": "resized_images/Description of the Extent of the Landmass.png", "text": " Hearing the tale of the king Priyvrat's lineage, Parikshit asked Shukdev: \"O great sage, what is the expanse of the landmass? I wish to hear a description of it alongwith it's islands, because this world is a tangible idol of God alongwith his virtues. Hence, knowing it intangible, infinitesimal form of God can also be known.' Shukdev said: 'O King, illusions created by God are so vast that nobody can find their end. Therefore, I will describe main features of the world with the help of name, appearance, extent and symptoms. King Priyvrata has divided the earth into seven islands. These islands are: (1)Jambudweep, (2)Plukshdweep, (3)Shalmalidweep(4)Kushdweep, (5)Kronchdweep, (6)Shakdweep and (7)Pushkardweep. All these islands are surrounded by seven seas, which comprise of saline water, sugarcane juices, and wine, ghee, milk, whay and sweet water respectively. Extent of each island is double than that of it's preceding one. Jambudweep: - Shukdev says, 'Situated in the centre of the world is Jambudweep. It has an extent of one lakh Yojan. It has a round shape like a lotus leaf. It has nine zones each with an extent of nine thousand Yojan. These zones are called Varsh. Eight mountain ranges mark the boundaries of these Varsh which are arranged in circular fashion. At the centre of the Varsh, is the tenth Varsh named Illavrit. In the center of Illavrit is Meru. Names of other nine Varsh are - Kinpurush, Harivarsh, Kamyak, Hiranmaya, Kuru, Bhadrashwa, Ketumal and Bharat. Such as the mount Meru is surrounded by Jamudweep, similarly Jamudweep is surrounded by a vast sea. Because of a majority of Jamun (black berry) trees, this island is named as Jambudweep. Plukshdweep: - As there is a huge Jamun (black berry) tree that is eleven hundred Yojan high in Jambhudweep, similarly there are innumerable Pluksh (Pakur-Ficus pinctoria) trees in Plukshdweep hence it's name. Agni (fire) is the venerable God in this island. Priyvrata's son, King Idhmjihv was the ruler of this island. He divided it into seven parts and made his seven sons the ruler of these divisions. These seven divisions were named- Shiv, Yavas, Subhadra, Shant, Kshem, Amrit and Abhay. These divisions have seven mountains, and seven rivers. Plukshdweep has an extent of two lakh Yojans. It is surrounded by an ocean of sugarcane juice. Shalmalidweep: - Just double in extent than Plukshddweep, is Shalmalidweep. It has a majority of Shalmali (silk cotton) trees, which comprise the abode of Garud, the King of the birds. Priyvrata's son Yagyabahu was the ruler of this island. He too made seven divisions in the island as per his sons- Surocham, Devvarsh, Paribhadra, Ramanak, Saumanasya, Apyayan and Avigyat. This island too has seven mountains and seven rivers. Four classes of people inhabite this island. They worship Vedmay Chandrama (the moon with vedas) This island is surrounded by a sea of wine. Kushdweep: - This island is surrounded by a sea of the Ghee. It has an extent of eight Yojans, and a majority of Kush shrubs. From the light of their tips, Kush shrubs illuminate this island. Priyvrata's son Hiranyarata was the ruler of this island. Dividing the island into seven divisions, he too appointed his seven sons as the ruler of each of these divisions. These divisions are- Vasu, Vasuddana, Drirhruchi, Nabhigupta, Stutyavrata, Vivikt and Vamaddev. People of Kushdweep worship the fire. Kraunchdweep: - With an extent of sixteen lakh Yojan, Kraunchdweep is surrounded by the sea of milk. There is a gigantic mountain named Kraunch on the dweep. After this mountain the island is known as Kraunchdweep. Priyvrata's son, King Ghritprishtha was the ruler of this island. He too divided the island into seven divisions and distributed them between his seven sons, one to each son. The names of these seven sons are- Aam, Madhuruh, Meghprishth, Sudhama, Mrajishth, Lohitarn and Vanaspati. Inhabitants of the island worship Varundev (Neptune) the lord of water. Shakadweep: - Surrounded by the sea of whey is Shakadweep with an extent of thirty-two lakh Yojans. It has a huge tree of Shaka, hence its name. With a sweet fragrance of this tree, the whole island emits a pleasant scent. The ruler of this island, Medhatithi was also a son of Priyvrata. He too had seven sons- Purojav, Manojav, Pawamana, Dhumranik, Chitraref, Bahurup and Vishwdhar. They were made the rulers of the seven divisions of the island. People of the island use Pranayama to weaken their Rajoguna and Tamoguna, and worship Hari (Vishnu) in Vayu(form) through meditation. Pushkardweep: - Pushkardweep has an extent of sixty-four Yojans. It is surrounded by a sea of sweet water. There is present a huge lotus flower with a million, golden petals. This lotus is regarded as a seat of Brahma. Priyvrata's son Vitihotra was the ruler of this island. He divided the island into two divisions, and made his sons Ramanak and Dhataki the rulers of these divisions. Inhabitants of this island worship Brahma appearance of Shrihari (Vishnu). ", "next": "16.6", "prev": "16.5.2", "title": "Description of the Extent of the Landmass"}