{"index": "16.6.1", "image": "resized_images/Tale of Ajamil.png", "text": " The king Parikshit requested Shukdev, \"O preacher, so far you have related about the way how to overcome attachment for wordily things. Inadvertently, the lliving beings commit some kinds of sins or crimes. O great soul, now kindly tell me the way by which humans can get rid themselves of the tortures, they are supposed to be subjected to in the hells.\" Shukdev said, \"A sinner is sure to be tortured in hell, unless and until he had observed penance for his sins in his present birth. But even penance is no guarantee of his salvation if the person indulges again in sins thereafter. It is all because of ignorance, that desires to commit sin does not end. Spiritual ways are, thereafter necessary. Adopting spiritual ways like penance, celibacy, tranquility, self-restraint, abdication, truthfulness, holiness, restraint of passions and discipline, even the most serious sins are destroyed. Alternatively, taking refuge at the God or developing a devotion for Him, all the sins can be destroyed. O Parikshit, such a sanctification of the sinner as achieved by dedication to God, is rare even by observing penance.\" Shukdev narrated the tale that was once related by Muni Agastya. In the town of Kannauj, lived a Brahmin named Ajamil. He had married to his mistress. Being with an unchaste woman his Brahminical virtues had been destroyed. Now, Ajamil earned his living not by performing holy tasks, but instead he restored to petty tricks like plundering, deceiving and even killing people to feed his family. Once, a group of Mahatmas(ascetics)came to the town. People greeted and offered them with edible items. But,the ascetics refused to accept anything. They said that they would accept the food only from the household where holy food is cooked for the Lord. Irritated people showed the ascetics the way to Ajamil's home. From Ajamil, the ascetics accepted the alms and themselves cooked the food, and offered it to God and ate themselves. Now the heart of Ajamil and his wife were filled with expiation. The ascetics wished to cause some benefit for Ajamil. They said to him, \"If you get a son now, please name him Narayana. Ascetics words did materialize and Ajamil got one more son, the tenth one. As per ascetics advice, Ajamil named him Narayana. Being the youngest son, Narayana was very dear to Ajamil. He used to remember Narayana always. Everything was passing as usual, when the time of Ajamil's departure arrived suddenly one day. Yamadutas (agents of Yama-the God of death) began to take him for his last journey. Not seeing his youngest son Narayana before him, Ajamil began to call out loudly: 'Narayana- Narayana.' Hearing the calls, servers of Lord Vishnu too arrived their and challenged Yamadutas. The frightened Yamadutas said, \" We are the servants of Dharmraj. Why are you stopping us?\" Servers of Lord Vishnu said, \"If you are the servants of Dharmaraj define Dharma (religion) then.\" Yamadutas said, \"Actions dictated by Vedas are Dharma (religion) in true sense, and the actions forbidden by Vedas are Adharma (irreligious) and Veda is Narayana Himself.\" The servers said, \"You're unaware of Param Dharma (Supreme religion). This sinner has called out the name of God, so his sins, from the past crores of births, have been washed away. Now he is no more a sinner. Wise men say that recitation of God's name by any means- as a name of someone else, in derision or derogation- automatically does away with all the sins. This is the bounty of God's name that a mere remembrance of it- whether wittingly or unwittingly, does destroy all sins.\" Hearing this dialogue, Ajamil awakened, as if from a long slumber. Yamdutas had returned to Yamaloka by then. But, the abject sinner Ajamil had recovered from the snare of death. Without losing a moment, Ajamil went to the banks of the Ganges. There, drinking the holy water of the Ganges he left his body and went and found a place in Vaikunth Loka-the abode of Lord Vishnu. ", "next": "16.6.2", "prev": "16.6", "title": "Tale of Ajamil"}