{"index": "16.6.3", "image": "resized_images/Birth of Daksh from Prachetas.png", "text": " Shukdev says, \"Ten sons of the King Prachinbarhi were known as Prachetas.\n They observed severe penance under the sea.\n When they re-emerged, Chandra (the moon-the ruler of the vegetation) calmed them and presented a beautiful daughter of the elf Prabhlocha, to them as their wife.\n From her, Prachetas begot prachetas Daksh.\n In due course the subject of Daksh spread all over the world and populated far off places.\n Daksh created, first of all the gods, the demons and the human beings who inhabited the heaven, the earth and the waters respectively.\n But Daksh was not still satisfied.\n He therefore went to Vinddhyachal and started a severe penance there.\n Pleased by his penance God appeared before him.\n By the permission of God, Daksh Prajapati married with Ashinki the daughter of Panchama Prajapati.\n From Ashinki Daksh got ten thousand sons named Haryashva.\n In due course Daksh asked his sons to reproduce.\n But instead of reproducing they all reached Narayana Sarovar on the banks of the river Sindhu (Indus) to a place of Pilgrimage.\n Besalved by the preaching of Narad about Bhagwad Dharma.\n Daksh again produced one thousand sons named Shavlashva and asked them to reproduce.\n But they too followed the footsteps of their elder brothers, and took no interest in worldly affairs.\n Narad preached them also about Bhagwad Dharma.\n When Daksh came to realize that Narad had converted his sons into ascetics by his preaching he angrily cursed Narad to be a wanderer for ever with nowhere a place to stay on.\n Narad accepted Daksha's curse and blessed him with a boon to have sixty daughters for the continuation of his subject.\n By the virtue of the boon, sixty daughters were born in the home of Daksh in due course.\n When they grew up, Daksh got ten of them married to Dharma.\n Then ten to Kashyap, twenty-seven to Chandrama, two to Angira and Krishashva each and remaining four daughters were married to a Kashyap named Tarkshya.\n The entire world came to be populated by the offsprings of these sixty daughters of Daksh.\n Shukdev says, \"Parikshit the names of Dharma's ten wives were Bhanu, Lamba, Kakubhi, Jami, Vishwas, Sadhya, Marutvati, Vasu, Muhurta and Sankalpa.\n Daksh's daughters Sarupa and Bhoota were the wives of Bhoot.\n Sarupa begot uncountable Rudragans, eleven of them are prominent.\n Bhoot's second wife Bhoota gave birth to formidable spooks and Ganas like Vinayak etc.\n Angira's first wife Swadha gave birth to pitragans while his second wife Sati accepted a Ved- Atharvanigra as her son.\n Krishashva's wife Archi begot Dhumrakesh, while Dhishana- Krishashva's second wife gave birth to four sons-Vedshira, Deval, Vayun and Manu.\n Kashyap named Tarkshya had four wives- Vinata, Kadru, Patangi and Yamini.\n Birds were born to Patangi, while Yamini gave birth to moths.\n Vinata's son is Garuda who is the vehicle of Lord Vishnu.\n Arun was her second son who became the charioteer of surya.\n Nagas (snakes) were born to Kadru.\n Twenty-seven daughters of Daksh were married to Chandrama (the moon).\n These are the twenty-seven Nakshatras like Kritika etc.\n But Chandrama had particular love for Rohini, so he got tuberculosis and hence could not produce a child.\n Names of Kashyap's thirteen wives are Aditi, Diti, Danu, Kashtha, Ariha, Surasa, Illa, Muni, Krodh, Varsha, Tamra, Surabhi, Sarama and Timi.\n These are the mothers of the whole world.\n All the gods, demons, animals, giants etc. were born to them. ", "next": "16.6.4", "prev": "16.6.2", "title": "Birth of Daksh from Prachetas"}