{"index": "16.6.4", "image": "resized_images/Insult of Brhaspati by the Gods.png", "text": " Shukdev says, \"O Parikshit, Indra had become very haughty by the luxuries he received as the king of the gods.\n One day, Devraj Indra was sitting on his throne alongwith his queen Shachi.\n His court was full of courtiers.\n Forty-nine Marudganas, eight Vasus, eleven Rudras, Aditya, Ribhuganas Vishvedev, Shadhyaganas and both Ashwini Kumaras were present in the court.\n Groups of Siddhas, Charaus, Gandhavas, Vidyadhars, elves, Kinnars, Nagas etc.\n were singing in his praise and program of dance and music was on.\n Acharya Brihaspati, the revered teacher of the gods arrived there.\n But, despite having seen him, Indra did not show any respect for Brihaspati.\n Indignant Brihaspati he at once deserted Devaloka (the abode of the gods.\n) When Acharya Brihaspati had gone, Indra realized his mistake.\n He at once launched an extensive search for Guru Brihaspati.\n But no one could locate Brihaspati.\n Feeling of insecurity in the absence of their Guru, strongly agitated the gods.\n On the other hand, when the demons came to know about Brihaspati's missing, they began to intimidate the gods.\n By the permission of their teacher Shukracharya, the demons launched an attack on the Devloka.\n Feeling sad by the pitiable state of the gods.\n Indra went to the refuge of the Brahma who told the gods that they were suffering because of their wrong policies and disregarding their learned Guru.\n Brahma also told the gods that the demons had strengthened their position because of their loyalty to their teacher Shukarcharya.\n Brahma advised the gods to request Vishwarup, the son of the sage Tvashta, to become their teacher.\n \"He is a sound scholar of Vedas, great ascetic and abstentious person.\n\" \"Serving him,\" Brahma said, \"You will be free from all the crisis.\n\" Following Brahma's advice, the gods made Vishwarup their teacher by request.\n Ascetic Vishwarup used his Vaishnavi Vidya to annihilate the wealth and power of the demons and endowed Indra, with those powers.\n Vishwarup also preached Indra about the infallible Vaishnavi Vidya.\n Thus securing himself under the shield of this knowledge Indra defeated all the demonic forces. ", "next": "16.6.5", "prev": "16.6.3", "title": "Insult of Brhaspati by the Gods"}