{"index": "16.6.5", "image": "resized_images/Preaching of Narayana Kavach (shield) to Indra by Vishvarup.png", "text": " The king Parikshit asked, \" O Lord, kindly relate to me the knowledge (Vaishnavi Vidya) by the power of which Devraj Indra easily defeated the demons.\" Shukdev says, \" Parikshit now I am telling you about the knowledge that was once taught to Indra by Vishwrup. So listen to it carefully with concentration. Whenever you feel yourself haunted with fears, you must guard you body with this Narayana Kavach (shield). But before that it is necessary to purify oneself by bath, meditation, libations, Pranayama (control of breaths) and eight-lettered and twelve-lettered mantras of God. The Hymnal Kavach (shield) must be then recited facing north while reflecting on the divine appearances of God. May the God, who rides Guruda and holds conch, wheel, mace and lotus, protect me from all sides. May all the incarnations of God protect me from all the lusts, affection and desires and in all the circumstances. Thus may I be protected in water by Matsyavatar, on land by Vamanavatar, in sky by Trivikrama, from Kamapida (sexual desire)by Sanakadit, from Kupathya (diseases) by Dhanvantri, from ignorance from Vedvyas, from the hells by Kachchhap avatar (tortoise incarnation), in the war by Narsinha Avatar, in the way by Varah, on the top of the hills by Parashurama, during exile by Lord Rama along with Lakshmanaji, from Maranmohan Abhichar (death) by Lord Narayana, from ego by Nara, from obstacles by Dattatreya, from the bondage of actions by Kapila, from disregarding the God by Haygreev Mutri, from the crimes by Narad, from the imposters by Buddha and from the faults of Kali Kaal may I be protected by Kalkidev. May I be protected in the morning with mace by Keshav, with flute by govind in the day, by Narayana Shakti before the noon and may I be protected with Sudarshan chakra by Lord Vishnu in the noon time. May the all knowing omnipotent Lord protect me in every circumstances. May the name, appearance, vehicle, weapons, and all the services of Shri Hari protect my mind, intellect, organs and life from all the calamities. This Narayana Kavach (shield) saves one from all kind of calamities and fears. ", "next": "16.6.6", "prev": "16.6.4", "title": "Preaching of Narayana Kavach (shield) to Indra by Vishvarup"}