{"index": "16.6.6", "image": "resized_images/Killing of Vishvarup, Defeat of the Gods and Construction of Vajra with the bones of Dadhichi.png", "text": " Vishrupa became the second Acharya (teacher) of the gods. He also saw over indulgence of Indra in luscious objects. Vishwarup's mother belonged to demon clan, so he had some inclination for the demons also. Stealthily, he supplied parts of offerings of the oblations to the demons. Very soon, Indra too came to learn that their teacher Vishvarup was stealthy nurturing their enemies, the demons. So, indignantly Indra severed the head of Vishvarup and to get rid of the sin of Brahmahatya (killing of Brahmin) Indra distributed his sin among the land, water, tree and the woman folk, and himself escaped the sin. To take revenge of his son's murder, sage Tvashta organized a yagya with the purpose of having a son who could kill Indra. The Yagya finished successfully and as soon as the offering's ended, a formidable demon appeared from the altar. The demon was named Vritrasur. Very soon, Vritrasur defeated Indra and other gods and conquered all the three worlds. Terrorized by his power and gallantry, all the gods ran into the refuge of Lord Narayana. Pleased with their faith and prayers, Lord Narayana advised them to please the great sage Dadhichi and ask for his bones to build a Vajra (mace). From that Vajra Vritrasur could be killed, God assured them. Thus, all the gods, headed by Indra, reached the hermitage of sage Dadhichi. There they very humbly and respectfully begged for his bones. For the benefit of the world, sage Dadhichi gladly accepted to donate his bones. With those bones, Vishvakarma built a massive Vajra which had thousand edges. Thus by the power of the Lord and aquiring a divine Vajra, Indra felt extremely strong. He at once launched an attack on the demon's armies and drove them away from the battlefield. ", "next": "16.6.7", "prev": "16.6.5", "title": "Killing of Vishvarup, Defeat of the Gods and Construction of Vajra with the bones of Dadhichi"}