{"index": "16.6.7", "image": "resized_images/Killings of Vritrasur by Indra.png", "text": [" Shri Shukdev says, \"O Parikshit, from the gallantry of the gods the demon army began to fled.", " Seeing his army running away in panic, Vritrasur got infuriated.", " Charging ahead he stopped the gods' army from advancing.", " He roared loudly.", " Many of the gods fainted from the frightening thunder of the roar.", " Advancing Vritrasur routed the fallen fighters.", " Even the earth began to shake because of his momentum.", " Devaraj Indra could not bear it.", " He made a powerful blow on Vritrasur with his mace.", " Vritrasur held his mace in the way and hit Airavat, Indra's elephant, with it.", " Feeling the pain of the blow, Airavat moved back.", " Then Vritrasur scolded Indra who had killed Vishvarupa the brother of Vritasur, \"O Indra, you have killed my brother Vishvarup without any reason.", " Now, I will gore you with my powerful trident.", " Or you may behead me by your vajra.", " Your vajra has the power of the sage Dadhichi and the glory of Shri Hari.", " But, Indra with you vajra, I will get rid of the bondage's of my body and get salvation at the feet of Lord Vishnu.", " So,kill me with your vajra.", "\" Thus, even in the battlefield, Vritrasur experienced direct existence of God.", " He prayed God! \" O Lord, may my mind reflect constantly on your auspicious virtues, may my voice always recite your virtues, may my body always be in your service.", " I don't want salvation without serving you.", " My mind is writhing for your sight.", "\" Shukdev says, \" Thus, O Parikshit, Vritrasur had wished to leave his body in the battlefield and get the God.", " He did not want to enjoy the luxuries of the heaven defeating Indra.", "\" Calling out these words, Vritrasar hit Indra with trident.", " But Indra cut that hand of Vritrasur, which was holding the trident, by his vajra.", " Losing his one hand Vritrasur was very outrageous and hit Indra's chin and Airavat's forehead with his elbow.", " Because of the blow Indra dropped his vajra, which fell near vritrasur's feet.", " Indra was now feeling too ashamed to pick up the vajra.", " Vritrasur said, \" O Indra, pick up the vajra and kill your enemy.", " It is not the time to be gloomy.", " Indra showed his respect to Vritrasur for his truthfulness and undeceitful words, and said \" O great demon you are really great.", " Your patience, determination and devotion for God are really remarkable.", " You have surmounted the illusion of God that confuses ordinary ones.", " You are a great man born in demon family.", " Vritrasur again raised his wheel to hit, but Indra cut his second hand.", " Now, having lost both his hands, Vritasur shook the earth with his heavy steps and swallowed Indra along with his elephant.", " Everyone was beginning to feel sorry for Indra but because of Narayana Kavach, Indra remained unhurt even in the belly of Vritrasur.", " Thereafter, Indra lacerated the demon's belly and came out.", " Then he cut Vritrasur's head also.", " At that moment, soul of Vritrasur annihilated in the Supreme Being.", " All the gods then greeted Indra for his victory.", " Vritrasur was a religious king Chitraketu in his previous birth.", " Because of the grace of Narad and Angira, he had received detachment and supreme devotion and began to roam everywhere as a Siddhapurush (one who achieves perfection).", " Once he was travelling on the aircraft gifted to him by the gods, he saw the Ardhnarishwar (half male-half female) appearance of Lord Shiva and said something in derogation.", " Indignant of his discourtesy, Mata Parvati cursed Chitraketu to take birth in a demon clan.", " Because of that curse, Chitraketu appeared as demon.", " But even in demon incarnation, his devotion for the Lord's feet persisted as before. "], "next": "16.7", "prev": "16.6.6", "title": "Killings of Vritrasur by Indra"}