{"index": "16.7.4", "image": "resized_images/Sketch of Prahlad, The Great Devotee.png", "text": " Pious virtues of Prahlad: - The youngest son of the demon king Hiranykashipu, Prahlad was very virtuous. He used to serve the sages with love. He treated all the beings equally and did never differentiate them as separate from him. He had a respect for the elders. Despite having knowledge, wealth, beauty, and nobility, Prahlad didn't have any ego. He never lost patience even in most adverse conditions. He also regarded the world as false and worthless. He had no desire for anything, but had full restraint on his mind, organ, breath, and body. Despite having born in demon family, he didn't have any demonic virtues. Narad says: 'O Yudhisthir, as the virtues of the God are endless, similarly the virtues of Prahlad had no limit. But a natural and congenital love for Lord Shri Krishna was his greatest merit. Since his childhood, Prahlad had no inclination for childish plays. Often he used to meditate silently. During his meditation, he used to become quite motionless. More than often he felt as if God himself was fondling him taking him in His lap. At times when he experienced an absence of God, Prahlad would cry loudly, and at other times he would laugh with joy seeing God before him. He also used to sing, shout and even dance whenever he felt God nearby. Occasionally, Prahlad used to mimic God, or feeling the soft touch of God, sit peacefully without movement. Such was the trance like condition of Prahlad who had a complete submersion in devotion for God. Education of Prahlad: Shukracharya was the teacher of the demons. Sukhracharya's two sons had been appointed to teach the boys of the royal family. Staying at a place closer to the royal palace, these two brothers taught the boys in politics, economics etc. Prahlad too was sent to them for formal education. There he used to listen to his teachers carefully and recite what he had been taught. But Prahlad did not like the education, which was based on falsehood. One day Hiranykashipu took Prahlad in his lap and asked lovingly: 'My son, tell me, what you like the most.' Prahlad said: 'Father, in my opinion, this world is nothing but full of sorrow. Hence it is just for every being that they should give up this blind-pit like world and go to the forests and take shelter in God, to be free of miseries.' Alarmed by these words, Hiranykashipu warned the teachers, the sons of Shukracharya, to look after Prahlad well, and to remove that mean thoughts of devotion from his mind. He also cautioned the teachers to guard Prahlad against any possible approach by a god, ascetic or Brahmin. Guruputras (the teacher of Prahlad) tried their best and trained Prahlad in policies of Sama, Dama, Dand, Bhed (conviction, temptation, fear of punishment and partiality.) Then they trained him in Arth, Dharma and Kama (economic matters, religion and carnal knowledge.) When they felt satisfied with their efforts the Guruputras brought Prahald again to his father, the demon king Miranykasipu. Hiranykashipu kissed Prahlad's head and took him in his lap and asked, \"My son Prahlad, tell me in detail what you have learned from your teacher during your stay with them.\" Prahlad said, \"Father there are nine kinds of devotion for Lord Vishnu. If one develops these nine kinds of devotion with dedication, I understand, it would be the best education.\" Infuriated by these words, Hiranykashipu threw Prahlad on the floor and began to scoff at Guruputras. ", "next": "16.7.5", "prev": "16.7.3", "title": "Sketch of Prahlad, The Great Devotee"}