{"index": "16.7.2", "image": "resized_images/Dialogue of Narad – Yudhishthira (Tales of Jay-Vijay).png", "text": [" During the Rajsuya Yagya in Yudhishthir's court, Lord Krishna had beheaded Shishupal with His wheel.", " Everyone, including Yudhishthir saw Shishupal's soul annihilating in Lord Krishna.", " Surprised Yudhishthir had asked Narad then, \" O Devarshi, isn't it surprising that Shishupal who was so jealous of Lord Krishna, got merged in Him?", " Such fortune is even rare for the great Yogis (ascetics).", " How did then this rival of God get such a supreme fortune?", "\" Narad said, \"O king criticism, praise, serving or negligence are all confined to the body only.", " When the soul is identified with the body, people suffer from the impact of scolding and abusing.", " God has no ego like ordinary beings, because He is the supreme soul and ultimate.", " If He punishes someone it is for one's benefit and not for any anger or jealousy.", " Therefore one must concentrate his mind in God no matter what his feelings are- enmity, devotion, fear, affection.", " In God's view these feelings don't make any difference.", "\" Narad said, \" Yudhishthir, in my opinion it is certain that the concentration achieved through a feeling of enmity is rare to achiev otherwise, even with devotion.", " This is the reason why uncountable number of sinners, who had strong enmity for Lord Krishna, merged with Him.", " Your cousins- Shishupal and Dantavkra were fortunate.", " They both were the gatekeepers of the Lord.", " It was by curse of Brahmin, that they had to be relegated and take birth as sinful demons.", "\" Narad said, \"O king, Brahma's Manasputras (sons begotten by thoughts) Sanakadikumars were freely roaming all over the universe.", " Once they reached Vaikunth (the abode of Lord Vishnu).", " But assuming them to be ordinary boys the gatekeepers Jay-Vijay did not allow them in.", " Indignant by the behaviour of the Gatekeepers, Sanakadi Kumars cursed them:", " \"Fools both of you don't deserve a presence near God.", " Both of you are endowed with Rajaguna and Tamoguna (royal and dark virtues), so go and take birth as the demons.", "\" When both the gatekeepers were falling from Vaikunth, the kind Sanakadi Kumars said, \" O.", "K.", " the effect of our curse shall long for your three births only, thereafter you shall return to Vaikunth again.\" "], "next": "16.7.3", "prev": "16.7.1", "title": "Dialogue of Narad – Yudhishthira (Tales of Jay-Vijay)"}