{"index": "16.7.3", "image": "resized_images/Tale of Hiranyaksh and Hiranykashipu.png", "text": [" By the curse of Brahmins, the gatekeepers of the God, Jay-Vijay took their first birth as the demons- Hiranyakashipu and Hiranyaksh.", " Diti was their mother.", " Hiranyaksh had stolen the earth and hidden it in Sutala Loka, causing worries for Brahma.", " To remove the worries of Brahma, Lord appeared as Varahavatar (the boar incarnation) and killed Hiranyaksh.", " After the killing of Hiranyaksh his elder brother Hiraykashipu developed enmity with Lord Vishnu.", " He avowed to other demons:", " \"I will kill that tricky Vishnu with my trident.", " Thus no one will be able to protect the gods.", " All of you go out and bring havoc on them.", "\" Then Hiranykashipu cremated his younger brother Hiranyaksh, condoled mother Aditi and wife of his younger brother and himself went away to observe penance in order to acquire strength and gallantry.", " In the Valley of Mandarachal Mountain, Hiranykashipu stood on one toe only and raised his hands towards sky.", " He continued to stand in the same position.", " Ultimately fire began to emerge from his head.", " That fire caused burning of all the three lokas (worlds.", ") Panicked by the fire the gods reached to Brahma and prayed to put the fire off.", " Brahma at once appeared before Hiranykashipu and said, \"Son Hiranykashipu, your penance is over now.", " Now seek a boon of your wish.", "' Worshipping Brahma, Hiranykashipu said:", " 'May I not be killed by any living being created by you, may I be killed neither in day nor in night, neither by humans nor by animals, neither by weapons nor by arms, neither on earth nor in sky.", " May no one match me in war.", " May I be an undisputed emperor of all the living beings.", "' Pleased by his penance, Brahma granted Hiranykashipu that rare boon.", " By the virtue of Brahma's boon, Hiranykashipu grew extremely strong.", " Now he had no fear of death, so his atrocities increased day by day.", " He defeated all the gods, human beings, demons, demigods.", " Everyone accepted his superiority.", " Now, Hiranykashipu began to reside in heaven itself.", " He also made an all round declaration:", " 'all the people who worship or even remember Vishnu, shall be put to death in my kingdom.", " Nobody else is God except me.", "' Thus all the gods and demons began to worship Hiranykashipu and presented him with gifts to please him.", " Gandharv, Siddhas, sages, elves etc.", " all began to sing in his praise.", " Narad says:", " 'O Yudhisthir, Hiranykashipu had such a brilliance that he began to receive the offerings himself of the Yagyas performed by Brahmins.", " On all the seven islands and upto the heaven, it was his dominion.", " Now he was freely and lavishly enjoying all the luxuries.", " Maddened by the luxuries, he even began to violate the rulings of the scriptures.", " Perplexed by his harsh rule, all the gods went into the refuge of the Almighty.", " Through a celestial voice, God comforted them:", " 'Don't be afraid O gods.", " I am aware of havoc caused by this demon.", " I will destroy him, you wait for some more time.", " When he will begin to torment his calm and devotee son Prahlad, I will definitely kill him.", "' The demon king Hiranykashipu had four sons.", " Prahlad was youngest of them, Prahlad was the greatest lover and devotee of God.", " Hiranykashipu had declared such a pious son like Prahlad a criminal of the state. Thus he tried his best to kill Prahlad. "], "next": "16.7.4", "prev": "16.7.2", "title": "Tale of Hiranyaksh and Hiranykashipu"}