{"index": "16.7.5", "image": "resized_images/Attempts to Kill Prahlad.png", "text": [" Hearing his father scoffing at Guruputras, Prahlad said, \"Father it was not taught to me by them, it is my natural inclination.", "\" These words further infuriated Hiranykashipu.", " Blinded by anger he ordered his soldiers to kill Prahlad at once.", " Formidable demons hit Prahlad with their arms.", " At that time Prahlad's conscience was focused in God.", " All the blows of the demons yielded no result.", " Thereafter, Prahlad was trampled by intoxicated elephants, bitten by poisonous snakes thrown from the high cliffs into the sea and even in fire, buried under the mountain but all in vain.", " None of the attempts could do any harm to the sinless Prahlad.", " Now, Hirankashipu began to feel worried because of his inability.", " Seeing him worried the teacher assured him, \"Be free of worries, O king.", " Keep your son tied in Varunpash (the noose of varun) until our father Shukracharya returns.", "\" Then they again took Prahlad to their hermitage to teach him Grihasthdharm (duties of a married man).", " One day the teachers were away for some urgent work.", " Prahlad called his classmates and began to preach them about Lord Vishnu.", " Preaching to Demon Boys by Prahlad:", " Prahlad preached, \"Friends, human incarnation is a rare thing in this world.", " So taking shelter at the feet of God in this human incarnation is a success for life.", " Brothers, God is the friend, beloved and the soul of each and every being.", " Sensual pleasures are easily available in every incarnation, so it is useless to make physical efforts to achieve sensual pleasures.", " But this human body is a means to get God.", " So, as long as the body is sound and healthy and it has strength one must work for his benefits.", " Half of the life of a man is simply wasted in sleeping.", " First twenty years pass in playing, Young age passes in satisfying the ego while during the twenty years of old age human body becomes crippled.", " So friends don't waste your life running after the physical pleasures, luxuries, wealth and all that leads to a certain fall.", " One needs not work hard to please the God.", " He is soul of every living being.", " He is self-achieved.", " Only do good to every living being, be kind to them unconditionally.", " God is pleased with these actions only.", " Impressed by the beautiful preaching of Prahlad about Bhagwad Dharma, the demon boys asked, \"O prince, you have never been away from the hermitage.", " How then did you get such a knowledge at such a raw age?", " Prahlad told his fellow disciples that when his father was away on Mandarachal for penance, Indra had kidnapped his mother Kayadhu.", " He was taking her to Devloka when Devarshi Narad stopped him in the way and asked why he was taking such a helpless woman so forcibly.", " Indra had told then that he would destroy her foetus who was going to be a demon and thereafter would let her go.", " Narad had said, \"Devaraj there is a great devotee of God in this foetus, you cannot kill him.", " But you need not fear him.", "\" Thus convinced by Narad, Indra had released Kayadhu who then came to stay at Narad's hermitage to pass her time.", " In the pious company of Narad who, with a desire to benefit my mother and me, had preached us about Bhagwad dharma, and absolute knowledge (Vishuddha Gyana).", "\" It is that knowledge which I have preached you just now.", " God is pleased with unconditional love only.", " So you too develop devotion for God.\" "], "next": "16.8", "prev": "16.7.4", "title": "Attempts to Kill Prahlad"}