{"index": "16.8.4", "image": "resized_images/Conquering of Heaven by King Bali.png", "text": [" Shukdev says, \"Parikshit by the virtues of the ambrosia, the gods had become invincible.", " They began to take revenge and the demon king Bali met his death in the battle.", " When Brahma saw the imminent extermination of the demons, he sent Devarshi Narad in the battlefield to make the gods abstain from the war.", " The survivng demons carried the dead Bali towards Astachal.", " There, Shukracharya, the teacher of the demons, resurrected all the demons with his Sanjivani Vidya (knowledge that resurrects the dead).", " Thus obligated the demon-king Bali dedicated all his wealth to Shukracharya and began to serve him and other Brahmins of Bhirgu clan.", " By the service of the Demons Brahmin of Bhrigu clan got very much pleased.", " King Bali had a long cherished desire of conquering the heaven.", " So the Brahmins organized a Vishvjit Yagya for Bali.", " At the completion of Yagya, first emerged a beautiful chariot, all covered with gold.", " Then green coloured horses, inexhaustible quiver and a divine shield emerged in sequence from the altar.", " Bali's grandfather Prahlad presented him a garland while Shukracharya gave a conch.", " Thus receiving all the weaponaries, king Bali took oath and circumambulated Brahmins.", " Thereafter, greeting them he boarded the chariot followed by powerful demons and their huge armies.", " Thus fully prepared Bali launched a massive attack on the heaven.", " When Indra saw that Bali had come with full preparation and that his armies had surrounded Amaravati, he went to his teacher Brihaspati and asked about the reason for the demons' sudden uprising.", " Devguru said, \"Indra, blessing of Bhrigu Brahmins is the main reason of the demons uprising.", " You can't face the demon armies yet, because Kaal himself is in their favor.", " So you all abandon the heaven and hide somewhere.", "\" After the abdication of the heaven by the gods Bali captured it.", " Then he conquered all the three worlds.", " With advice of his priests, Bali organized one hundred Ashvmegh Yagyas.", " Thus by the grace of Shukracharya and other Brahmins of Bhrigu clan, king Bali got the domain of the heaven and began to rule it generously.", " Preaching of Payovrata to Aditi by Kashyap:", " Shri Shukdev says, \"O Parikshit, Aditi( mother of the gods) felt very sorry for the gods and capture of the heaven by the demons.", " When Sage Kashyap visited Aditi's hermitage, he saw his wife in desperate mood.", " On enquiring about the reason, Aditi said, \" Lord by your grace my married life is running well.", " But I am sorry for the pitiable condition of my sons, the gods.", " Strong demons have snatched their abode.", " So kindly tell me the remedy.", "\" At her request Kashyap preached Aditi about a worship named \"Payovrat\" to seek the blessing God.", " This worship, Payovrat is carried out during the waxing phase of the month Phalgun (that correspond to February-March months in Gregorian calendar) for twelve days continuously.", " One must drink milk only during the worship.", " One-day before starting the Vrat, that is on the day of Amavasya (moonless night) one must smear his body with the earth dug out by the boars and take bath in the river.", " Then, one must worship God with Shodushopchar (sixteen treatments) while following the rules prescribed for daily routine.", " He must recite Dwadashakshari Mantra (hymn containing twelve letters), perform Havan with Kheer (rice cooked in milk) and distribute Naivadya (remaining food from Havan) among the devotees.", " Reciting the twelve-lettered hymn, one must tell the rosary-string at least once about the wish.", " Thus, the same worship must be performed for twelve days continuously.", " If one feeds a Brahmin daily during the Vrat, he can be sure of God's grace.", " Mother of the gods, Aditi performed Payovrat as per the advice of her husband Kashyap.", " Pleased by her Vrat, the Lord appeared before her in Chaturbhuj (four- armed) form.", " Mother Aditi laid flat on the ground to greet the God.", " She prayed, \"O Lord you are the God of Yagya, and Yagya yourself.", " Those, who take refuge at your feet are saved when you are pleased, nothing remains ungettable.", "\" Lord said, \" O mother of the gods, I know about your desire.", " You have worshipped me for your sons, But it is difficult yet to defeat the demons.", " But because of your worship, I will protect your sons by becoming your child.", "\" Vaman incarnation of God:", " When the Lord arrived in Aditi's womb, Brahma prayed to Him.", " By Brahma's prayers, the unborn God appeared before Aditi.", " Shukdev says, \" O Parikshit, on the twelfth day of the waxing phase of Bhadrapada month (corresponding to September) Lord tok birth in Abhijit Muhurta.", " Everywhere, everybody celebrated the arrival of God with joy.", " The gods showered flowers on Him.", " The God had arrived in Vaman (dwarf) form.", " His continence appearance caused tremendous joy for the sages.", " During Upnayan consecration of Lord, the ruling deity of the Gayatri mantra, Savitri (an epithet for Surya) preached Him the hymn.", " Guru gave him Yagyopavit, Kashyap gave neck-kerchief, the earth gave black buck skin, Chandra gave scepter, Mother gave loin cloth, the sky gave umbrella, Brahma gave Kamandalu (coconut shell bowl) Saptrishi gave kush (sacred grass) while Goddess Saraswati presented God with a string of Rosaries.", " Yakshraj (king of Yakshas) Kuber gave him the alms bowl and mother Annapurnna gave him alms.", " Thus everyone payed due respect to God in Vaman (dwarf) incarnation who was radiating with divine glory.", " Lord was intimated that the king Bali was performing many Ashvamegha Yagyas with Bhrigu Brahmans.", " He at once left for the Yagya site, at a place named Bhrigu Kachch on the banks of the river Narmada.", " As soon as Lord Vaman reached the site, all the sages, hosts and others present there became dull before the radiance of God.", " They felt as if Surya himself had arisen there.", " Everyone stood up to welcome God.", " Host Bali offered Him the best seat and washed His feet with affection.", " Then Bali requested God for his service.", " Demanding three steps of Land by Vaman:", " King Bali requested, \"O Brahmin , now tell me how I can serve you.", " You are the tangible representation of the penance of Brahmarishis.", " By your arrival, all my ancestors are salved, my clan is blessed, my Yagya has succeeded.", " Ask me whatever you wish.", " I am ready to give you your desired object.", "\" Hearing the pious talk of the king Bali, Lord Vaman blessed him and said, \"O king, no one have been impatient and frugal in your clan.", " Reputation of your grandfather Prahlad is still alive.", " You great grandfather Hiranykashipu had chased the illusionary Vishnu who had hid in your great grandfather's heart itself.", " When the infuriated Hiranykashipu could not find Vishnu anywhere in all the three worlds, he presumed that Vishnu had died because of his fear alone.", "\" \"O king\" continued Lord Vaman, \" You are excellent among the religious people.", " O demon king, you can fulfill any great desire.", " But I demand only as much land as could be covered in three steps of mine.", " I need nothing else.", "\" King Bali said, \" O Batu, (dwarf Brahmin) you talk like aged persons but your mind is childish.", " I am the ruler of all the three worlds, and you are asking for three steps of land only, you can still ask for anything else.", " Lord Vaman replied,\" O king, greedy ones are not sated even if they get whole of the earth.", " But I don't want more than my requirement.", "\" King Bali agreed to donate Vaman the Land as per his demands and picked up the water pot to make resolution.", " When Guru Shukracharya, saw that Bali had agreed to donate land, he tried to persuade him, \"O Bali, this Vaman is none other than indestructible Lord Vishnu.", " He has taken incarnation of Vaman as a son of Aditi, Kashyap's wife, in the interest of the gods.", " Unknowingly you have made a promise to fulfil His desire.", " But He will snatch everything from you and hand it over to Indra.", " This illusionary Batu will measure whole of your empire in all the three worlds with his two steps, so you will not be able to keep your promise also.", " Hence, show your inability to make donation as per His demand, send Him back.", "\" Measuring of Earth's heaven by Vaman:", " Shukdev says, \"Parikshit with, politeness king Bali asserted to his teacher, \" Gurudev, your words are true.", " But I am the grandson of great Prahlad.", " Now I cannot reverse my promise.", " No religion is greater than truth.", " I'm not afraid of any calamity except of deceiving a Brahmin.", "\" When, Shukracharya saw that his disciple Bali was determined to violate his dictate, he cursed, \" O king, soon you will be devoid of the wealth you have been enjoying.", "\" But despite having been cursed by his teacher, Bali stayed firm to his promise.", " Worshipping Vaman formally, he took some water on his palm and made the promise to donate land.", " As soon as Bali made the promise, Lord Vaman assumed a gigantic appearance and measured Bali's entire empire in his steps.", " In first He measured the whole of the earth.", " In the next He measured the heaven.", " The second step itself reached Satyaloka, where Brahma had once washed Lord's feet and kept the water, in a Kamandalu (a bowl of coconut shell) that came on earth later as the river Ganges.", " Now there was no room for God to put His third step.", " Lord ridiculed Bali for not keeping his promise fully, \"Your everything is mine now, but your promise is still incomplete.", " Shukdev says Lord ridiculed Bali but he remained unmoved with patience.", " He said:", " 'O Lord, I keep my promise fully, you put your third step on my head.", " I don't want a blemish on my reputation.", "' Lord said:", " 'I snatch all the wealth from people who are bestowed with my grace.", " They then become an inseparable devotee of me, free from every blemish.", "' Thus Lord Vishnu gave Bali the empire of Sutal Loka (hades) that was even richer than the heaven and said:", " 'I will protect you there from all the obstacles.", "' Your hundredth Ashvamudh Yagya shall be completed.", " In due course of time you shall be the king of the heaven.", "' This way, without fighting a battle, Lord took the empire of heaven from the demons and gave it to His brother Indra. "], "next": "16.8.5", "prev": "16.8.3", "title": "Conquering of Heaven by King Bali"}