{"index": "16.8.3", "image": "resized_images/Churning of the Sea.png", "text": " King Parikshit asked, \"O great sage, how did God cause churning of the sea. What was the purpose behind it? Kindly tell me?\" Shukdev says, \"Parikshit, in the sixth Chakshush Manvantara,the demons king Bali had defeated the gods. Indra had also lost his glory by insulting the garland which sage Durvasa had presented to him as a God's gift. Indra had put the garland in elephant's neck and then got it crushed under its feet. But now having lost his kingdom and struck by misfortune, Indra and other gods with Brahma prayed to the Lord . Melted by their prayers, God appeared before them. All the gods laid before Him and worshiped. The omnipotent God inspired the gods to churn the sea. Lord asked the gods to churn the sea and produce nectar. He also advised them to take the help of demons in that great task. Drinking the nectar one becomes immortal. God asked the gods to put various medicinal plants and vegetations in Kshirsagar (sea of milk) and churn it by Mandarachal Mountain moving it with the help of Vasuki the naga. God promised them of all help from His part. Thereafter, Indra and other gods went unarmed to the demon king Bali and told him of their intention. Demons too liked the idea. With a friendly attitude then the gods and the demons together uprooted the mount Mandarachal. But they could not carry it to the sea. Lord appeared on Garuda and carried the mountain to the sea. The gods and demons had promised Vasuki, the Naga his due share in the nectar. So Vasuki allowed them to use him as a rope, wound around Mandarachal as a means to move it. In the incarnation of Ajit, Lord told the gods to hold the head of Vasuki. But the demons suspecting some mischief said they would hold the head and asked the gods to hold the Naga from the tail for churning. Thus the gods held the tail while the demons took hold of Vasuki's head. Thus they began the churning. But as soon as the churning began the mountain started sinking for not having a firm base. Lord then took Kachchhap (tortoise) incarnation and supported Mandarachal on His back. On the mountain also Lord appeared in Sahastrabahu form, and held it. The gods and the demons churned the sea for long but nothing emerged. So, Lord Ajit himself began to churn the sea. First of all, it was Halahal, the deadly poison to emerg. The intensity of the poison began to torment every being. To save their subjects from it, Prajapatis prayed Lord Lord Shiva. The life-giver, Lord Bholenath (an epithet of Lord Shiva) drank all the poison. By the impact of the poison, Lord Lord Shiva's throat turned blue in color. Hence Lord Shiva got the name Nilakantha. Emergence of Gems & Nectar: After Lord Shiva drank the poison, the gods and the demons began to churn the sea again with greater enthusiasm. Now, Kamadhenu, the divine cow emerged. She was useful for Yagya etc. so the sages received it. Then a horse named Uchchaishrava, emerged and taken up by Bali the king of demons. The horse was followed by Airavat the elephant. Indra took it. The divine gem, Kaustubh Mani, emerged then. Lord Ajit took it on His chest. Then emerged the Kalpvriksha, the divine tree that reached the heavens. Then the elves emerged. They all accepted to serve Indra in Heaven. Goddess Lakshmi emerged after the elves. All the azimuths were lighted because of her brilliance. Everyone was attracted towards her beauty, generosity, youthfulness, appearance and glory. Devaraj Indra presented a throne for her to sit. Rivers brought water for her ceremonial bath. The earth presented medicinal bath. Cows gave Panchganyas and Vasant (spring) presented many kinds of fruits and flowers. The sages welcomed Lakshmi with Rigsuktas (hymns of Rigveda). Gandharvas sang in her praise. Then taking the lotus in her hand, Lakshmi took a seat on the throne. Sea donned her with a beautiful silk saree. Varun presented a garland. Saraswati gifted her with a necklace of pearls. Brahma presented lotus while Nagas presented two earrings. After the singing by Brahmins in her praise, Lakshmi took lotus garland in her hand and put it around Lord Vishnu's neck in a gesture of accepting Him as her husband. Jagatpita, Lord Vishnu too gave Lakshmi a supreme position in His heart. Lakshmi was followed by Varuni who was taken up by the demons. The gods and the demons began to churn the sea again. At last lord Dhanvantari emerged with an urn of nectar. It was Dhanvantari who developed Ayurved, the ancient Indian system of medicine. As soon as the demons saw the urn, they snatched it and ran away. A row then began among the demons over the drinking of nectar. Consoling the gods, Lord appeared among the demons in the guise of an extremely pretty woman, Mohini. Distribution of Nectar by Lord as Mohini: The demons who were fighting over the potions of nectar forgot everything when they saw Mohini, who was actually a guise of Lord Vishnu. Lured by her prettiness the demons came to Mohini and requested her to solve the dispute for them. Illusioned by God, the demons even gave the nectar to Mohini and sat peacefully showing their confidence in her. In Mohini's guise, Lord thought that the demons were congenitally cruel and giving nectar to them would be akin to feeding sakes with milk. Their evils would increase. So, Mohini offered the nectar to the gods only while offered wine to the demons. When the nectar was being distributed, a demon named Rahu took the guise of a god and sitting among them drank the nectar. Suurya and Chandra spotted him and revealed his identity to God, who at once beheaded him. But, by then Rahu had drunk enough nectar. ", "next": "16.8.4", "prev": "16.8.2", "title": "Churning of the Sea"}