{"index": "16.8.2", "image": "resized_images/Tale of Gajendra, the elephant and Grah, the crocodile.png", "text": [" King Parikshit asked, \"Munivar, God had salve Gajendra, in His Hari incarnation.", " I wish to hear this tale.", "\" Shukdev says, \" O king, in Tamas Manvantara, God had appeared as Hari and saved Gajendra from the jaws of Grah the crocodile.", " I am narrating the tale to you listen to it carefully.", " Surrounded by Kshirsagar, there was a high mountain named Trikuta.", " In the dense forest on the mountain there lived Gajendra along with his harem of many cows.", " Gajendra was the king of many big and strong elephants.", " One day, Gajendra was passing his time playfully with his family in the forests.", " It was very hot that day.", " So, perplexed by the sun, Gajendra descended down the mountain with his family.", " At the foothills, there was a big lake with deep, cold water and many lotuses blooming in it.", " Gajendra entered the lake and drank water to his fill.", " Then he took bath and started to play in the water.", " His activities in the water disturbed the crocodile who lived there.", " With anger, the crocodile caught hold of Gajendra's leg.", " Startled by the sudden attack, Gajendra put all his might to get free but in vain.", " They only jostled against each other for long.", " Every moment, crocodile's strengths seemed to be gaining.", " At last, because of constant pulling into water, Gajendra's strength gave away.", " Now, he was very desperate and thought that God has sent the crocodile as a noose of Yama (death) for him.", " This thought horrified the elephant, so he decided to take refuge at Shri Hari.", " Prayer of God by Gajendra:", " Gajendra had the memory of his previous birth fresh.", " So concentrating his mind in the beautiful appearance of God, he began to pray, \"I take refuge at God, who is the base of the entire world, who is the ultimate refuge for everyone.", " It is difficult to unfold the mysteries of His plays.", " He takes many guises.", " Not even the sages and the gods know His appearance and glory.", " May such a Lord protect me.", " O Lord, your powers are unending.", " You are gracious to those who take refuge in you.", " Illusioned by you, this humble creature does not recognize you.", " O Lord, I am in your refuge.", "\" Shukdev says, \"Parikshit, Gajendra had prayed God impartially and unspecifically so other gods did not come to save him.", " Being the soul of everyone, Lord Shri Hari appeared Himself and saw Gajendra in deep crisis.", " When Gajendra saw that Lord Shri Hari had arrived on his vehicle Garuda from the sky, he picked a lotus from the lake and raised it in his trunk and said, \"O Jagadishwar (God of all world) Narayana, here is a salutation for you.", "\" By then Lord jumped down from the Garuda and dragged both of them out of water.", " Then He tore the jaws of the crocodile by his wheel and saved Gajendra.", " All the gods, Brahma and Lord Shivaa worshiped God and showered flowers on Him.", " Previous Births of Gaja & Grah:", " Killed by the God, the crocodile at once acquired a divine appearance.", " He was a good-natured Gandharva (demigod) named Huhu, in his previous birth.", " By the curse of Mahatma Deval, he had to take birth in crocodile form.", " But now, by the grace of God he was salved and went to his heavenly abode.", " Gajendra too received salvation by mere touch of God.", " He too went to the heavenly abode of God.", " In his previous birth, Gajendra was a king of Pandya dynasty.", " His name was Indradyumna.", " He was a fervent devotee of God.", " So he had abandoned his kingdom and taken to penance on Malay Mountain.", " One day he was engrossed in his worship when sage Agastya arrived there with his disciples.", " For not getting due welcome from the king, Agastya cursed him, \"You with a dull mind, who neglect his guests will be born as an elephant.", "\" But even in elephant incarnation, and by the virtues of his devotion, Gajendra retained the memory of his previous birth.", " God appointed him as his courtier and departed to his divine abode riding on Garuda.\" "], "next": "16.8.3", "prev": "16.8.1", "title": "Tale of Gajendra, the elephant and Grah, the crocodile"}