{"index": "16.8.5", "image": "resized_images/Tale of Matysa-Avatar.png", "text": [" King Parikshit asked:", " 'O Gurudev, Lord is omnipotent.", " Why did He then take Matsyavatar like an ordinary being bound by karma?", " I want to hear the tale of God's Matsyavatar.", "' Shukdev said:", " 'O Parikshit, God is one.", " Still for the preservation of His devotees, He takes various incarnations.", " He also shows His plays by being present in all the creatures.", " But He remains unaffected by the merits and demerits of those living beings.", "' 'Parikshit, at the end of last Kalp, Brahma had fallen asleep, causing a Pralaya.", " All the worlds had been inundated then.", " When Brahma had fallen asleep, Vedas fell out from his open mouth.", " A demon Hayagreeev abducted the Vedas by his illusionary powers.", " Omnipotent God had known the action of the demon.", " So he had to take Matsyavatar (fish-incarnation).", "' 'There was a King named Satyavrat during that time.", " He was very generous and great devotee of God.", " Sustaining himself on water only, the King was observing severe penance.", " The same King Satyavrat has come to be known as Shraddhdev, the son of Surya (Vaivashvat) in the present Kalp.", " One day, Satyavrat was taking a bath in the river, when a small fish came in his folded palms.", " The fish requested the King to save her.", " So the King put the fish in Kamandalu (coconut shell bowl).", " But in no time the fish grew too big to be accommodated in the Kamandalu.", " So the King transferred the fish into another, bigger pot, but again it grew too big to be accommodated in the pot.", " The sequence continued till the fish outgrew even the big lake.", " So the King decided to put the fish in the sea.", " The fish, which was actually an incarnation of God, requested the King not to put it in a sea inhabited by fierce monsters.", " King Satyavrat grew suspicious.", " So with folded hands, the King requested the fish to appear in its real form.", " Instantaneously, Lord Narayana appeared and told the King:", " 'Exactly on the seventh day from now, Pralaya will inundate all the three lokas.", " But I will send a boat for you.", " You will board the boat and tether it to my horns with Vasuki, the Naga.", "' Having received the information of deluge, the King began to wait for its arrival while reflecting on God's virtues.", " On the seventh day, dense clouds gathered in the sky and began to rain torrentially.", " Soon whole of the earth was inundated.", " The King Satyavrat found the boat sent by Lord.", " Boarding the boat, Satyavrat began to pray to God.", " At his prayers, Lord preached him the knowledge of metaphysical.", " Thereafter, the God killed the demon Hayagreev and recovered the Vedas.", " When Brahma awoke from his sleep, Lord handed the Vedas to him.' "], "next": "16.9", "prev": "16.8.4", "title": "Tale of Matysa-Avatar"}