{"index": "16.8.1", "image": "resized_images/Description of the Manvataras.png", "text": [" (1) Swayambhu Manvantra- King Parikshit said to Shukdev, \"Gurudev, I just heard that tale of self-begotten Manu's lineage.", " Now kindly describe to me about the others Manus.", " Also describe the plays of God's different incarnations which occurred during different Manvantaras.", "\" Shukdev said, \"Parikshit, during Tamas Manvantara, Lord Narayana was born as Hari incarnation from Harini, the wife of a sage.", " In that incarnation He saved an elephant from the jaws of a crocodile.", " During the present Kalpa (period comprising the sum of all the four Yugas), six Manvantaras have passed.", " I have described the first one.", " Now, listen to the description of the other Manvantaras.", "\" (2) Swarochish Manvantara- Swarochi Manu was the son of Agni.", " He had sons named Dyumana, Sushena and Rochismana.", " During that Manvantara, Indra's post was occuppied by Rochan.", " Scholars of Vedas like Vrajstambh etc.", " were among the Saptarishi (seven great sages).", " Lord had taken incarnation as Vibhu, the son of a sage Vedshira and his wife Tushita.", " Vibhu remained a loyal celibate lifelong.", " Following His conduct, eighty-eight thousand more sages observed celibacy life long.", " (3) Uttam Manvantara- Third Manu Uttam was the son of the king Priyvrata.", " He had sons named Pawan, Sanjay, Yagyhotra, etc.", " In that Manvantar, seven sons of the sage Vashisht were Saptarishi (the seven great sages).", " Indra's name was Satyajit.", " Satya, Vedshrut and Bhadra were the main Ganas (courtiers) of the God.", " God had appeared in the incarnation of Satyasen, the son of Dharma and Sunrita.", " He was accompanied by Devganas named Satyvrata.", " Lord had destroyed during that period the evil Yakshas, demon and poltergeists.", " (4) Tamas Manvantara- Tamas, the fourth Manu was the real brother of Uttam, the third Manu.", " He had ten sons.", " Trishikh was Indra then, with Satyak, Hari, Veer etc.", " as his main courtiers.", " Sage like Jyotirdham etc.", " were the Saptarishi.", " During that Manvantara Lord had saved Gajendra from the jaws of the crocodile.", " (5) Raiwat Manvantara:", " Raiwas was the fifth Manu.", " He was also the real brother of Tamas, the third Manu.", " He had many sons.", " Vibhu was the name of Indra.", " Sages like Hiranyroma, Vedshira, Urdhubahm were among Saptarishi.", " God had appeared in the incarnation of Vaikunth the son of the sage Shubh and his wife Vikuntha.", " At the request of Goddess Laxmi, Lord Vaikunth created Vaikunth dham, the best among all other lokas (worlds).", " (6) Chakshush Manvantara:", " Chakshush was the sixth Manu.", " He had sons named Puru, Purush, Sadyumn etc.", " Mantrradruma was Indra then, with Apya etc.", " as main courtiers.", " Sages like Havishmana and Veeraka etc.", " were among the Saptarishi.", " During that Manuantara, Lord had appeared in partial incarnation as Ajit, the son of Vanraj and his wife Sambhunti.", " It was he who caused the churning of the sea and made the God's drink nectar and supported Mandarachal Mountain on his back in Kachchhap (tortoise) from during the churning.", " (7) Vaivasvata Manvantara:", " Shri Shukdev says, \" Parikshit in the present era, the seventh Manu, Shardhdev is the son of Surya.", " He has ten sons- Ikshvaku, Nabhag, Drisht, Sharyati, Narishyanta, Nabhag, Disht, Karush, Prishadhra and Vasumana.", " Purandar is the name of Indra.", " He has Aditya, Vasu, Rudra, Vishvadev, Marudgana, Ashwini, Kumar and Rishi as his main courtiers.", " Kashyapa, Atri, Vashishtha, Vishvamitra, Gautam, Jamadagni and Bhardwaj are the Saptarishi.", " During this Manvantara, God has arrived in Vamana incarnation as the son of Kashyapa and his wife Aditi.", " (8) Savarni Manvantara:", " Savarni, the son of Surya and Chhaya would be the eighth Manu.", " The king Surath, who had occurred in Swarachish Manvantara, had worshiped Goddess Bhagwadi intensely, and thus received a boon of having an unbroken empire on earth.", " In later course he will be the son of Surya and become the eighth Manu also.", " He would have sons like Nirmaka, Virajask etc.", " Vairochana Bali would be Indra, Amritprabha etc.", " as his main courtiers.", " Galava, Diptimana, Parashurama, Ashwatthama, Kripacharya, Rishyshring and Vyas- these great sages would be the Saptarishi during the eight Manvantara.", " God would take incarnation as Sarvbhaum, the sons of Devguhya and his wife Saraswati.", " God as Sarvbhaum would snatch the kingdom of Swarga (heaven) from Purandara Indra and give it to the king Bali.", " (9) Ninth Manvantara:", " Shri Shukdev says, Varuna's son Dakshasavarni would be the ninth Manu.", " He would have sons like Bhutaketu, Diptketu, Dyutimana etc.", " God would take birth as the incarnation of Rishabh, the son of sage Ayushmana and his wife Ambudhara.", " A person named Adbhut would be Indra and he would have Para, Marichigarbh etc.", " as his main courtiers.", " (10) The Tenth Manvantara:", " Upshloksa's son Brahma Savarni would be the tenth Manu.", " He would be very pious in nature and have sons like Bhurishen etc.", " Havishmana, Sukriti, Satya, Jay, Murti etc.", " would be Saptarishi.", " Shambhu would be Indra, with Suvasana, Viruddh etc.", " as his main courtiers.", " God would appear in the incarnation of Vishwasen as the son of Vishwasrij and his wife Vishuchi.", " He would be a friend of Indra.", " (11) The Eleventh Manvantara:", " The self-restraining Dharmasavarni would be the eleventh Manu.", " He would have ten sons.", " Vaidhrita would be Indra with Vihangama, Kamagama, etc.", " as main courtiers.", " Vedic sages like Arun etc.", " would be the Saptarishi.", " God would appear as Dharmasetu, the sons of Aryak and Vaidhrita.", " In this incarnation he would protect Triloki (all the three worlds).", " (12) Twelveth Manvantra:", " Rudrasavarni would be the twelfth Manu.", " He would have sons named Devavana, Updev and Devshreshth etc.", " Ritdhama would be Indra with Hari etc.", " as his main courtiers.", " As the son of Satyasahay and his wife Sunrita, the God would protect this Manvantara in the form of Swadham.", " (13) Thirteenth Manvantara:", " Devsavarni would be the thirteenth Manvantara.", " He would have sons named Chitrasen, Vichitra etc.", " Divaspati would be Indra of the gods like Sukarm, Sutram etc.", " Sages like Nirmoka, Tatvadarsh etc.", " would be the Saptarishi.", " God would appear as Yogeshwar, the sons of Devhotra and his wife Brihati.", " He would bestow the designation of Indra to Divaspati.", " (14) Fourteenth Manvantara:", " Indrasavarmi would be the fourteenth Manu.", " He would have sons like Uru, Gambhir Buddhi etc.", " Shuchi would be Indra and have Pavitra Chakshush etc.", " as his main courtiers.", " Agni, Bahu, Shuchi, Magadh etc.", " would be the Saptarishi.", " God would appear in the incarnation of Brihadbhahu as the son of Satrayana and his wife Vinata and cause the extension of Karmakand (actions).", "\" Shukdev says, \"O Parikshit, these fourteen Manvantaras had continued in past, are continuing in the present and they would continue in the future also.", " It is by them, that a Kalp (a period of thousand Chaturyugas) is completed.", " Calculation of time is also done through these Manvantaras.", " Period of a Manvantra is slightly more then seventy one Chaturyugas (all the four Yugas passing seventy-one times).", " A Chaturyugya (period of all the four Yugas taken together) lasts for about 3 million years, while a Kalpa lasts for about four thousand three hundred and twenty million years.", " This is equal to a day of Brahma.", " Brahma's night is Mahapralaya (the great deluge).", " When that night is over, Brahma again begins the work of new creation exactly as per the previous Kalpa.", " Carrying out this responsibility continuously for a century, Brahma goes back to Bhagwad dham (the abode of Lord Vishnu).", " His responsibilities are taken over by the next Brahma, who carries out the work of creation, by the inspiration of Lord Narayana. "], "next": "16.8.2", "prev": "16.8", "title": "Description of the Manvataras"}