{"index": "16.9.3", "image": "resized_images/Chandra Dynasty.png", "text": [" Shukdev says, \"Parikshit, now I narrate about Chandra dynasty.", " Many great and pious kings like Pururava had occurred in this dynasty.", " Chandrama was the son of Atri, the son of Brahma.", " Budh was the son of Chandrama while Pururava was the son of Budh.", " Ila was the mother of Pururava.", " He was very virtuous.", " Attracted by his virtues, elf Urvashi had approached Pururava with a sensual desire.", " Pururava welcomed Urvashi, and together they begot six sons- Ayu, Shrutayu, Satyayu, Ray, Vijay and Jay.", " Gaadhi :", "- In the lineage of Vijay the son of Pururava, there had occurred a king Gaadhi.", " Gaadhi had a daughter Satyvati.", " Satyvati was married to the sage Richik.", " Richik and Satyvati begot Jamadagni who married Renuka, the daughter of sage Renu.", " Jamadagni and Renuka begot Parashuram.", " In the same lineage, later on, occurred great kings like Rantidev, Shibi, Yadu, Kuru, Puru, Dushyant and Bharat.", " In this lineage of Kuru, king Shantanu had married Ganga, who gave birth to Bheeshma.", " Satyavati, the daughter of Nishad was the second wife of Shantanu.", " She begot Chitrangad and Vichitravirya.", " Chitrangad had died in an encounter with a demigod of his own name, while Vichitravirya was married to Ambika and Ambalika the princesses of Kashi.", " But, having too much caenal indulgence with his wives, Vichitravirya soon developed tuberculosis and died without producing a child.", " Since, Bheeshma had vowed to abide by celibacy till death, so Vyasji was summoned to produce children from Ambika and Ambalika.", " From Vyasji the two queens and a maid gave birth to Dhritrashtra, Pandu and Vidur respectively.", " Dhritrashtra had one hundred sons.", " The Kuaravas, while Pandu's wife Kunti begot Karan, Ydhishthir, Bheem and Arjun.", " Pandu's second wife Madri begot Nakul and Sahdev.", " Arjun had married Subhadra, the sister of Lord Krishna also.", " Subhadra had begot Abhimanyu who was married to Uttra, the daughter of Viratraja, and you were born to Uttara, O Parikshit.", " In Yaduvansh, lineage of Yadu a king Shursen had occurred.", " He had a son Vasudev.", " Vasudev had eight wives.", " Devaki was the prominent among them.", " Nine children were born to them.", " Kansa, the brother of Devki, killed six of them.", " Seventh was Balrama, eighth Krishna, and at ninth place was her daughter Subhadra.", " Shukdev says, \"O Parikshit, Lord Himself had appeared as the son of Vasudev and Devaki.", " Whenever the religion and religious virtues fall in the world and sins rises, the omnipotent, Lord Shri Hari takes incarnation to destroy the evils, and protect the pious ones and establish the religion again.", " When the evil demons took the guise of the kings and began to route the earth, Lord Vishnu then took the incarnation as Lord Krishna.", " Along with Him, Sheshnaga, His bed, also took incarnation as Balarama, in Yadu Vansh.", " Together they presented such divine plays that even the gods could not guess them.", " At the same time, to benefit the devotees, who would be born in Kaliyuga, Lord Krishna expounded His pious life into uncountable incidents.", " Merely by reciting and hearing the tales of Lord's life, all the sorrows, melancholis and ignorance of the devotees are removed.", " Through the battle of Mahabharata between Kauravas and Pandavas, Lord Krishna relieved the earth of most of her burdens.", " He Himself slayed many demons, while got many slain by Balarana.", " Ultimately, preaching Uddhav about metaphysical knowledge, Lord Krishna departed to His divine abode. "], "next": "16.10", "prev": "16.9.2", "title": "Chandra Dynasty"}