{"index": "16.9.2", "image": "resized_images/Description of Ikshvaku Dynasty.png", "text": [" Shukdev says, \" Once Shraddhdev Manu sneezed violently.", " From his nostrils, a son was born.", " He was named Ikshvaku.", " Ikshvaku had one hundred sons.", " Vikukshi, Nimi and Dandak were the eldest three of them.", " Vikukshi :", "- Once, Ikshvaku sent his eldest son Vikukshi to collect tubers for the offerings to be made to their ancestors.", " Vikukshi collected sacred Shash tubers.", " But, he himself was feeling tired and hungry, so he ate one of them.", " He gave the remaining tubers to his father.", " King Ikshvaku gave those tubers to Guru Vashishth for offering to the ancestors.", " Vashishth informed the king that the tubers were defiled and not fit for offerings.", " Thus told by Vashishth, Ikshvaku learned the deed of his son and expelled him out of his kingdom in anger.", " Vikukshi passed his life in exile and returned home only after the death of his father.", " He became famous as Shashad.", " Puranjay :", "- Puranjay was the son of Vikukshi.", " He is also famous as 'Indravah' and 'Kakutsth.", "' A fierce battle had taken place between the gods and the demons.", "In the battle, the gods had sought the help from Puranjay.", " But Puranjay stipulated that he would fight only when Indra agreed to become his vehicle.", " From God's inspiration, Indra took the guise of a big and heavy ox and bore Puranjay on his back.", " When Puranjay rode on the ox and trained his divine bow and arrows, all the gods prayed to him.", " Since, Puranjay had taken seat near ox's hump, he came to be known as Kakutsth.", " Puranjay fought a fierce battle with the demons.", " Thus in no time Puranjay defeated the demons and captured their towns, wealth, luxuries and every other thing and gave them to Indra.", " Since, Indra had acted as his vehicle, hence Puranjay is also known as Indravah.", " Yuvnashva :", "- In the lineage of Puranjay, had occurred a king named Yuvnashva.", " He had no son, so in desperation he gave up his kingdom and, accompanied by his queens, came to stay in the forest.", " There he organized a grand Yagya, Indrayag with a desire of a son and in the auspices of the great sages.", " The Yagya lasted day and night.", " But during the Yagya, Yuvnashva felt extremely thirsty and without giving a thought he drank some of the water from urn that had been sanctified with mantras.", " Since, the water was meant to produce a child, Yuvnashva begot a child with auspicious signs.", " Immediately after birth the child began to cry for milk.", " So to quiten him Indra put his index finger in the child's mouth.", " Since then, the child got the name Mandhata.", " Mandhata became a great emperor.", " He was also known as Trasdasyu because big robbers like Ravan had an inherent fear of him.", " Mandhata had deep self-learnings, still he organized many grand Yagyas.", " Mandhata had three sons- Purykuts, Ambarish (second) and Muchkund.", " He had fifty daughters also.", " All of them were married to the sage Saurabhi.", " Trishanku :", "- In this lineage of Mandhata there occurred a king named Satyvrat.", " He was renamed as Trishanku.", " Though by the curse of his father and the teacher, he had become a Chandal (an untouchable person) yet by the power of his penance, sage Vishvmitra helped him reach heaven with the body.", " But the jealous gods pushed down poor Satyvrat from the heaven.", " He was falling headlong while Maharishi Vishumitra supported and fixed him in mid sky, hence he got the name Trishanku.", " Harishchandra :", "- He was the son of Trishanku.", " For him, two great sages Vishvmitra and Vashishth had cursed each other and acquired bird forms and kept on fighting for many years.", " Harishchandra had no son.", " With a desire to have a son, Harishchandra worshiped Varundev.", " By the grace of Varun, he got a son named Rohit.", " Caught in the love for his son, Harishchandra forgot to organize Yagya to pay his thanks to Varun.", " Rohit too had fled to the forest to save his life when he learned that his father wished to sacrifice him.", " He stayed there for long.", " Back there in the kingdom Harishchandra acquired a deadly disease of Dropsy as a result of Varuna's anger.", " Having learnt about his father's illness, Rohit tried five times to return to the kingdom, but every time Indra forebode him.", " Thus he stayed in the forest for six years.", " But in the seventh year he bought the middle son of Ajigart and took him to the kingdom to be used as a votive animal.", " There he handed the boy over to his father.", " Thereafter, king Harishchandra organized a grand Yagya and pleased Varun.", " Pleased by their unshakable faith in truthfulness sage Vishvamitra blessed Harishchandra and his wife and preached them about metaphysical knowledge.", " SAGAR :", "- In the lineage of Rohit later on, had occurred a King Bahuk.", " Unfortunately, he met an untimely death.", " One of his widowed wife got ready to be immolated with her husband's pyre.", " She was pregnant then, so the sage Aurv prevented her from getting Sati.", " When her fellow queens learnt about her pregnancy, they fed her with poisoned food.", " But the poison proved ineffective on the unborn baby.", " The baby was born in due course with poison, so he came to be known as Sagar.", " Sagar had a great reputation as the King.", " He had sixty thousand sons.", " He had also resolved to organize one hundred Ashvmamegh Yagyas.", " His ninety-nine Yagyas completed without hassles, but during the hundredth Yagya, Indra stole the horse and tethered it in the hermitage of the sage Kapil.", " Sagar's sixty thousand sons set out in search of the horse, but could not find it anywhere on earth.", " At last, they reached the hermitage of the sage Kapil.", " Before that, with their enormous power, they had dug out huge pits, which filled with water and formed the sea.", " The sea derived its Hindi Synonym Saagar from Sagar.", " When those sixty thousand princes saw that the Yagya horse was Tethered in Kapil's hermitage, they began to abuse the sage.", " Disturbed by the noise, the sage Kapil opened his eyes, and instantaneously all the sixty thousand princes got incinerated.", " It was Anshumana, the grandson of Sagar, who pacified sage Kapil with his politeness and brought back the horse.", " He also discovered the ashes of his ancestors.", " Sage Kapil told Anshumana that the salvation of his ancestors would be possible only if touched by Gangaji, (the sacred Ganges).", " Since then, all the kings in Sagar's lineage observed severe penance to bring the Ganges on earth for the salvation of their ancestors.", " Bhagirath :", "- First of all, king Anshumana observed hard penance.", " But even after many years of penance he could not succeed in his efforts.", " His son Dileep also observed sever penance, but his efforts too, could not succeed.", " Bhagirath was the son of Dileep.", " After Dileep, Bhagirath started severe penance.", " After many years of penance, Bhagirath succeeded in pleasing the Ganges.", " She appeared before him and asked him to seek a boon.", " Bhagiratha requested the Ganges to arrive on earth.", " The Ganges accepted his wish, but put a question as to who would support her when she fell on earth from the heaven.", " Bhagiratha then began his penance again to please Lord Shiva so that He could support the Ganges on earth.", " Lord Shiva accepted Bhagirath's prays and supported the Ganges on his head.", " Thereafter He moved on the path shown by Bhagirath with sacred Ganges following.", " Thus, the sacred Ganges reached at the place where ashes of Bhagirath's ancestors were lying.", " The holy waters of the Ganges washed the ashes to the confluence at Ganga Sagar.", " By the mere touch of Ganges' holy water, Bhagirath ancestors received salvation.", " After Bhagirath many great kings like Michsah, Khatvang, Dhirghbahu, Raghu etc.", " occurred in the Ikshvaku dynasty.", " Raghu's son was Aja and his son was Dashrath.", " It was in the home of King Dashrath, and by the prayer of the gods, that Lord Shri Hari took birth as four sons of Dashrath.", " Description of Lord Rama's Plays :", "- Shukdev says, \" Parikshit, to keep the words of his father, Lord Rama abdicated the entire kingdom and took exile in the forest.", " Staying in the forest Lord Rama protected many sages, and helped them complete their religious rituals successfully.", " He slayed many formidable demons there.", " But, for cutting the nose and ears of Shupanakha, the sister of demon king Ravan, He had to bear the separation of his wife sita.", " Rama had won Sita as his wife in a swayamvar in Janakpur.", " In his teenage, sage Vishmatria had taken Rama and Laxmana with him to his hermitage to guard his religious proceedings against the demons.", " Rama and Laxmana had killed many demons then.", " It was during this period that the swayamvar was organized in Janakpur.", " Lakshmi, the better half of Lord Vishnu, had herself appeared as Sita in Janakpur.", " Sage Vishvamitra himself taken Rama and Laxmana to the swayamvar.", " Many more brave and strong kings and princes had gathered there.", " But no one could train the Bow of Lord Shiva as per the condition of the swyamvar.", " It was only Rama, who not only lifted the bow but trained it also.", " In the process of training, the bow broke with a loud noise.", " Thus Lord Rama won Sita as His wife.", " But during the exile the demon king Ravan deceitfully abducted Sita to avenge the insult of his sister Shurpanakha.", " Thereafter, the circumstances favored Lord Rama and He soon found out the whereabouts of Sita.", " With a huge army of monkeys and bears, Lord Rama reached the seashore there He prayed to the sea to make way for Him.", " But the sea did not pay heed to his prayers, so angrily He got ready to evaporate the sea.", " Thus frightened, the sea revealed to Him the way to make a bridge over it.", " Lord Rama then built a bridge over the sea and landed in Lanka.", " A fierce battle followed in which Lord Rama and Laxman together slayed the demon king Ravan, his brother Kumbhkarn and Megnaad, the son of Ravan.", " Thus, they got Sita free from Ravan's captivity.", " Crowning Vibhishan, the brother of Ravan as the King of Lanka, they returned to Ayodha on Pushpak Vimana.", " Brahmrishis crowned Rama as the king of Ayodhya.", " All the three worlds became happier, healthier and wealthier.", " Bharat, Lakshmana, Shatrughn and Hanumanji stayed forever in the service of Lord Rama always following the moral dictates and put an example for the world of high morals. As a king, Lord Rama also organized Ashvmegh Yagya. "], "next": "16.9.3", "prev": "16.9.1", "title": "Description of Ikshvaku Dynasty"}