{"index": "16.9.1", "image": "resized_images/Description of the Vaivasvat Manu Dynasty.png", "text": " King Parikshit requested Shukdev to describe about the dynasty of his contemporary Manu, Shraddhdev. Shukdev said: 'Parikshit, I describe about the dynasty of Manu in short because if I go in detail, it will not be completed in hundreds of years.' Manu Shraddhdev was the son of Surya and Sandhya. Name of Manu's wife was Shraddha. They did not have any child initially, so they organised a Putrayeshti Yagya under the auspices of their family teacher Vashishth. But right amidst the proceedings, the queen Shraddha prayed the Brahmins to bless her for a female child. The Brahmins made offerings as per her wish. Consequently a girl, instead of a boy, was born to them. She was named Ila. But the King requested Vashishth to transform her into a boy. Vashishth did the same, and the boy thus obtained was named as Sudyumn. TALE OF SUDYUMN :- One day Sudyumn had gone on a hunting excursion. Riding the horse with his ministers, Sudyumn reached a forest at the foothills of Meru Mountain. The forest was the nuptial abode of Lord Shiva and Mata Parvati. As soon as Sudyumn and his companions entered the forests, they all, even horses, got converted into females. Relating its reason Sukhdev said: 'Once, Mata Parvati was sitting naked in the lap of Lord Shiva when suddenly some great sages arrived there to have a sight of Lord. Mata Parvati sank with shyness and ran to don some cloth. When the sages saw that Gauri-Lord Shiva were enjoying intimacy, they moved at once to the hermitage of Nar-Narayana. Right at that moment, in order to please Mata Parvati, Lord Shiv said: 'Except me, any man who enters here, shall become a women.' It was because of these words of Lord Lord Shiva, that Sudyumn and his companions were transformed into females. While Sudyumn was roaming as woman, Budh, the son of Chandra, fell in love with her and they agreed to get married. From their marriage, a son, Pururawa was born, who founded the town named Pratishthanpur. Sudyumn, in female form, prayed Lord Shiva to free him from woman incarnation. Lord Shiva blessed Sudyumn that he would be a man for a month and a woman for another. Thus this cycle would continue life long. Thereafter Sudyumn returned to the kingdom and began to rule it religiously. He got three sons in due course- Utkal, Gaya and Vimal. In the twilight of his life, Sudyumn gave his kingdom to Pururava and he took exile. TALE OF PARISHADHRU :- After the exile of Sudyumn, Manu took to penance with a desire to have son. Pleased by his penance Shri Hari blessed him to have ten sons. Parishadhru was the eldest of them. He was appointed in the service of the cows. One night in darkness, a tiger broke into the cowshed causing a panic among the cows. Hearing the panicky noise of the cows, Prishadhru ran to the cowshed. There he saw that the tiger had caught a cow, and she was bellowing in pain and fear. Prishadhru at once ran to help and with a powerful blow of the sword he beheaded the tiger. It was pitch dark in the cattleshed, so Prishadhru could not see whom he had killed. In the morning he realized that he had killed the cow and not the tiger. He felt extremely sorry. Their family teacher cursed him to lead a life of a shudra. Prishadhru, thereafter passed his life as a celibate and mingled with the supreme Soul at last. TALE OF SHARYATI :- Sharyati was the second son of Vaivasvat Manu. He was a great scholar of Vedas. He had an extremely beautiful daughter named Sukanya. One day, king Sharyati was in the forests with his family. Thus roaming, they reached the hermitage of the sage Chyavan. Chyavan was immersed in deep meditation. His whole body was covered with termite's nests; only eyes were shining like fireflies. Out of curiosity, the princess Sukanya pricked those shining eyes of the sage with thorns. All the king's army fell in crises by this incidence. When the king learned about the princess' crime, he begged pardon of the sage Chyavan and gave the princess in his service and himself returned to his palace. In the forest Sukanya served Chyavan with dedication. Chyavan received youth and vigor by the grace of Ashwini Kumar. Pleased by Shukanya's dedication, sage Chyavan provided her with all queenly luxuries. After many days, king Sharyati again visited the forests. There he saw Sukanya talking to a beautiful young prince. At first Sharyati scolded at Sukanya for violating the norms of a chast woman. But Sukanya told him about the transformation of the sage Chyavan by the grace of Ashwini Kumar. Learning the reality the king felt overjoyed to see his son-in-law Chyavan in youthful state. TALE OF AMBRISH :- Shukdev says, \" Parikshit, Sharyati was the king Nabhag. His son was Naabhaag. He was a great devotee of his parents. As a result of his service for his parents, Naabhaag was very much comfortable. He had a son Ambarish who was a great devotee of Vishnu. Even the great wealth on earth had no value for Ambarish.The king Ambarish served the God with his own hands and remained immersed in His love. Once, Ambarish followed Nirjala Ekadashi Vrat (waterless fast observed on the eleventh day of each phase of lunar month) for a year. During one such fast, on the twelfth day, king Ambarish was about to break his fast, when sage Durvasa arrived there along with his ten thousands disciples. Welcoming him, the king requested Durvasa to accept food. But the sage turned down the request saying that it was prayer time for him, so he would first go to take bath, then worship and take alms (food) ultimately. But the sage Durvasa did not return for long. Thus by the dictate of Brahmins, king Ambarish broke his fast with basil leaves and water. Just then sage Durvasa returned and saw Ambarish breaking his fast. So taking it as an insult, the infuriated Durvasa invoked Kritya in order to kill the king. King Ambarish stood unmoved, and begged pardon with folded hands. Lord Narayana saw His devotee in trouble and inspired His Sudarshan Chakra (wheel) to save the king. Sudarshan Chakra first incinerated Kritya, then aimed at sage Durvasa. When Durvasa saw Sudarshan aimed at him, he ran for his life. First he reached Brahma. But Brahma told him that he was not able to protect the person who had done harm to a devotee of God. Then Durvasa reached to Rudra. Lord Shiva also said, \" Durvasa, by the wish of Lord, Rudras are engaged in the service of the universe. This Chakra is unstoppable by me. So you go to His refuge, only He can save you.\" From Lord Shiva's abode Durvasa reached Vaikunthdham, the supreme abode of Lord Vishnu. He was feeling intense heat of the wheel. So, shivering with fear, he felt at the Lord's feet and said, \"O endless, you are the only venerable of all the saints. O Lord, I have committed a great crime against your devotee. O Lord please save me\". Seeing sage Durvasa in his refuge, Lord Vishnu said, \" Durvasa. I am bound to my devotee. I am not independent. As the devotees abdicate their everything to receive me. Similarly I am also devoted to my devotee. So I too can't protect you. Go to the person who you wanted to hurt, and pray him. Only he can save you from the Chakra. Thus, by the dictate of God, aggrieved Durvasa returned to the king Ambarish and fell at his feet. Ashamed of the sage act, king Ambarish prayed God, \"O Lord if I had done any pious deed, may it be enough to calm you and may the heat that torments this Brahmarishi quenched.\" Thus by the prayers of king Ambarish, Sudarshan was quietened and returned to its position on Lords finger and sage Durvasa recovered from his sufferings. He blessed the king and left. ", "next": "16.9.2", "prev": "16.9", "title": "Description of the Vaivasvat Manu Dynasty"}