{"index": "16", "image": "resized_images/SHRIMAD BHAGAVATA PURANA.png", "text": " This Purana contains 12 Chapters – each with many sub-sections. Introduction Shrimad Bhagwad is regarded as a delicious fruit of Veda-Kalpa the period of four Yugas during which Vedas are supposed to be written. There is nothing abdicable in Shrimad Bhagwad. The Bhagwadkar (the orator of Shrimad Bhagwad) invites all the devotees in the world to relish this great scripture. Shrimad Bhagwad is a contemporary of Vedas; there is a profuse mention of Karm (action), Upasana (worship) and Gyan (knowledge) in Vedas, but Bhakti (devotion) could not find a place in Vedas. Shrimad Bhagwad compensates for this drawback, for it has vivid and comprehensive description of Bhakti (devotion). No action, worship and knowledge can exist without devotion. Presentation style of Shrimad Bhagwad is also remarkable; it's every page is flowing in the stream of devotion. All the forms and appearances of God have been described exhaustively. It is such a benevolent scripture that mere hearing of it even without getting it's meaning, is beneficial for the listener. If however one reflects on the meaning of the content, it would be a bonus. There are many examples in the past (when even the most dreaded sinister received salvation by mere hearing of Shrimad Bhagwad. Sinister Dhundhukari, who was in ghost form, is one such example. King Parikshit too, had a sight of his own soul by listening to Shrimad Bhagwad. Such examples are getting scarcer now days. Even then the devotees who really relish Bhagwad get free from the fears of death. Shrimad Bhagwad makes a man fearless. Dhruv rode the death itself for his heavenly departure. Pitamah Bheeshma turned away the inevitable death many times. Hence, those devotees who have taken a shelter at Shrimad Bhagwad develop faith in themselves. Then they have no fear of death. Shrimad Bhagwad is an immortal scripture that generates devotion. It is a means to find God without Yoga and Tapa. Virtues like unconditional love, generosity, grace, kindness and protection of the refugee, that are the adornments of God, have been described in simple, easy to grasp way in Shrimad Bhagwad. Virtues of God like His playing and chatting with ordinary people and helping them in every circumstance sympathetically, naturally attract the people towards him. Bhagwad makes a man free from doubts. It is a supreme creation by Vyasaji. Bhagwad is in fact an appearance of Narayana. It is a complete scripture. Fiddles get guidance by listening to it, while the infidels become fiddle. Even the sage like Shukdevji, who deserted everything, couldn't give up the temptation to hear Shrimad Bhagwad. It is a life giver to all kind of people. It has a beautiful balance between the practice and altruism. It has a comprehensive content regarding the knowledge, action, social duties, women's duties, religion and politics etc. Having heard and reflected over Shrimad Bhagwad, there remains nothing to know then. In the present era the society has neglected the knowledge, devotion and spirituality. It regards physical achievements as everything. Bhagwad does not forbid or deny the physical achievements, but it gives a message to acquire a balanced view for them-neither too much indifference nor too much indulgence. TATHANATE MADHAV TAVAKAH KVACHIT BHRASHYANTI MARGAT VADI BADDH SAHRIDAI. TVAYA BHIGUPTA VICHARANTI NIRBHAYA VINAYAKANIKAPAMURDHA SUPRABHO. TAVAD RAGA DAYAN STEMASTAVAD KARAGRIHAM GRIHAM TAVANMOHONDHRI NIGADO YAVAT KRISHNA NA TE JANAM. Preface Created by Maharshi Badrayan an epithet of Ved Vyas Shrimad Bhagwad Mahapuran is an immortal heritage of the world's ancient literature. It is no less than ambrosia. Shrimad Bhagwad is equally honored by the learned ones, devotees, sages and the metaphysical researchers. Tales from the time of the beginning of creation to the Pralaya Kaal (The great deluge) have been skillfully interwoven in Shrimad Bhagwad. Because of it's unique, dialogue like presentation style, Shrimad Bhagwad is an encyclopaedia in itself. VADANTI TATTATTVAVIDAH TATTVAM YAOGYANAM DVAYAM | BRAHNETI PARA MATMETI BHAGAVA NITI SHABDYATE | Word Bhagwad literally means God or akin to God. All the virtues of God, therefore and even those of His devotees are expressed by this seemingly simple word, Bhagwad which has been transformed into an immortal scripture by Krishna. Vyasji: IDAM BHAGVATAM NAM PURANAM BRAHMA SAMBHITAM | UTTAM SHLOR CHARITAM CHAKAR BHAGWANARASHIH || During the twilight of Dwapar Yuga, Maharashi Veda-Vyas taught this scripture to his son Shukdev. Origin of Shrimad Bhagwad is even older. In the tradition of Shrimad Bhagwad, God Narayan himself narrated its content to Brahma. Brahma narrated it to Devarshi Narad who preached it to Badrayan Vyas. Vyas brought it into scriptural form and handed it to his son Shuk Dev. Shukdev, in his turn, preached Shrimad Bhagwad to the king Parikshit and SUTJI. King Parikshit died soon after hearing it, while SUTJI narrated this scripture to the sages like Shaunak et al. in Nemisharanya during his thousand years stay there. PURAN SANHITAMETAMRISHIRNARAYANO AVYAYAM | NARADAY PURA PRAH KRISHNDVAI PAYNAY SAH || SAVAI MAHYM MAHARAJ BHAGVAN BADRAYANAH| IMAM BhagwadI PRITAH SANHITAM VED SAMMITM || ETAM VAKSHVYASAV SUT RISHTIBMYO NAIMISHALAYE| DIRGHSATARE KURUSHRESHTH SAMPUSHRAH SHUANAKADIBHIM|| The greatest feature of Bhagwad is that it illustrates the mutual but eternal relationship of the Jivatma (microcosm) and Pramatma (the supreme sprit.) It also illustrates the selfless dedication of the devotees and unconditional love of God for His devotees. Thus it introduces one with oneself and hence leads him to salvation. The author has beautifully woven the plays of God into enticing tales with the help of the yarns of knowledge, devotion and action: VASUDEVE BHAGVATI BHAKTI YOGA PRAYOJITAH | JANYATYA SHUVAIRAGYAM GYANAM CHA YADHETUKAM || EVAM PRASANN MANASO BHAGWAD BHAKTIYOGATAM | BHAGVATTA TTVA VIGYANAM MUKT SANGASY JAYATE || This story of God attracts the learned ones like Shiv, Sanak, Shuk etc. as much as it pleases the common people who are stricken with many kinds of evils. It is indeed a wealth for the lovers of Bhagwad, devotees and other religious people. TAV KATHAMRITAM TAPT JIVANAM KAVIBHIRIDITAM KALM SHAPAHAM | SHRAVAN MANGALAM SHRIMADATATAM, BHUVIGANATITE BHURIDA JANAM || Hence, the excellent, easily available and simple means to know the self are reciting, remembering and singing in praise of Lord Krishna. Paramatma (Lord) enters the heart of the devoted listener of Hari Charitra (virtues of God) in verbal form and destroys the blemishes present there. SANKIRTYAMANO BHAGWANANTO SHRI TANUBHAVO VYASANAM HI PUNSHAM PRAVISHTH CHINTAM VIDHU NOTYSHESHAM YATHA TAMORKOABHRA MIVATIVATAH. It is clear, therefore, that without resorting to any other difficult and mysterious means, one can afford his well being simply by taking refuge at Bhagwad. Instead, dedicating himself to God and remembering Him, one gets the love of God in his mundane life. Such an achievement is rare even for great ascetics. AHOATIDHANYA VRAJ GORAMANYAM STANYAMRITAM PITMTN TEE MUDA | AHOBHAGYAMAHOBHAGY NAND GOR VRAJAIKSAM | YANMICHAM PARMANANDAM PURNAM BRAMHA SANATANAM || ", "next": "16.1", "prev": "15.1.1", "title": "SHRIMAD BHAGAVATA PURANA"}