{"index": "17.1.1", "image": "resized_images/Sutji Narrates the Divine Tales of Linga Purana.png", "text": " Once, sage, Narad arrived at Naimisharanya where he found many sages engaged in austerities. All the sages were delighted to see him. They eulogized him in reverence and offered him seat. Sage Narad narrated some amazing tales describing about the greatness of Linga Puran. This made the sages even more curious about Linga Puran. Right then, Sutji also arrived there and the sages requested him to narrate the tales of Linga Puran. After making salutations to lord Brahma, Vishnu, Mahesh and Sage Krishna Dwaipayan, Sutji said--- Sound is the medium through which the almighty Brahma manifests himself. Brahma manifests himself in the sacrosanct OMKAR mantra. Rigveda is his mouth, Samaveda his tongue, Yajurveda his neck and Atharvaveda is his heart. He is the Supreme Being and is beyond the reach of creation or deluge. He is one but manifests himself as three distinct deities---Brahma, Vishnu and Rudra. These three deities are the expression of the three natural qualities respectively-Rajas, Satva and Tamas. He manifests himself as Mahesh in his formless (Nirguna) identity. He manifests himself in all the living creatures as well as imperceptible things in the form of seven natural elements-Mahattatva (5 basic elements) Ahankara (ego), Shabda (Sound) Sparsh (touch), Roop (appearance), Rasa (taste) and Gandha (smell). Lord Brahma compiled the divine tales of Linga Puran. It covers wide range of subjects like the beginning of creation, the origin of universe, description of the time, tales of different Kalpas, the greatness of Linga and its worship, tales related with Lord Shiva, characteristics of Shiva temple etc. It specially elaborates upon the greatness of Shiva linga and its worship. FIRST CANTO PRATHAM SARG Shiva is both invisible as well as the root cause of all the delusions of the world. This is why Shiva is also known as Alinga (unknowable). Linga is nothing but the non-manifested (Auyakta) form of Shiva. This implies that the visible world is the medium through which Shiva manifests himself. Nature (Prakriti) in itself is devoid of qualities like smell, taste, touch etc. But, all these qualities become apparent in it only because of Shiva, who is imperishable and whose characteristics are the natural qualities like taste, smell, touch and sound. The whole world along with the gross and subtle has originated from Alinga Shiva. The whole world comes into being with the help of eleven components-10 sense organs and mind. It is pervaded by the delusions of 'Alinga Shiva'. The three prominent deities---Brahma Vishnu and Mahesh are the manifestations of Shiva. He is the creator in the form of Brahma, the nurturer in the form of Vishnu and the annihilator in the form of Mahesh. Nature is pervaded by the delusion of Shiva, which is also known as Ajaa (unborn). The three basic colour -red, white and black are the symbolic expressions of the three qualities Raja, Sat and Tamo respectively. Majorities of people fall prey to the delusions of this world and get entangled in its illusionary appearances, but there are few that understand the futility of this illusionary world. With the desire of beginning creation, the supreme Almighty manifest himself in the imperceptible which results into the creation of the Mahattatva (five basic elements). From Mahattatva manifests the ego or 'ahankara which comprises of three gunas. From Ego manifests the Tanmantras or subtle forms of matter- sound, form, taste smell and touch. Among these subtle forms of matter, Sound came into being first of all and space originated from it. The second tanmantra, touch originated from the space. Air manifested from touch or sparsh. The third tanmantra, form or roopa originated from air or Yayu. Fire or Agni manifested from roopa. The fourth tanmantra, taste or rasa manifested from Agni. Similarly, water or Jal manifested from Rasa, smell or Gandha from Jal and Earth manifested from Gandha respectively. All the five organs of action (Karmendriya) sense organs and mind originated from pure Ego (Satva ahankara). In course of time all these elements got transformed into a mammoth egg (Anda), inside which Lord Brahma manifested himself. The whole universe is said to be established inside the above mentioned egg. The egg is covered by seven layers and Lord Brahma dwells inside it, seated on a lotus flower. The mammoth egg contains crores of universes inside its fold. ", "next": "17.1.2", "prev": "17.1", "title": "Sutji Narrates the Divine Tales of Linga Purana"}