{"index": "17.1.14", "image": "resized_images/The Origin of Shiva Linga.png", "text": [" The sages asked Sutji--- Lord Shiva is formless then how come Shiva Linga is worshipped?", " What is the significance of Shiva Linga?", " What is the proper method of worshipping a Shiva Linga ?", " Sutji replied--- Once, Lord Brahma and Lord Vishnu developed serious different on the matter of superiority.", " A tremendous duel broke out between them.", " As they were fighting a mammoth Linga appeared on the scence, the effulgence of which made efforts both of them amazed.", "Both of them decided to find out the origin of that divine Linga.", " Lord Brahma transformed his appearance into that of a swan and flew up in the sky to determine the height of that Linga.", " Lord Vishnu transformed himself into a roar and entered the depth of earth to find the source of that Shiva Linga.", " But both of them failed in their objectives and returned to the same place exhausted.", " Suddenly, they heard a loud sound of AUM emanating from the Shiva Linga.", " Very soon, the whole form of OM, consisting of all the three letters A, U and M became visible.", " (The letters A, U and M symbolize Lord Brahma, Vishnu and Mahesh respectively).", " At last, both of them realized their mistake and stopped quarrelling.", " This way, Lord Shiva was successful in subduing their arrogance.", "Lord Rudra is beyond sensual perception.", " He is the supreme Almighty and the bestowers of divine bliss.", " The mystical form of Shivalinga is a symbolical expression of sacred mantra-AUM.", " The letter A symbolizes Beeja (Seed), M the creator himself and U is the symbolical expression of Yoni (Vagina).", " Lord Rudra is beyond sensual perception.", " He is the supreme Almighty and the bestowers of divine bliss.", " The mystical form of Shivalinga is a symbolical expression of sacred mantra-AUM.", " The letter A symbolizes Beeja (Seed), M the creator himself and U is the symbolical expression of Yoni (Vagina). "], "next": "17.2", "prev": "17.1.13", "title": "The Origin of Shiva Linga"}