{"index": "17.1.3", "image": "resized_images/The Origin of Creation.png", "text": " In the initial phase of his creation, Lord Brahma created immovable natural things like trees, mountains etc-then birds and animals. In the process of creation, he created various things and human being was his seventh creation. First of all Lord Brahma created his Manasputras-Sanak, Sanandan etc, who had no worldly desires. He then created the nine supreme sages---Marichi, Bhrigu, Angiras, Pulastya, Pulaha, Kratu, Daksha, Atri and Vashishth by the help of his yogic powers. After that, it was the turn of the twelve Prajapatis-Ribhu, Sanatkumar, Sanatan etc. All of them were divine, extremely virtuous and had realized the supreme - self, Brahma.Shatarupa had begotten four children from Swayambhuva Manu-Priyavrata, Uttanpad, Aakuti and Prasuti. Aakuti was married to a Prajapati named Ruchi, while Prasuti married Daksha. Aakuti gave birth to two children-Dakshina and Yagya. Dakshina had twelve sons.Prasuti-the youngest daughter of Shatarupa had begotten twenty four daughters from Yaksha-Shraddha, Lakshmi, Dhriti, Tushti, Pushti, Megha, Kriya, Buddhi, Lajja, Vapu, Siddhi, Keerti, Khyati, Sambhuti, Smriti, Preeti, Kshama, Sannati, Anusuya, Urja, Swaha, Sura Arani and Swadha. Thirteen of them were married to Dharma-a Prajapati. Khyati was married to sage Bhrigu while Arani married sage Bhargava. Similarly various sages like Marichi, Angira, Pulastya, Pulaha, Ritu, Atri and Vashishth got married with Sambhuti, Smriti, Preeti, Kshama, Sannati Anusuya and Urjaa respectively. Swaha was married to Vibhavasu while Swadha married the Pitrishwaras. Dharma had begotten all together 15 sons from his thirteen wives-Kaam, Darp, Niyam, Santosh, Alobha, Shrut, Dand, Samay, Body, Mahadyuti, Apramadd, Vinay, Vyavasay, Kshem, Sukh and Yash. Khyati-wife of sage Bhrigu gave birth to Shri who later became the consort of lord Vishnu. She also had two sons named Dhata and Vidhata. Prabhuti-wife of sage Marichi gave birth to two sons-Puranama and Maarich. She also had four daughters-Tushti, Drishti, Krishi and Apachi.Kshama-wife of Sage Pulaha had many offspring among whom Kardam & Sahishnu were prominent. Preeti, wife of Sage Pulastya had two sons named Dattarnavr and Dahvahu. She also had a daughter named Dwashdwati. Kratu's wife-Sannati had six thousand offspring who became famous as Baalkhilyas. Smriti-Wife of Sage Angiras had given birth to five daughters--- Sini, Vali, Kuhu, Raka and Anumati. Anusuya, wife of Sage Atri had six children-five sons and one daughter. The names of the sons were - Satyanetra, Bhavyamuni, Murtiray, Shanaishchar and Somatha.Urjaa, wife of sage Vashishth gave birth to seven sons-Jyayji, Pundarikaaksh, Raj, Suhotra, Bahu, Nishpaap, Shravan, Tapasvi and Shukra. Agni's consort Swaha gave birth to three sons-Pavamaan, Paavak and Shuchi. ", "next": "17.1.4", "prev": "17.1.2", "title": "The Origin of Creation"}