{"index": "17.2.5", "image": "resized_images/Incarnations of Shiva During Various Dvapar Yugas.png", "text": " On being enquired by Lord Brahma about his various incarnations, Lord Shiva said --- \"I shall incarnate as Shwet-Mahamuni during 1st Dwapar yuga of Vaivaswat manvantar.\n My abode shell is at Chhogal peak of Himalaya mountain.\n I shall have four disciples who will be proficient in the Vedas.\n\" \"I will incarnate as Sutar during second dwapar.\n At that time, Saddyojaat Prajapati will be holding he post of Vyas.\nI will have four sons-Dundubhi, Shataroopa, Richika and Keluma.\n\" \"During third dwapar and at the time when Sage Bhargav will be acting as a Vyas, I will take incarnation as Daman.\n I will have four sons-Vikrosh, Vikesh, Vipash and Paapnashak.\n\" \"During fourth dwapar and at the time when Sage Angira will be acting as a Vyas, I will take incarnation as Suhotra.\n I will have four sons-Sumukh, Durmukh, Durdhar and Duratikram.\n\" \"I will take incarnation as Kank during fifth dwapar and at the time when Sage Savita will be fulfilling the obligations of Vyas;\n I will have four sons-Sanak, Sanandan, Sanatan and Sanatkumar.\n\" \"During Sixth dwapar, I will take incarnation as Laugakshi.\n At that time Sage Mrityu will be holding the post of Vyas.\n My sons will be Sudhama, Viraja, Shankh and Padraj.\n\" \"Sage Shataritu will act as Vyas during Seventh dwapar.\n I will have four sons- Saraswat, Megh, Meghvah and Suvahan.\n\" \"Sage Vashishth will be the vyas during eighth dwapar.\n I will take incarnation as Dadhivahan.\n My sons will be-Kapil, Aasuri, Panch, Shikhomuni and Vashkal.\n\" \"Sage Saraswat will act as Vyas during nineth dwapar.\n I will take incarnation as Rishabh.\n I will have four sons-Parashar, Garg, Bhargav and Aangiras.\n\" \"The tenth dwapar will see Tripad fulfilling the duties of Vyas.\n I will incarnate as Bhavita Muni.\n I will have four sons-Bala, Bandhu, Niramitra and Ketu.\n\" \"Sage Trivat will be the Vyas during eleventh dwapar.\n I will take incarnation as Ugra.\n My sons will be-Lambodar, Lambaksha & Lambakesh.\n\" \"Sage Shatateja will perform the duties of Vyas during twelfth dwapar.\n I will have four sons-Sarvagya, Sambuddhi, Saadhya and Sarva.\n\" \"Dharma will be the Vyas during thirteenth dwapar.\n I will take incarnation as Bali and live at the hermitage of the Baalkhilya.\n I will have four sons-Sudhama, Kashyap, Vashishth and Viraja.\n\" This way, Lord Shiva elaborated upon his various incarnations till the period of twenty-eight dwapar, which went as follows.\n DWAPAR VYAS SHIVA SHIVA'S SONS 14th Tarakshu Gautam Atri, Devarudra, Shravan & Shrivishthak 15th Traiyyaruni Vedshira Kuni, Kunibahu, Kusharir & Kunetrak 16th Deva Gokarn Kashyao, Shukracharya, Chyavn & Vrihaspati 17th Kritanjay Guhavasi Utathya, Vamadev, Mahayoga & Mahabal 18th Ritanjay Shikhani Vachashrava,Richik,Shyavashva & Yateeshwar 19th Bhardwaj Jatamali Hiranyabh, Kaushal, Laungakshi & Kuthumi 20th Gautam Attahaas Sumantu, Varvari, Kavandh & Kushi Kandhar 21st Vachashrava Daruko Rampkshoda, Bhayani, Ketuman & Gautam.\n 22nd Shushmayan Langli Bheem Dharmik, Mahayotri, Bhallavi, Madhupinga,Shwetu, Ketu & Kush 23rd Trinabindu Kalanjar Ushik, Vrihadashva, Deval & Kavirevach 24th Riksha Shooli Shalihotra, Agnivesh, Unashva & Sharadvasu.\n 25th Shakti Dandi- Mundishvar Chhagal, Kundak, Kumbhand & Prawahaj 26th Parashar Sahishnu Ulook, Viddyut, Shambuk & Aashwalayan.\n 27th Jatuk Karnya Somsharma Akshapad, Kumar, Ulook & Vatsa.\n 28th Dwaipayan Lakuli Kushik, Garg, Mitra & Kaurushya ", "next": "17.2.6", "prev": "17.2.4", "title": "Incarnations of Shiva During Various Dvapar Yugas"}