{"index": "17.2.6", "image": "resized_images/Rituals of Shiva-Linga Worship (Purity).png", "text": " Once, Goddess Parvati asked Lord Shiva about the proper methods of worshipping Shiva-linga.\n While Shiva was elucidating upon the rituals, Nandi who was present there too got enlightened on this sacred topic.\n In course of time, this knowledge was passed on to Sanat Kumar, who in turn revealed it to Sage Vyas.\n Sutji came to know about it from Shailadi.\nLord Shiva had described the following three methods, by the help of which a devotee should become pure before commencing his worship.\n • Varun Snan (Taking bath in open) • Bhashma Snan (Smearing ashes on the body) • Mantra Snan (Chanting of mantra) Lord Shiva had stressed upon the importance of taking bath in a river or a pond.\n According to him a man's mind, which is like a lotus, could never blossom unless it received the radiance of the sun.\n Describing about the methods of taking Bhasmsnan, he said-After washing his hands and feet, a devotee should smear any of the following things on his body to make it pure-mud, cowdung ashes etc.\n While smearing mud on his body, he should chant the mantra - Uddhatashivarahen.\n After becoming pure according to the methods mentioned above, he should then worship Lord Varun.\n Having done, this, he should take a dip in the river after purifying the water by chanting the sacred 'Adhamarshan' mantra.\n He should then worship all the deities by sprinkling water from the Shankh (Conch) and amidst the chanting of mantras like 'Rudren Pavamanen' etc.\n He should then concentrate upon the form of a Shivalinga.\n He should drink some water holding some Kusha grass in his right hand simultaneously.\n A devotee should commence his worship only after becoming pure.\n In the beginning he should perform Pranayam for three times so that his lungs are filled up with fresh air.\n After this, he should concentrate his mind on the form of Lord Trayambak in all his glory.\n He should purify all the articles required for the worship by performing ablution and by chanting OM NAMAH SHIVAY.\n He should also make offerings of flowers, rice grains, barley etc.\n to the deity.\n Worship of Lord Shiva is believed to be incomplete without the worship of his family-Nandi, Kartikeya, Vinayak and Goddess Parvati.\n So, the devotee must not forget to worship them. ", "next": "17.2.7", "prev": "17.2.5", "title": "Rituals of Shiva-Linga Worship (Purity)"}