{"index": "17.2.2", "image": "resized_images/The Manifestation of Lord Brahma.png", "text": " The Sages requested Sutji to elucidate how Lord Brahma emerged from the navel of Vishnu seated on a lotus flower. Sutji replied--- At the time of deluge Lord Vishnu went in his yoganidra lying on the back of Sheshnag. As the result of his divine play, a huge lotus flower along with a long tubular stalk emerged from his navel. Lord Brahma was seated on the Lotus flower.When Lord Brahma saw Lord Vishnu, he asked-\"Who are you sleeping in this ocean?'' Lord Vishnu also asked the same question as to whom was he and from where had he manifested. Very soon, a quarrel ensures between them.Desirous of knowing the identity of the stranger, Lord Vishnu entered Brahma's abdomen through his mouth. He was amazed to find the existence of whole universe inside Brahma's abdomen. He remained there for thousands of year but could not find the end. Being exhausted, he came out and told Lord Brahma that even his abdomen had the same unlimited expanse. Lord Brahma decided to check the authenticity of Vishnu's statement and entered into his abdomen through the mouth. Lord Brahma wandered inside the abdomen for thousands of year but could not find the end. Mean while, Lord Vishnu has shut each and every opening of his body which made it impossible for Lord Brahma to come out. Ultimately he was successful in coming out through the tubular stalk of the lotus.As Lord Brahma was not amused by Vishnu's behaviour, he started fighting with him. Right at that moment, Lord Mahadev arrived there. His moments created high tide and strong mind, which vigorously shook the lotus flower. Lord Vishnu immediately realized that these signs forebode the arrival of Mahadev. He revealed this fact to Brahma and about Manadev's greatness. But Lord Brahma was not impressed. Lord Vishnu then said --- \"Shiva is the almighty God. He is the one, whom, enlightened people are always in search for. He manifests himself in the form of an egg on account of the union of his formless and with form appearances. In course of time the egg gets divided into two halves, from which are created the different Lokas (world). The egg is the very place from where originates the whole creation. Even you (Brahma) own your existence to that egg. Your arrogance might invite the wrath of Shiva. So, come let both of us eulogize and praise the holy name of Mahadev. ", "next": "17.2.3", "prev": "17.2.1", "title": "The Manifestation of Lord Brahma"}