{"index": "17.2.12", "image": "resized_images/Kshoopa Accepts Defeat.png", "text": " When Lord Vishnu appeared before Kshoopa, he sought his help in defeating Dadhichi. Lord Vishnu expressed his inability by saying--- I don't punish a Brahmin, especially if he is a devotee of Rudra. Dadhichi is both, so forget about defeating him. Anyhow, I will try me best to make Dadhichi devoid of his power. Lord Vishnu then went to Dadhichi's hermitage disguised as a Brahmin. Dadhichi recognized him and came to know about his intentions. He requested Lord Vishnu to go ahead with his demand. \"I have conquered fear on account of my total devotion in Lord Shiva\" said Dadhichi. Lord Vishnu did not like his arrogant behaviour. He said-\"I know you have conquered fear. But, just for once, say that you are fearful of me, as I am Vishnu.\" But, Dadhichi refused to obey his commands. This infuriated Lord Vishnu and he tried to kill Dadhichi with his Chakra. Dadhichi remained unharmed and said- How can this Chakra harm me? Lord Shiva has given whose devotee I am it to you whose devotee I am. Lord Vishnu tried to use his other weapons but failed to cause any harm to Dadhichi. All the deities came to his help but still their efforts of defeating Dadhichi went futile.Lord Vishnu then tried to impress Dadhichi by his divine powers and showed his divine appearance in which the whole world was visible. Dadhichi gave a befitting reply by showing the whole universe including Lord Vishnu within his body. Lord Vishnu was amazed by his divine powers. Ultimately, Lord Brahma persuaded Lord Vishnu to discontinue the fight. Seeing his lord in such a helpless condition, Kshoopa had no other option but to accept defeat. He tried to pacify Dadhichi anger by asking cursed him as well as all the deities by saying--- All of you including the deities and Vishnu will be destroyed in Daksha's yagya as the consequence of Rudra's wrath. The place where Dadhichi's hermitage was situated later on became famously known as Sthaneshwar. It is considered to be the most sacred place of pilgrimage. ", "next": "17.2.13", "prev": "17.2.11", "title": "Kshoopa Accepts Defeat"}