{"index": "17.2.7", "image": "resized_images/Lord Shiva Tests the Patience of Sages.png", "text": " Once upon a time, the sages were busy doing their penance to please Lord Mahadev.\n Lord Shiva decided to test patience and visited daruk forest in naked position.\n By the virtue of his divine power, he was successful in corrupting the conduct of the sage's wives.\n Those women became so infatuated by his divine appearance that they lost control omen themselves.\n They were desirous of satiating their lust but Shiva maintained silence and did not oblige them.\n When the sages saw the womenfolk in such a pitiable condition, they started abusing Lord Shiva.\n Lord Shiva did not respond and disappeared from the scene.\n Now, the sages became very frightened.\n All of them went to Lord Brahma and narrated the whole incident.\n Lord Brahma reprimanded them by saying that how unfortunate they had been in not recognizing Lord Shiva- the Almighty.\n Lord Brahma said-\"You have committed a grace sir by showing disrespect to your guest.\n Your conduct was unlike Sudarshan-a Brahmin who by his hospitality was able to win the lord of death.\n\" Lord Brahma narrated the following tale to them --- \"Once there lived a kind hearted Brahmin named Sudarshan.\n He was very hospitable and considered his guests, as Lord Shiva himself.\n He had given strict instructions to his wife that under no circumstance should a guest return unsatisfied from his home.\n\" \"Dharmaraj wanted to test Sudarshan firmness in his belief.\n One day he arrived at Sudarshan's hermitage disguised as a Brahmin.\n At that time he was not present in his hermitage.\n Dharmaraj refused to accept anything in donation except Sudarshan's wife herself.\n \"Sudarshan's wife offered herself without any hesitation.\n When he returned, not finding her wife started calling her name.\n At that time he heard a voice saying that his wife was satisfying the lust of a guest.\n Sudarshan remained unperturbed and requested his guest to carry on till he is satisfied.\n\" \"Dharmaraj became pleased.\n He appeared before Sudarshan and gave blessings.\n He appreciated his hospitable nature by saying that by the virtue of his undiluted hospitality he had even vanquished him (Dharmaraj).\n\" The sages were very ashamed of their conduct and returned Lord Brahma to explain as to how they could have devotion in Lord Shiva.\n Lord Brahma elucidated on the virtue of devotion and narrated the tale of sage Shwet who had subjugated even death by his devotion. ", "next": "17.2.8", "prev": "17.2.6", "title": "Lord Shiva Tests the Patience of Sages"}