{"index": "17.4.7", "image": "resized_images/Lord Brahma blesses the Demons.png", "text": [" The Sages asked Sutji as to how did Maya--The demon acquire three well fortified forts from Lord Brahma and how was lord Shiva finally successful in destroying them.", " Sutji replied-- After Tarakasur's death his three sons, Vidyunmali, Kamlaksha and Tarakaksha did tremendous penance to please Lord Brahma.", " When Lord Brahma appeared.", " They expressed their desire of attaining immortality.", " Lord Brahma refused to oblige them.", " The demons after consulting each other demanded three invincible forts from him and said 'Only such a person should be able to kill us, who is capable of destroying all the three forts with a single shot of an arrow.", "' Lord Brahma blessed them and disappeared.", " Maya, then did an austere penance and with the help of divine powers attained from it, constructed three forts at three different places.", " The fort made of gold was situated in the heaven, while the silver-fort was situated in the space.", " The third fort, which was made of iron, was situated on the earth.", " The gold-fort was given to Tarakaksha, the silver-fort to Kamalaksha and the iron-fort was given to Vidyunmali.", " After acquiring these invincible forts all the demons had become extremely arrogant.", " They started tormenting the deities.", " The deities went to Lord Vishnu and requested help.", " Lord Vishnu created thousands of spirits (Bhootganas) and instructed them to destroy those three forts.", " But, the Bhootganas were unsuccessful in their attempt and were charred to death.", " Lamenting their death the deities went to Lord Vishnu and sought help once again.", " Lord Vishnu was aware that the demons derived their power from Lord Shiva.", " So, He decided to deviate them from the path of Shiva's devotion.", " He then created an illusionary entity.", " The illusionary entity went to the place where demons lived and was successful in influencing them by his illusionary tactics.", " All the demons became so impressed by him that they stopped worshipping Lord Shiva and became His disciples.", " This resulted into a total degradation of moral values among the demons.", " Finding the time opportune, Lord Vishnu eulogized Shiva who appeared and agreed to destroy those three forts.", "Vishwakarma made a divine chariot for Lord Shiva and Lord Brahma became the charioteer.", " Mounted on that chariot, Lord Shiva proceeded towards the demon.", " All the deities followed him.", " Lord Brahma said---'Right now it is Pushya yoga and it is very auspicious for launching and it is very auspicious for launching an attack on the demon's forts.", "'Lord Shiva then released his arrow, which after destroying all the three forts returned to his quiver.", " The deities became pleased and eulogized lord Shiva. "], "next": "17.4.8", "prev": "17.4.6", "title": "Lord Brahma blesses the Demons"}