{"index": "17.4.4", "image": "resized_images/The Lineage of Aditya.png", "text": [" On being enquired by the Sages about the respective lineage of Aaditya (Sun) and Soma (moon) Sutji replied--- Sage Kashyap had a son--Aaditya, from Aditi.", " Aadity had four wives--Sangya, Rajyi, Prabha and Chhaya.", " Sangya gave birth to Manu whereas Ragyi was the mother of Yama, Yamuna and Raivat.", " Prabha gave birth to Prabhat while chhaya was the mother of three children--Savarni, Shani, Tapti and Vrishti.", " Chhaya was extremely affectionate towards her step son-- Yama.", " One day Yama kicked her in anger as a result of which his leg became inflicted with incurable disease.", " He became cured of his disease only after doing penance for thousands of years at as place called Gokarna.", " Manu had nine sons--- Ikshavaku, Nabhag, Dhrishnu, Sharyati, Narishyant, Naabhaag, Arisht, Karush and Prishaghna.", " He also had three daughters--Ila, Jyeshtha and Varishtha who coincidentally attained male physique later on in their life.", "Ila became famous as Sudyumna and had three sons-- Utkal, Gopa and Vinitashva.", " Harishwa was the descendant of Ikshavaku and had a son named Vasumana.", " Tridhanva was Vasumana's son.", " He had attained the designation of 'Ganapatya' by virtue of accomplishing one thousand Ashwamedha Yaga.", " Tridhanva had a son named Trayyarun and the name of his son was Satyavrata.", " The same Satyavrata became famous as Trishanku, who was the only person to attain to heaven with his mortal body.", " The most truthful king Harish Chandra was the son if Trishanku.", " Harish chandra had a son named Rohit.", " Sagar belonged to the lineage of Harish chandra.", " He had two wives-- Prabha had given birth to sixty thousand sons but Bhanumati had only one son named Asamanjas.", "Anshuman was the son on Asamanjas.", " Anshuman's son was Dilip.", " Sage Bhagirath was the son of Dilip.", " Some prominent personality who belonged to the lineage of Ikshavaku were Shrut, Naabhaag, Ambarish, Dirghabahu, Dilip (Dirghabahu's son), Raghu, Aja, Dasharath, Ram, Laxman, Bharat, Shatrughna, Lav and Kush.", " The famous king Pururava also cause from the same lineage.", " He was a great devotee of Lord Shiva.", " His son was Nahush.", " Nahush had six sons among whom Yayati was the eldest.", " Yayati had two wives--- Devayani and Sharmishtha.", " Yayati ruled over the whole earth.", " He had conquered the whole earth with the help of divine weapons and chariot which he had received from his father in law--Shukracharya (Devayani's father).", " Yayati had two sons from Devayani-- Yadu and Turvasu.", " He also had three sons from his second wife--Sharmishtha whose names were Drushya, Anu and Puru.", "Yayati appointed his youngest son Puru as his successor because of his total devotion towards his parent.", " Yadu was made the ruler of Southern province. "], "next": "17.4.5", "prev": "17.4.3", "title": "The Lineage of Aditya"}