{"index": "17.4.2", "image": "resized_images/The Origin of Deities.png", "text": [" On being enquired by the sages about the origin of deities, demons and other celestial entities, Sutji said-- Daksha being desirous of enhancing the population, created ten-thousand sons merely by his wish and instructed them to contribute in the propagation of population.", " His objective remained unfulfilled as Narad was successful in preaching them towards the path of devotion.", " As a result all of them went to do meditation after renouncing the world.", " Seeing his efforts go in vain, Daksha created ten thousand more sons who were convinced by Narad to the path of renunciation once again.", "Daksha then begot sixty daughters from his wife named Vairini.", " When these girls grew up, Daksha married to different sages--ten of them were married to Dharma, thirteen to Kashyap, twenty-seven to Soma, four to Arishtanemi, two to Bhrigu's son, two to Krishashwa and the remaining two were married to Angira.", " The named of Dharma's wives were Marutivati, Vasu, Aryama, Lamba, Bhanu, Arundhati, Sankalpa, Muhurta, Sadhya and Vishwabhamini.", "Vishwabhamini was the mother of Vishvedeva, while Sadhya gave birth to Sadhva.", " Similarly, Marutvati, Bhanu, Muhurta, Lamba and Sankalpa gave birth to Varutwan, Bhanav, Mahurtik Ghosh and Sankalp respectively.", " Vasu became the mother of eight Vasus.", " Among the twenty seven wives of Kashyap the names of some prominent ones were--Aditi, Diti, Arishta, Surasa, Muni, Surabhi, Vinata, Tamra, Krodha, Vasha, Ila, Kadru, Twishad, Anga etc.", "Kashyap had two sons from Diti, Hiranyakashipu and Hiranyaksha.", " Danu gave birth to one hundred sons among whom Viprachit was very prominent.", " Tamra gave birth to six daughters---Shuki, Sweni, Sugreevi, Gridhika, Bhasi and Shuni.", " Kashyap did an austere penance and was blessed with two sons--Vatsar & Asit, Vatsar had two sons--Naibudh and Raimbh.", " Asit married Ekparna and had one son from her--Brahmanishth.", "Vashishth was married to Arundhati and had one hundred sons from her among whom Shakti was the eldest.", " Shakti was married to Adrishyanti and Parashar was his son.", " Dwaipayan was the son of Parashar and Shukra was Dwaipayan's son. "], "next": "17.4.3", "prev": "17.4.1", "title": "The Origin of Deities"}