{"index": "17.4.12", "image": "resized_images/Shiv Tandav.png", "text": " The deities were curious to know the story behind 'Tandav'- the famous dance of Lord Shiva.\n So, they asked Sutji how it started and what made Shiva to perform Tandav.\n Sutji replied--- There lived a demon named Daruk.\n He had acquired divine powers by the virtue of his austere penance.\n He started tormenting te deities, sages and all the virtuous people.\nAll the deities went to Lord Shiva and requested him to give protection from the tyrany of Daruk.\n Lord Shiva then requested Parvati to help the deities.\n One part of Parvati's consciousness entered into the body of Lord Shiva.\n But, the deities were not aware of this happening.\n Goddess Parvati then attained her physical form with the help of poison stored in the throat of Lord Shiva.\n The effet of poison had made her complexion dark.\n Lord Shiva then brought her out from within his body through his third eye.\n The deities became frightened after seeing her terrific appearance.\n She was none other than Goddess Kali.\n Goddess Kali then killed Daruk with the permission of Parvati.\nBut, even after the death of Daruk, her anger did not subside and the whole world was ablaze due to her anger.\n Lord Shiva then incarnated as a small child and started crying as if he was hungry.\n Goddess Kali could not decipher the illusions of Shiva and thought that the child was crying because of hunger.\n She started feeding the child her breast-milk.\n In the process of sucking milk, Shiva also sucked out her anger.\n The extreme anger of Kali had resulted into the manifestation of eight divine entities who became famous as 'Kshetrapaal.\n After her anger had subsided Goddess Kali became unconscious.\n Lord Shiva then performed his famous dance--Tandav for the first time to bring Kali back to consciousness.\n He was accompanied by all the Ghosts and spirits in his terrific dance.\n When Kali regained her consciousness she found Shiva dancing.\n She too started dancing and this is the reason why she is also called Yogini. ", "next": "17.5", "prev": "17.4.11", "title": "Shiv Tandav"}