{"index": "17.4.3", "image": "resized_images/Sage Parashar.png", "text": " The Sages asked Sutji how Shakti had been devoured by a demon named Rudhir.\n Sutiji replied--- Once, Sage Vashishth was presiding over a grand Yagya being organized by a king named Kalmashpad.\n Vashishth had a rivalry with Vishwamitra.\n On seeing Vashishth busy in that Yagya, Vishwamitra instigated Rudhir-- a demon, to kill his sons.\n Rudhir followed the instructions and devoured Vashishth's sons including Shakti.\n When Vashishth learnt about his sons death his heart was filled with grief.\n He desired to give up his life but was prevented from doing so by his daughter-in- law.\n She informed him about her pregnancy and said-- Very soon you will see your grandson.\n So, quit the idea of giving up your life.\nVashishth, though still mournful of his son's death, postponed the idea of giving up his life for the time being.\n One day while he was engrossed in the thoughts of his departed son, he was amazed to listen the recital of a vedic hymn.\n He looked all around but found nobody.\n Suddenly he heard a heavenly voice that revealed by his grandson who was still inside the womb of his mother.\n In course of time, Arundhati gave birth to a son who was named Parashar.\n One day young Parashar curiously enquired from his mother as to why she did not put on ornaments like other women of her age do.\n Arundhati kept quite but when Parashar kept on insisting she revealed to him that it was not proper for a mournful women to adorn herself.\n She also told him how his father--Shakti had been killed by Rudhir, the demon.\n Parashar consoled Arundhati by saying that he would avenge his father's lord Shiva.\n He then made an earthen Shivalinga and started worshipping it by chanting the scared mantras of Shiva-Sukta and trayambak Sukta.\n Lord Shiva became pleased by his devotion and blessed him with a divine vision which enabled him to see his dead father.\n Parashar then commenced a yagya with the purpose of annihilating the demons.\n All the demons started being tormented by the extreme heat generated by that oblation.\n Vashishth prevented by that oblation.\n Vashishth prevented Parashar from contiuing with that Yagya as many innocent demons had suffered.\n Parashar stopped performing the rituals at his father's request.\n Sage Pulastya had also been invited in that yagya.\n He was very pleased by his devotion toward his father and blessed him with the knowledge of all the scriptures.\n In course of time, Parashar became famous for his treatise--Vishnu Puran. ", "next": "17.4.4", "prev": "17.4.2", "title": "Sage Parashar"}