{"index": "17.5.2", "image": "resized_images/The Greatness of Dwadashakshar Mantra.png", "text": " On being asked by the sages about the sacred mantra-- the chanting of which enabled a man to attain salvation Sutji replied --- Lord Vishnu gives salvation to those people who endeavour to seek Brahm-- the Almighty God. A man whose mind is preoccupied with the thought of Lord Vishnu and nothing else is entitled to attain Salvation. Such a man is also blessed by goddess Laxmi.\" Describing about the greatness of Dwadakshar mantra, Sutji said -- ''The sacrosanct Dwadakshar mantra consists of twelve letters (as written in devanagri script--'OM NAMO BHAGAWATE VASUDEVAY' ). This powerful mantra helps a man to achieve proximity with Lord Vishnu. 'Once there lived a brahmin who used to stammer while talking. All his efforts of making him speak distinctly went in vain as the child continued to lisp. When the brahmin tried to teach his son. the dwadakshar mantra, he incorrectly pronounced 'Vasudev as 'Etareva'. So the child was given the name 'Etareva'.The brahmin became disgusted and married for the second time. He had many sons from his second wife, all of whom were very studious. Etareva's mother used to curse her fate because of his habit of stammering. One day she said--'Look! I am no more able to tolerate the humiliation of being a mother of a dull child--Look at your step-brothers, who have achieved fame and respect on account of their learning. I have decided to give up my life.' Etareva became very sad. He started chanting the dwadashakshar mantra regularly and as a result a day came, when he could pronounce it correctly and without stammering. One day Etareva happened to pass by a place where a yagya was being performed. As soon as he reached that place, the priests found to their surprise that they had become dumb. All the priests became restless, as the rituals were still incomplete.Looking at their pitiable condition, Etareva chanted the dwadakshar mantra-- OM NAMO BHAGAWATE VASUDEVAY. The priest regained their power of speech by the virtue of the flawless pronunciation of the mantra. Such is the greatness of dwadakshar mantra. Later on, Etareva went on to become a renowned scholar. A person who chants this sacred mantra regularly become liberated from all his sins and attains to Vishnu Lok. ", "next": "17.5.3", "prev": "17.5.1", "title": "The Greatness of Dwadashakshar Mantra"}