{"index": "17.5.1", "image": "resized_images/Upamanyu.png", "text": [" The sages were curious to know how Lord Shiva had bestowed the designation of Gaanpatya and an ocean of milk to Upamanyu.", " They requested Sutji to shed light on the two incidents.", " Sutji narrated the following tale --- Upamanyu was a brilliant child.", " There is an interesting story how he became the supreme devotee of Lord Shiva.", " Once, during his childhood he had gone to his maternal-uncle's place.", " One day, while he was hungry he tried to drink some milk.", " But his cousin did not allow him to drink milk and after snatching the bowl of milk drank himself.", " Upamanyu started crying.", " He went to his mother who tried to console him by giving a solution of powdered grains.", " But, Upamanyu did not want anything less than milk.", " His mother said--'You should be satisfied with whatever you get.", " Perhaps we did not worship Lord Shiva in our past lives.", " Our hardships are the fallouts of those unpardonable sins.", " Only a devotee of Shiva is entitled to all kinds of comfort and pleasure.", "' Upamanyu decided then and there to please Shiva by his penance and attain an ocean of milk from him.", " He went to Himalaya mountain and started doing an austere penance.", " His penance had resulted into the generation of unbearable heat.", " The deities became terrified and went to seek the help of Lord Vishnu.", " Lord Vishnu along with the deities went to Lord Shiva and sought his help.", " Lord Shiva decided to test the devotion of Upamanyu.", " He disguised himself as Indra and went to the place where Upamanyu was doing penance.", " He started abusing Shiva which made Upamanyu so angry that he tried to kill him.", " When Upamanyu failed in his attempt to kill Shiva, he tried to kill himself by chanting 'Aagneya mantra'.", " Lord Shiva was very pleased by his total devotion and revealed his identity.", " He blessed Upamanyu and after accepting him as his son granted the designation of Ganpatya.", " He also provided oceans of milk and curd to Upamanyu. "], "next": "17.5.2", "prev": "17.5", "title": "Upamanyu"}