{"index": "18.18", "image": "resized_images/FLAGGING IN THE TEMPLE OF LORD VISHNU.png", "text": " Sanatkumar says:\n \"O Narad! Now I am narrating about the flagging fast in order to please Lord Vishnu.\n He who performs this fast is even worshipped by Brahma and other deities.\n This fast accords virtues equal to those of donating one thousand carats of gold to a Brahmin or those attained taking bath in the Ganges and worshipping Shivalinga and basil sapling.\n \" The devotee should observe this fast on the tenth day of the brighter phase in the month of Kartik.\n He should worship Shri Hari since morning after taking bath and wearing fresh clothes.\n He is expected to sleep before the idol that day.\n Next day, he should again perform worship, recite Nandishraaddh along with four Brahmins and bathe masts of the two flags.\n He should then worship the Sun, the Moon and Garud.\n Then turmeric, sandalwood paste are smeared on the masts and white flowers are offered on them.\n Thereafter, the devotee must smear just enough ground with cow dung and produce a fire in an altar.\n One hundred and eight oblations are made with kheer in this fire.\n Havan thus performed is directed to Lord Vishnu, Brahma and Lakshmi then eight oblations are offered reciting - VENTEYAAY SWAHA.\n It is followed by oblations offered to the Sun, the Moon and Kaamadhenu.\n The night is passed in worship and performing Havans.\n Next morning, the same rituals are performed to worship Lord Vishnu.\n At last, the flags are carried to a temple of Lord Vishnu and installed at the pinnacle or on top of a column.\n Lord Vishnu is worshipped with proper rituals.\n Circumambulating the temple, one should then present Brahmins with clothes and Dakshina, feed them and should take food after all.\n It is said that as long as the flag flutters in air, as much sins of the devotee are destroyed and he attains the abode of Lord Vishnu. ", "next": "18.19", "prev": "18.17", "title": "FLAGGING IN THE TEMPLE OF LORD VISHNU"}