{"index": "18.16", "image": "resized_images/DESCRIPTION OF DWADASHI FAST.png", "text": [" The sages say:", " \"O fortunate one! You have obliged us narrating the tale of sacred Ganges.", " Now we desire to hear what Narad asked Sanatkumar.", "\" Sutaji says:", " \"O great sages! Now I narrate what Narad asked Sanatkumar, listen to it carefully.", "\" Narad says:", " \"I am blessed hearing the pious tale of the Ganges.", " Now kindly tell me about the fast and rituals performing which, Shri Hari could be pleased.", "\" Sanatkumar says:", " O Narad! May God bless you! You are the supreme devotee of Lord Vishnu.", " That’s why, you are asking about these rituals.", " Now I am telling you about these rituals and fasts, which make a man fearless.", " O Narad! There is a special provision for worshipping Lord Vishnu on the twelfth day of Shukla Paksha (brighter phase) in the month of Maargashirsh.", " This worship could be performed wearing white or yellow clothes.", " During the worship, one should recite the mantra – KESHAVAAYA NAMASTUBHYAM.", " One should then offer oblations of ghee and sesame seeds in sacred fire.", " During the night, one should sing devotional songs before Shaligram and remain awakened.", " Then the idol of Vishnu should be bathed with five liters of milk.", " Similarly, Goddess Lakshmi and Lord Vishnu should be worshipped with Naivedya and edible items three times.", " Next morning, similar worship should be repeated.", " At the end of the worship, one should donate sweetmeats made of milk, ghee and coconut to Brahmin while reciting-‘May the Lord materialize all my wishes.", "’ Seeing off the Brahmin, one should break his fast at the end.", " On the same day, in the month of Pausha, one should observe a fast and worship Lord Vishnu’s idol bathing it with milk while reciting NAMO NARAYANA.", " In this worship also, there is provision of nightlong prayers and vigilance.", " Donating the Brahmins with rice, pulses, ghee etc.", ", one should respectfully feed them and break his fast in the last.", " Donation of Dakshina is a must.", " Similarly, on the same day in the month of Maagh, there is a provision of daylong fast and worship.", " This time, five kilos of sesame seeds are donated to the Brahmins.", " On the twelfth day of Shukla Paksha in Phagun, one should bathe Shri Hari’s idol with five liters of milk.", " Then one hundred and eight oblations of sesame seeds and ghee are made to the sacred fire.", " Nightlong prayers, feeding of Brahmins etc.", " are as usual.", " In this worship, unhusked rice is donated.", " The required mantra is GOVINDAAY NAMASTUBHYAM On the same day in the month of Chaitra, there is a provision of bathing Vishnu’s idol with five liters of ghee and making oblations of honey, ghee and sesame seeds one hundred and eight times while reciting - NAMOSTU VISHNAVE TUBHYAM Then four kilos of rice are donated to a Brahmin.", " On the twelfth day in the brighter phase of Vaishaakh, there is a provision of bathing Vishnu’s idol with milk and making one hundred and eight oblations of ghee reciting - NAMASTE MADHUHANTE On the twelfth day in the brighter phase of Jyeshtha, there is a provision of offering one hundred and eight oblations of kheer (rice cooked in four liters of milk) while reciting NAMAH TRIVIKRAMAAY.", " Twenty Maalpuas (wheat flour kneaded in milk and sugar and fried in ghee) are donated to a Brahmin.", " On the same day in the month of Ashaadh, Lord Vishnu’s idol is bathed with four liters of milk.", " Then oblations of ghee are made and cereal mixed with coconut and curd are donated to the Brahmins.", " This worship is directed to Vaaman incarnation of Lord Vishnu.", " Hence, mantra NAMASTE VAAMANAAY is recited all along the rituals.", " In the month of Shraavan, there is a provision of bathing Lord’s idol with milk and honey on the twelfth day of the brighter phase.", " Then one hundred and eight oblations are made reciting – SHRIDHARAAY NAMOSTUTE.", " Then four liters of milk, clothes and two golden earrings are donated to the Brahmin.", " Lord’s idol should be bathed with milk while reciting - HRISHIKESH NAMOSTUBHYAM on the twelfth day in the month of Bhaadrapad.", " Then one hundred and eight oblations are made with cooked cereals mixed with honey.", " Wheat donated along with gold to the Brahmins besides feeding them with respect.", " In the month of Ashwin also, Lord’s idol is bathed with five liters of milk.", " Then, one hundred and eight oblations are offered with ghee, sesame seeds and rice reciting - NAMASTE PADMANAABHAAY.", " Two hundred and fifty grams of honey are donated to a Brahmin.", " In the month of Kartik, on the same day, Lord’s idol is bathed with four liters of milk, curd or ghee while reciting- NAMO DAAMODARAAY.", " Then, one hundred and eight oblations are offered with sesame seeds mixed with honey and ghee.", " This worship is closed with donating five types of edible items to a deserving Brahmin, feeding him and seeing him off with Dakshina.", " O Munivar! Those who observe this virtuous fast for the twelve months of a year attains to the supreme abode.", " Observance of this fast for one or two months only is also equally benefiting.", " If this fast is observed for a year, there is a provision of special closing ritual at the end so that one shouldn’t have to observe it again in his life.", " This closing ritual is performed on the twelfth day of the darker phase in the month of Maargsheersh.", " One should get up early in the morning that day and after attending routine tasks;", " he should take bath, wear white clothes, smear sandalwood paste on the forehead and make a square-shaped altar on the ground.", " This altar should be decorated with jingling bells, whiskers, flags and white cloth.", " On the four corners of the altar, four lamps should be lighted.", " At the center of the altar, a Sarvatobhadra wheel is drawn and twelve urns filled with water are kept on it.", " Putting five kinds of gems in these urns, they should be covered with white cloth.", " The worshipper must procure silver or gold idols of Lakshmi and Lord Vishnu and place them on the lids of the urns.", " Frugality is not expected in this ritual.", " These idols should be bathed with milk containing ghee, honey, curd and five types of dry fruits.", " It should be followed with proper worship of Lord Vishnu and Goddess Lakshmi.", " These rituals last nightlong.", " Next morning, oblations are offered with sesame seeds reciting all the twelve mantras described above.", " Donation of ten Maalpuas, curd, kheer, ghee etc.", " are made to twelve Brahmins.", " At last, all the idols and other materials are handed over to the priest who had guided the worship.", " Devotee must dine after all and he should not speak during dining.", " All the desires of the one who observes all these twelve fasts and closes them properly are fulfilled and he attains abode of Vishnu along with his twenty-one generations. "], "next": "18.17", "prev": "18.15", "title": "DESCRIPTION OF DWADASHI FAST"}