{"index": "18.12", "image": "resized_images/DESCRIPTION OF RELIGIOUS ACTION.png", "text": " Dharmaraaj says:\n \"O king! Those who build temples with earth stay in the abode of Vishnu for three kalpas.\n Then they attain Brahmaloka.\n One receives double virtues if he builds a temple with wood.\n Building a temple with bricks and stones gives four-fold virtue while with the precious stones one gets ten-fold virtues.\n Building of temple with copper and gold gives hundred fold and crore fold virtues.\n Those who preserve temples and reservoirs receive hundred times more virtues than the builders do.\n Virtues of a rich man donating whole estate and a poor person donating a yard of land are equal.\n\" \"O virtuous one! Those who develop gardens and parks also receive same virtues.\n Those who preserve them receive more virtues than the developers.\n One who plants a basil sapling salves his crores of ancestors.\n Similarly, those who bathe the Lord’s idol with milk on Dwadashi and Poornamaasi salve millions of their ancestors.\n Those who bathe Lord’s idol with Panchamrit on Ekadashi receive everlasting joy and salvation.\n Similarly, those who bathe Lord’s idol with coconut milk, sugarcane juice, and water containing flowers or filtered water get free from all their sins.\n Similarly, those who bathe Lord Vishnu’s idol during eclipses or on auspicious dates and conjugations receive the virtue of all the Yagyas.\n Those who bathe Lord Vishnu’s and Shiva’s idols with coconut milk, ghee, honey and sesame oil on auspicious dates assume respective appearances of these gods.\n\" \"Those who worship Lord Vishnu and Shiva offering them flowers of lotus, Pandanus, and particularly offer Dhatura to Lord Shiva attain their respective abodes.\n Similarly, donation of Guggul (scented raisin), lamp, water and cereal bears inexhaustible fruits.\n Virtues of donating land and milch cow to a Brahmin cannot be described in words.\n It is the case with the donation of knowledge, Shaligram, Shivalinga, horse, buffalo, elephant or any other vehicle.\n Those who arrange for the cremation of an orphaned Brahmin receive virtues equal to thousands of Ashwamedha Yagyas.\n Those who serve the Brahmin deities or cow, those who play instruments, bell, and blow conch or clap in the temple enjoy intimacy with divine beauties in the heaven for five Kalpas.\n Blowing of conch helps one attain the abode of Vishnu.\n Even the remembrance of Lord Vishnu’s name does away with the imminent crises.\" ", "next": "18.13", "prev": "18.11", "title": "DESCRIPTION OF RELIGIOUS ACTION"}