{"index": "18.10", "image": "resized_images/ORIGIN OF THE GANGES.png", "text": " Narad says:\n \"O brother! You narrated a wonderful tale.\n Now, kindly relate to me, how did the Ganges originate?\n\" Sanatkumar says:\n O Narad! Pleased with the severe penance of Aditi, Lord Vishnu appeared before her and asked her to seek a boon.\n Feeling elated with exhilaration, Aditi fell flat at the Lord’s feet.\n She intimated the Lord about the plight of her sons and sought that He should help them to regain the heaven without killing the demons for they were also her sons though step.\n Pleased by her indiscrimination for her stepsons, Lord Vishnu assured Aditi that soon He would arrive as her son and salve the gods from their miseries.\n Then, the Lord presented Aditi with His garland and disappeared.\n In due course of time, Aditi gave birth to a son who was holding a conch, a wheel, a mace and a lotus in each of his four hands.\n The child was named as Vaaman.\n Even his father, sage Kashyap greeted him with respect.\n By the time, when the thread ceremony was about to be carried out for Vaaman, king Bali organized a grand Ashwamedha Yagya in the auspices of his teacher Shukracharya.\n Lord Vishnu Himself had been invoked in the Yagya along with Lakshmi.\n Taking his parent’s permission, Vaaman too arrived at the sight of the Yagya.\n With their divine sight, all the sages who were present there recognized Lord Vishnu and felt extreme joy and greeted Him with respect.\n Even Shukracharya understood the motive of Vaaman’s coming there.\n He cautioned Bali in isolation not to grant any demand of Vaaman.\n He also advised Bali to abide by his dictate or he would have to face severe consequences.\n But illumined by the destiny, king Bali did not pay heed to Shukracharya’s advice and welcomed Vaaman warmly and asked him to seek anything he wished.\n Vaaman said:\n \"O king! If you want to give me something, kindly grant me three steps of land so that I may carry out my Yagyas smoothly.\n King Bali tried to dissuade Vaaman with temptations of heavenly comforts and other luxuries.\n But Vaaman stayed to his demand that he needed nothing else but three steps of land for carrying out Yagyas.\n At last Bali agreed to grant his demand.\n He requested Vaaman to pour some water from the Kamandalu on his palm so that he could take a vow.\n As the last attempt to prevent Bali from making a vow, Shukracharya assumed a miniature appearance and clogged the snout of the kamandalu.\n The omniscient Lord pricked the snout with a sharp stem and pricked Shukracharya’s one eye.\n Thereafter, taking some water on his palm, king Bali proceeded to grant Vaaman three steps of land.\n As soon as Bali granted the demand, Vaaman assumed a gigantic appearance and measured the entire earth and heaven in his two steps.\n While Lord Vishnu was measuring the universe, it broke into two pieces with the impact of His toe.\n With the tearing of the universe, millions of streams sprang out.\n In the course of their flow, these streams merged into a single mightier stream and, sanctifying Brahma and other deities, fell on the mighty Sumeru Mountain (Himalayas).\n As there was no other room left for the Lord to put His third step, Bali presented his own head for the purpose.\n Vaaman put his third step on Bali’s head and pressed him down into the hades.\n Narad says:\n \"O great sage! How did the Lord arrange for Bali’s food in the nether world?\n\" Sanatkumar says:\n \"Oblations offered without hymns and alms given to undeserving person constitute the food for Bali.\n Thus, the Lord snatched the kingdom of heaven from Bali without any bloodshed and returned it to the gods.\" ", "next": "18.11", "prev": "18.9", "title": "ORIGIN OF THE GANGES"}