{"index": "18.15", "image": "resized_images/DESCENT OF GANGES AND SALVATION OF SAGAR’S SONS.png", "text": [" Narad says:", "\"O Muni! What did king Bhagirath do on Himalayas?", " How did he please Ganges to descend on the earth?", "\" Sanatkumar says:", " O Narad! Renouncing all his royal comforts, Bhagirath went to the snow-capped, lofty peaks of the Himalayas.", " There he saw dense forest and herds of deer and elephants playing.", " Even his hermitage was full of sweet chattering of the birds.", " Reciting of Vedas and other scriptures was reverberating all around.", " Bhagirath came face to face with the sage Bhrigu who was surrounded by his disciples.", " Bhagirath approached and respectfully greeted the sage Bhrigu.", " Bhagirath says:", " \"O omniscient sage! Kindly grace me with the knowledge of the path that leads even the most mournful souls to salvation.", "\" Bhrigu says:", " \"O king! I know that you have arrived here with a beautiful motive of salving your ancestors.", " Hence, you are like Shri Hari yourself.", " Now, I describe about the actions, which please Shri Hari.", " O king, be non-violent, altruistic, virtuous, speak truth and seek pious company to be a devotee of Lord Vishnu.", " Recite the following mantras- AUM NAMO BHAGWATE VAASUDEVAAY NAMAH | AUM NAMO VAASUDEVAAY You will definitely attain peace of mind.", "\" Bhagirath says:", " \"O sage! What is truth?", " What is in the interest of all the living beings?", " Who are evil ones?", " Who are ascetics?", " What are virtuous actions?", " How should one remember and worship Lord Vishnu?", " What is peace?", " O great sage! Kindly describe about these things.", "\" Bhrigu says:", " \"O knowledgeous one! All such actions, which do not harm any living being, are non-violence.", " Actions, which aid in moral conduct and pacify the people, are in the interest of the public.", " All the people who are envious and oppose the religion and the scriptures are evil ones.", " Those who tread the path shown by religion and scriptures and always engage in the benefit of people are ascetics in the true sense.", " All the actions, which lead to devotion for Lord Vishnu and cause extreme joy for all are virtuous.", " Lord Vishnu incorporates all the other deities.", " Having such thoughts like ‘I will worship Him with correct methods’ is devotion.", " Seeing Lord Vishnu in each living and non-living things is impartial view.", " To be in peace and harmony in all circumstances with each and everyone is peace.", " O king! I have described now all the things to you.", " Go now and begin your penance.", " May it all be well for you.", "\" Thus, with the permission and blessing of sage Bhrigu, king Bhagirath started his penance.", " He continued his penance for sixty thousand years at length in an enchanting place Naandeshwar in Himalayas.", " Seeing his severe penance, and perplexed by its radiance, all the gods appeared before Lord Vishnu in Ksheersagar.", " The gods say:", " \"O remover of sorrows! O controller of all the three worlds! We all greet you.", "\" Pleased by the prayers, Lord Vishnu instinctively learnt about the motive of the gods.", " He assured them to be fearless and Himself appeared before Bhagirath.", " Bhagirath felt hilarious and greeted Shri Hari.", " Lord Vishnu says:", " \"Your desires shall be fulfilled.", " Your ancestors shall attain to my abode.", " But now go and pray Lord Shiva with your full capacity.", " He will definitely benefit you.", "\" Saying this, Lord Vishnu disappeared.", " The king stood there for some time wondering whether it was all a dream when an invisible voice announced, ‘it was not a dream O king! It is reality.", " Do as Lord Vishnu has said.", "’ King Bhagirath began even more severe penance to please Lord Shiva.", " After a prolonged penance, Lord Shiva appeared there.", " Bhagirath fell flat at His feet.", " Pleased by his devotion and prayers, Lord Shiva blessed Bhagirath that He would hand over the Ganges to him for the salvation of his ancestors.", " As soon as Lord Shiva uttered these words, the Ganges emerged from His tussocks and followed Bhagirath wherever he walked.", " Thus, following Bhagirath, the Ganges reached Gangasagar at the hermitage of sage Kapil where the ashes of Bhagirath’s ancestors were lying unattended.", " As soon as the holy waters of the Ganges touched the ashes, Bhagirath’s ancestors got freed from the noose of Yama and ascended to their heavenly abode. Since then, the Ganges is also known as Bhagirathi. "], "next": "18.16", "prev": "18.14", "title": "DESCENT OF GANGES AND SALVATION OF SAGAR’S SONS"}