{"index": "18.14", "image": "resized_images/TORTURE IN THE HELL.png", "text": " Dharmaraaj says: \"O king! Those who commit severe sin on earth are bound to suffer equally severe torturing in hell. I am now describing about such sins and the tortures vouchsafed for them in the hells. Tapan, Balukaakumbh, Maharaurav, Raurav, Kumbhipaak, Pramardan, Lalabhaksha, Vasaakup and Vaitarni are some of the prominent hells. Drinking of urine in a ditch full of feces, eating of canine flesh, eating of worms, drinking of semen, sleeping on cinders, stinging by snakes, boring through bones, drinking of bile, biting by ants, breaking of teeth, tethering to hot iron etc. are some of the tortures one has to face for his sins in the hell. Those who criticize Brahmins and dictate them or kill them, drinker, those who steal gold, have illicit contact with the wife of their teacher and even those who accompany such people are condemned as great sinners. All of them deserve a place in the hell.\" Stealing of items like copper, iron, water, musk, betelnut, sandalwood etc. is also like the crime of stealing gold. Illicit contact with sister and daughter-in-law and forceful copulation with a woman in menses are also like having illicit contact with the wife of the teacher. Our great sages have given dictates for the expiation of such sins. Those who live in Buddhist monasteries or frequently visit there live in the hells for crores of years. Sinners pass initial phase of their expiation in the hells. For the seven births then, they take incarnation as asses. Then for the next six births, they appear as snake, diseased people, dog, deer, tree and monitor. O king! Those who long for and have illicit contacts with women other than wife are forced to copulate with a pretty but extremely hot copper mannequin and then thrown into the hells. Those women who prefer to sleep with men other than husband are forced to embrace hot iron statue on a blazing bed. Then they are forced to embrace a hot iron pillar, take bath in saline water, and drink it. They have to suffer these tortures for thousand years. Those who listen to other’s criticism with interest have to bear lot of suffering. Hot nails are hammered into their ears. The pores thus formed are filled with boiling oil. They are then thrown into Kumbhipaak hell. Those who abuse Lord Vishnu and Shiva are fed with salt only for crores of years then they are thrown into Raurav hell, which is full of hot scorching sand. Traitors and greedy of other’s cereals have to eat their own flesh. Those who eat astrologer’s and priest’s cereals are kept in different hells for crores of years followed by their keeping in the wells of boiling oil and saline water where they are fed with feces only. At the completion of their punishment, such people appear as Malechchha on earth. Those who torment others are thrown into Vaitarni. Those who do not perform Panchmaha Yagya or worship deities are kept in Lalabhaksha and Raurav hells respectively. Those who do not act as per the scriptures are thrown into the hells for thousand crores of Kalpas. Those who throw excretion from their bodies or leave parts like hair, tooth, bone, nails etc. in the temple commit sins equal to killing an unborn baby. They are subjected to severe tortures in the hells before being sent into abhorrent incarnations. Those who give false witness undergo sufferings in the hells till the rules of fourteen Indras. Those who do not curb immoral traffic despite being capable go to hell. Those who falsely blame gentlepeople have to live in the hell for crores of years. Those who give up a fast before stipulated period go to the hell named Asipatra. There is no penance for the ones who adopt partial view during justice or religious education. Those who consume cow’s flesh live in Vingbhojya hell for thousands of years. Those who torture Brahmins through their thoughts, actions and words always fall in the hell. Those who destroy gardens have to suffer all the above mentioned hells. O king!\" One must repent for his sins before Lord Vishnu. Sight of the Ganges and basil, singing of devotional songs, magnanimity and non-violence attenuate the effect of the sin. No action bears fruit if not offered to Lord Vishnu. Devotion to Lord Vishnu is the excellent way to repent for the sins. Abidance to morality is the best way to train the religion. Religion without morality is equally painful. O king! Now I have related all about religion. Since now onwards, cultivate devotion for Lord Vishnu and invoke the Ganges to descend on earth in order to salve your sinister ancestors. Only the Ganges is capable of salving one and all.\" Sanatkumar says: \"O Narad! Thus preaching the king Sagar, Dharmaraaj disappeared from the sight. It was due to the severe penance of king Bhagirath that the Ganges descended on the earth and salved the sixty thousand deceased sons of Sagar.\" ", "next": "18.15", "prev": "18.13", "title": "TORTURE IN THE HELL"}