{"index": "18.17", "image": "resized_images/DESCRIPTION OF FAST FOR LAKSHMINARAYANA.png", "text": [" Sanatkumar says:", " \" O great among the sages! Now I am narrating about an excellent fast, which destroys all the sins.", " Observing fast on full Moon day is considered excellent among all the fasts.", " It leads to fulfillment of all the desires and protects the devotee from influence of harsh planets.", " Like the fast of Dwadashi, this fast is also begun from the month of Maargsheersh and observed continuously on every full Moon day of succeeding months till Kartik when it is closed with proper rituals\".", " To begin with, one should start worshipping Lord Vishnu since the morning of full Moon day in the month of Maargsheersh wearing white clothes and reciting NAMO NAARAAYANAA.", " After the worship, the devotee must perform a Havan on a square-shaped altar offering oblations with cooked cereals, sesame seeds, ghee etc.", " White flowers, unbroken rice grains and water are offered to the Lord.", " In the evening, the same things are offered to the rising full Moon also.", " A devotee must pass the night engaged in religious discussion, singing of devotional songs etc.", " Next day, donations are made to the Brahmins after performing usual worship.", " The same rituals are performed every month to observe the fast.", " Rituals for closing this fast in the month of Kartik on full Moon day are also elaborate.", " First of all, the devotee should build a rectangular canopy and decorate it with floral garlands, arches, lamps, cinnabar, mirrors, whiskers etc.", " At the center of the canopy, on the ground, Sarvatobhadra wheel should be drawn with five pillars.", " Then one to twelve urns are kept on this wheel and on these urns, silver or golden idols of Lord Vishnu are placed.", " These idols are bathed with milk containing curd, ghee, honey and five types of dry fruits.", " Then a proper elaborate worship is carried out for these idols.", " Night is passed singing devotional songs.", " Next morning, after proper worship, these idols are donated to the presiding priest.", " It is followed by feeding of Brahmins.", " All these rituals are closed with performing a Havan offering sesame seeds as oblation.", " Those who perform these worships with proper rituals enjoy worldly comforts lifelong and attain abode of Lord Vishnu. "], "next": "18.18", "prev": "18.16", "title": "DESCRIPTION OF FAST FOR LAKSHMINARAYANA"}