{"index": "18.13", "image": "resized_images/EXPIATION FOR THE SINS.png", "text": [" Dharmaraaj says:", " \"O king! I am now going to narrate about the religion.", " Listen to it faithfully.", " If a person touches or gets touched by an impure or irreligious thing, he should observe fast for three days and six nights for expiation.", " He should take bath thrice a day.", " If a Brahmin defecates during dining, he must give up his food at once and take water only.", " Then he should observe a fast for a day and night and close it taking Panchgavya only to get pure again.", " If a person dines immediately after urination, or urinates during dining, he must observe a day and night long fast and close it with Havan.", " Those women who do not serve their husbands should be expelled from the home for a period of twelve years and should not be helped in any way during the exile.", " Impurity resulted because of touching a woman in menses takes fast for three nights to get purified.", "\" Dead body of a person who had committed suicide should be smeared with sandalwood paste or any other holy material.", " If a person escapes an attempt to suicide, a fine of two hundred rupees should be imposed on him.", " Those who deliberately eat cereals of washers, skinners and other downtrodden classes and tribes or have illicit contacts with their women are required to observe Chandrayan fast in order to get pure.", " For those who establish abhorrent connection with their mother, sister or daughter, self-immolation is the only way to expiate.", " Those who mate with their teacher’s wife formal observance of fast is required.", " If someone has killed a pregnant cow, he must expiate for it observing Chandrayan fast separately for each of the animals.", " One should not use the soil collected from pond’s bottom, termite’s mound, mouse burrow, barren land, road, cremation ground and ground used for defecation purpose.", " Use of Panchgavya washes even the most severe sin.", " If a second death occurs in the family while the purification period of first death is still on;", " separate purification is not required.", " Ill effect of an abortion lasts for three days.", " After marriage, a woman adopts her husband’s name.", " Hence, oblation for a married woman must be offered by her son or someone belonging to her husband’s clan.", " Ashes must be collected on the first, second, third or fourth day after the cremation.", " One must offer watery oblations to his dead ancestors standing in navel-deep water facing south. "], "next": "18.14", "prev": "18.12", "title": "EXPIATION FOR THE SINS"}