{"index": "18.11", "image": "resized_images/DEFINITION OF DHARMA.png", "text": " Narad says:\n\"O great sage! I have just heard the tale of sacred Ganges.\n Now kindly describe about the people who deserve to take donations.\n\" Sanatkumar says:\n O Narad! Brahmin is considered as the excellent among all the four castes.\n Hence, to make the donation fruitful, one should donate to the Brahmins only.\n A Brahmin can accept donation candidly but not a Vaishya or a Kshatriya.\n Even among Brahmins, there are many categories who do not deserve to accept donation.\n These are- Brahmins who practice astrology, act against the religion, who are greedy, who sell scriptures and other religious materials, who have relations with other women than their wives, who are envious, ungrateful, singer, who have characterless wife, who are soldiers, priests, harbinger, cook, poet, doctor, who eat meat and cereals given by a Shudra, who carry out cremation and the Brahmins who consume the food given by prostitutes.\n Donation given to all these types of Brahmins go futile.\n Besides these, Brahmins who habitually enjoy sensual pleasures during siesta, who dine during the dusk, who have been boycotted by their brothers and society, who have taken birth illegitimately or after the death of their real father because of dubious relations of their mother, whose younger brother have married earlier and those who are always controlled by lusty women, who act as pimps or remain indulged in mean activities also do not deserve donation.\n Donation, spending to meet necessities and wasting in useless activities are the three fates of wealth.\n A donation made selflessly to a deserving person on a request is excellent among all kinds of donations.\n A donation made with some desire is mediocre while donation given as sacrifice is of the lowest category.\n Sanatkumar then narrated the tale of Bhagirath and Dharmaraaj.\n Once, Dharmaraaj visited the kingdom of king Sagar.\n Dharmaraaj praised Sagar overtly.\n With folded hands, king Sagar requested Dharmaraaj to preach him about religion and non-religion and tell him something about divine worlds and hell.\n Dharmaraaj says:\n\"O king! Providing a Brahmin family or a Vedapathi Brahmin with a means of sustenance is the most virtuous donation.\n Inspiring others to make donation to such a Brahmin is also equally fruitful.\n Apart from these, digging out reservoirs and maintaining them and inspiring others to do the same thing also bears unending fruits.\n\" To corroborate his point, Dharmaraaj narrated the tale of king Veerbhadrak and his minister Buddhiraaj. ", "next": "18.12", "prev": "18.10", "title": "DEFINITION OF DHARMA"}