{"index": "18.19", "image": "resized_images/TALE OF KING SUMIT’S PREVIOUS BIRTH.png", "text": " Narad says:\n \"O Sanatkumar! A king Sumit had performed this flagging fast for the first time.\n Kindly narrate to me the tale of his life.\n\" Sanatkumar says:\n During Satayuga, a Somavanshi king Sumit was ruling the entire earth.\n He was very religious in nature and a great devotee of Lord Vishnu.\n He served the other devotees with respect and was a down to earth person.\n His queen Satyamati was also a chaste woman.\n Both of them were the great worshippers of Shri Hari and knew everything about their previous birth.\n They regularly donated cereals and water.\n Satyamati used to dance in the temple of Lord Vishnu with pure feelings.\n The king also would install a big and beautiful flag in the temple on the twelfth day of brighter phase of every month.\n Their reputation had reached all the three worlds.\n One day, a sage Vibhaandak came to visit the king along with his disciples.\n The king and the queen treated the sage with respect and the king himself seated on a lower seat before the sage.\n The king says:\n \"I am salved O sage! Now order me how can I serve you?\n\" The sage says:\n \"O king! I am very much pleased with you.\n Now I will ask you a few questions.\n Answer them honestly.\n You regularly install a big and beautiful flag in the temple of Lord Vishnu whereas there are many more rituals to please Him.\n Tell me the reason for your actions.\n\" The king says:\n \"O sage! I tell the reason for my action.\n Kindly listen to it.\n In the previous birth, I was a Shudra named Maalini and always engaged in appalling activities.\n One day, I abandoned my family and society and migrated to the forest where I sustained myself on deer’s flesh.\n But there too, I used to rob the passersby.\n One day, I had nothing to eat nor could I lay my hand on any passerby.\n Scorching sun of the summer was adding to my woe moreover.\n Thus perplexed by the thirst, hunger and intense heat, I was roaming in the forest when all of a sudden I stumbled upon a temple of Lord Vishnu.\n It had long been deserted and was very much in dilapidated condition.\n A small lake was also there beside the temple.\n In the lake, beautiful birds like swan and ducks were playing and delicious fruits and scented flowers also abounded in the forest.\n Since I was feeling tired to the point of dropping down, I ate the fruits which had fallen on the ground.\n Then I took rest at the bank of the lake.\n Since that day, I began to live in that temple.\n There I repaired the walls, cleaned the premises and erected a small hut for myself.\n But still, I used to hunt small animals to satisfy my hunger.\n Twenty years passed like that.\n One day, a Saadhvi (a female hermit) named Avakokila, who hailed from a Nishaad family in Vindhyaachal, came there.\n Her family members had deserted her because of sinister actions she was involved in.\n She was thin and lean due to continuous starvation.\n Feeling pity on her, I gave her some fruits and flesh to eat.\n When she recovered, she narrated her tale that I am narrating to you as it was.\n\" Saadhvi says:\n \"I was born in the family of oarsman, Daaruk was my father.\n I was a great backbiter, thief and sinner.\n My family therefore deserted me.\n For sometime, my husband fostered me but he too died.\n Since then, I have been wandering from this place to that and it is because of Lord’s grace that I have arrived here.\n\" The king says:\n \"Listening to her tale, I married her and we began to live in the temple.\n Every day we used to eat flesh and fruit.\n One day, under the intoxication of wine, we enjoyed our time greatly.\n We even began to dance forgetting our physical condition.\n Suddenly, agents of Yama arrived there and began to tighten their noose around us.\n Simultaneously, Shri Hari too sent His agents.\n\" Vishnu’s agents say:\n \"O imprudent Yamadoots! Release this great devotee of Lord Vishnu.\n Yamadoots say:\n \"These are abject sinners.\n We will definitely take them with us.\n\" These words infuriated the agents of Vishnu.\n Vishnu’s agents say:\n \"They are not sinners.\n They are great devotees and the servers of Lord Vishnu.\n This woman has performed a dance while this man has installed a flag in the temple.\n Thus, their sins have been destroyed and they have now a right to the supreme abode.\n They have served this temple for the past thirty-two years.\n\" Saying this, the agents of Vishnu snapped the noose and carried us to the abode of Vishnu in a divine aircraft.\n Hearing this tale from the king Sumit, sage Vibhaandak felt extreme joy and went to the forest. ", "next": "18.20", "prev": "18.18", "title": "TALE OF KING SUMIT’S PREVIOUS BIRTH"}