{"index": "18.22", "image": "resized_images/TALE OF BHADRASHEEL BRAHMIN.png", "text": [" Sanatkumar says:", " \"O Narad! A fast on Ekadashi (eleventh day) in both the phases of a month pleases Shri Hari and fulfills all the desires.", " On the eleventh day of each phase, one should not dine.", " Those who dine on the eleventh day commit severe sins.", " Salvation from sins like killing a Brahmin is possible but there is no method to eliminate the sins incurred because of dining on the eleventh day.", " Brahmins should essentially observe fast on the eleventh day of each phase.", " The preparations for Ekadashi Vrata start on the tenth day.", " The devotee should worship Shri Hari in the morning with proper rituals and pass the night in the vicinity of the idol.", "\" On the eleventh day, the devotee should worship Shri Hari in the morning and take an oath to observe fast during the day and pray the Lord to protect him from calamities.", " The devotee must pass the night singing devotional songs, reciting scriptures and if possible dancing.", " In the morning of the twelfth day, he should worship Lord Vishnu as usual.", " Then he should feed Brahmins and make donations as per his powers.", " Performing five kinds of Yagyas, the devotee should break his fast in the last.", " During the period of fast, the devotee must not see wretched ones and desist from talking to such people who oppose Brahmins.", " As there is no pilgrimage place holier than the Ganges;", " no teacher greater than the Mother and no deity more virtuous than Lord Vishnu.", " Similarly there is no fast greater than Ekadashi Vrata is.", " O Narad! I am now narrating an old tale.", " Listen to it carefully.", " In the ancient times, a great sage Gaalav lived in the dense forest on the bank of the river Narmada.", " He was very peace loving and truth abiding in nature.", " The forest surrounding his hermitage was the playground for beautiful fauna, Yakshas, Gandharvas and Vidhyaadhars.", " Sage Gaalav passed his time engaged in penance.", " Thus, he lived there for a long time.", " He had an equally virtuous son named Bhadrasheel who was a great devotee of Lord Vishnu and who knew everything about his previous birth.", " In his childhood, Bhadrasheel used to play with his friends but his plays reflected his religious sentiments.", " He would make an earthen idol of Lord Vishnu and worship it.", " He also would tell his friends to always worship Lord Vishnu and observe fast on the eleventh day of every phase in every month.", " His friends too followed him.", " During the worship, Bhadrasheel used to wish well for the entire world.", " His activities pleased the sage Gaalav very much.", " Gaalav says:", " \"O fortunate one! You are really Bhadrasheel because even the Yogis rarely have a nature like yours.", " You always indulge in worship of Hari, benefit of all and observe fast on Ekadashi.", " You always abstain from forbidden work.", " How come, you acquired such a peaceful and unconflicting mind.", " I am very much pleased with you.", " Kindly tell me, about your achievements.", "\" Bhadrasheel says:", " \"O father! I have some remembrance of my previous birth.", " During my previous birth, Yama had preached me about religion.", "\" These words surprised Gaalav.", " He says:", " \"O fortunate one! Who were you in your previous birth?", " What did Yamaraaj said to you and why?", "\" Bhadrasheel says:", " \"O great sage! I was a king in Soma dynasty.", " I had received knowledge from Dharmakeerti and Dattatreya.", " I ruled continuously for thousand years.", " During this period, I committed various religious as well as irreligious tasks.", " In the company of imposters, I too became an imposter.", " Working diplomatically, I destroyed Yagyas.", " My subjects also followed me and began to behave irreligiously.", " I received sixth part of their evil deeds.", " One day, I went to the forest hunting.", " There, I killed many animals.", " After a while, perplexed by thirst and hunger, I reached the bank of Narmada.", " I had strayed into deeper forests all alone.", " The intense sun was scorching my body.", " I was about to drop down because of hunger when I saw that people on the bank of Narmada were observing Ekadashi Vrata.", " I joined them and stayed awake all along the night without taking any food.", " But I could not bear the starvation and exertion and died as a result.", " Fierce looking Yamadoots took me to Yamaraaj.", " Yamaraaj asked Chitragupt to open the account of my life.", " Chitragupt thought for a moment and said:", " \"Its true O Yamaraaj that this person is a sinner.", " But now he is free from his sins due to observing fast on Ekadashi and passing his night in the company of pious devotees.", "\" Hearing these words, Yamaraaj greeted me and worshipped me with devotion.", " Then, he called his servers.", "\" Yamaraaj says:", " \"Listen to me, O agents! I am narrating something to your interest.", " Never bring to me in future anybody who is engaged in religious task.", " Stay away from those who always recite the name of Shri Hari.", " Greet them from a distance.", " This is my order as well as teaching to all of you.", " Spare all those who serve their teachers, love their religion, are helpless, serve the pious one and are truly deserving.", " Bring all such people who abuse their mother, hate the world, steal the wealth of temples and Brahmins, who are killers, who do not observe fast on Ekadashi, who are short tempered, criticize me and nurture hostility with others.", "\" Hearing such words from Yamaraaj, fire of penance began to burn within me.", " More intense this fire grew, more of my sins were destroyed.", " I acquired an appearance of Shri Hari.", " Even, Yamaraaj greeted me with respect.", " His action even surprised the Yamadoots.", " Worshipping me, Yamaraaj sent me on a divine aircraft to the abode of Vishnu.", " O father! I was passing my time happily.", " I did not know how and when crores of years passed.", " Then I arrived in Indraloka.", " There I stayed with the gods for many Kalpas.", " It was after such a great experience that I have arrived on the earth.", " Having the knowledge of my previous birth, I always engaged in the worship of Hari and inspire others to follow suit.", " Earlier, I didn’t know the virtues of Ekadashi Vrata.", " But now, because of the knowledge of my previous births, I have come to know about it.", " I observed it without any desire and without knowing that I was actually observing a fast and received so much in return.", " Hence, I cannot tell how much will one receive if he observes Ekadashi Vrata with some desire.", " Those who devotedly worship Shri Hari and observe Ekadashi Vrata attain even the supreme abode of Lord Vishnu.", "\" The words of his son gladdened sage Gaalav.", " He says- \"My birth has been successful because I got such a devotee son like you who told me the complete method of worshipping Lord Vishnu.\" "], "next": null, "prev": "18.21", "title": "TALE OF BHADRASHEEL BRAHMIN"}