{"index": "18.2", "image": "resized_images/NARAD PRAYS TO LORD VISHNU.png", "text": [" Shaunak says:", " \"Sutaji, how did Sanatkumar unfold the mystic character of the religion to Narad?", " When and where they had the meeting to hold this pious discussion?", " Kindly tell us in detail.", "\" Sutaji says:", " \"The great sage Sanatkumar, who was free from illusions, was the creation of Brahma’s imagination.", " He always remained engrossed in the worship of Brahma.", " Once, he was going towards the peaks of the mighty Meru Mountains (Himalayas) when on the way, he happened to sight the sacred Ganges.", " He was about to take a dip in the waters when Devarshi Narad also arrived there.", " Devarshi Narad greeted his elder brother and took bath in the river.", " After carrying out usual rituals, they seated there and started a discussion about the virtues of Lord Vishnu.", "\" Devarshi Narad asked- \"O brother! How can one realize the Lord Vishnu?", " Who is the cause of this whole creation?", " What is the appearance of devotion, knowledge and penance?", " Kindly elaborate the mystery of treating the guests also.", " Also tell me, how did Lord Vishnu effected the origin of Brahma and other gods?", "\" Sanatkumar says:", " In the beginning of creation, the self-illuminating Lord Vishnu created Brahma from His right hand side, Rudra from His central part and Vishnu, his own replica from His left hand side.", " As Lord Vishnu is omnipresent, similarly his illusions are also omnipresent and known with different names like Lakshmi, Uma, Shakti and Chandi.", " These are the powers of Lord Vishnu.", " Some people identify these powers with the illusions created by the Lord whereas the sages regard them as nature.", "\" The gods, who protect the world, are Purush, and the Supreme Being, who is above these levels, is Lord.", " Nobody else is greater than He is.", " From His navel even Brahma has originated on a divine lotus.", " He is the Supreme Being the eternal joy incorporating all the three virtues.", " O Narad! Five senses- sights, sound, scent, touch and taste have originated from the ego.", " Ego is the origin of other eleven senses also.", " These five senses in turn gave rise to five physical elements- ether, air, fire, water and earth.", " It was after the creation of these five physical elements that Brahma created the lower living beings.", " Then he created human beings followed by the creation of all the seven worlds and seven guards of these seven worlds.", " For the inhabitation of the living beings, Brahma also created great mountains, plains and seven seas.", " Towards the north of the great saline sea and towards the south of the great Himalayas is situated the Holy Land of India.", " People who worship Lord Shiva and Lord Vishnu inhabit this land.", " Because of their virtues, even the gods worship the people who populate the Indian landmass.", " Those ignorant people, who do not seek salvation despite having been born in India, have to suffer the tortures of hell as long as the Sun and the Moon shine in the sky.", " The whole world from Brahma to a seemingly unimportant blade of grass is the manifestation of Vasudev (Lord Vishnu). "], "next": "18.3", "prev": "18.1", "title": "NARAD PRAYS TO LORD VISHNU"}