{"index": "18.20", "image": "resized_images/DESCRIPTION OF HARIPANCHARATRA VRATA.png", "text": " Sanatkumar says:\n O Narad! I am now narrating about another fast.\n It is Haripanchak fast and is rare in all the worlds.\n It destroys all the sorrows of the devotee, fulfills his all desires and helps him attain the four goals of life.\n It is observed for five days in the month of Maargsheersh starting from the tenth day of the brighter phase till the full Moon day.\n On the first day, a day long fast is observed after worshipping Lord Vishnu in the morning.\n It is broken with a plain meal in the evening.\n Next day, Lord’s idol is bathed with milk containing ghee, curd, honey and five types of dry fruits followed by usual worship.\n Vows of the fast are recited and prayers are made for their successful completion.\n That whole night and also the subsequent nights till full Moon night are passed reciting Lord’s name and singing devotional songs.\n Bathing of Lord’s idol with milk containing ghee, curd, honey and dry fruits continues in the morning everyday till full Moon day.\n On the full Moon day, Havan is performed with oblations of sesame seeds and donations.\n On the sixth day, the devotee must drink Panchgavya and worship Shri Hari, feed Brahmins and only then should take meal silently.\n This fast is observed every month till Kartik and closing rituals are taken up in the month of Maargsheersh next year.\n During the closing rituals, the devotee should observe day long fast on the eleventh day and take only Panchgavya on the twelfth day.\n Thereafter he should worship Lord Vishnu, donate honey, ghee, fruits, kheer and an urn filled with water and containing five jewels to the Brahmin.\n He should then feed the Brahmins before himself taking any meal.\n O Narad! Those who observe this Haripanchak fast never return from Brahmaloka.\n Those who desire for salvation should essentially observe this fast.\n It destroys all the sins like a fire destroys a forest.\n Its virtues are equal to those of donating millions of cows. ", "next": "18.21", "prev": "18.19", "title": "DESCRIPTION OF HARIPANCHARATRA VRATA"}