{"index": "18.3", "image": "resized_images/PROFILE OF THE SAGE MARKANDEYA.png", "text": " Sanatkumar says:\n O sage! Faith has the greatest significance.\n Achievement of everything and appeasement of Lord Vishnu depend upon the faith.\n Nothing is attainable without faith.\n Such as a human being faces inertia in the absence of life and is rendered motionless.\n Similarly, faith is like a spiritual light without which, religious actions of a man come to cease.\n Similarly, devotion is also known as the life of all the achievements.\n It is also the giver of four supreme goals of life like Dharma, Arth, Kama and Moksha.\n No action succeeds without the input of devotion and faith.\n Even the menial jobs done with faith gives everlasting results.\n On the contrary, even the pious actions of envious people go futile.\n Attainment of God by envious people is impossible.\n Envy is the greatest enemy of the human being.\n It creates a gap as big as the one that separates the sky from the nether world.\n O Brahmanandan! Only those people, who remain engrossed in faithful devotion of God, attain to the abode of Vishnu.\n Fallen are those who, despite having the knowledge of Vedas, do not comply with the moral code of conduct of their clan.\n Neither Vedas nor even devotion can salve such people.\n In other words, moral conduct is everything.\n O great sage! Devotion is like mother who is the base of life for every living being.\n O Narad! Company of the pious people and the saints is the best means to cherish devotion.\n Saints are the teachers of the entire world.\n When the sins that have been accumulating all throughout the previous births decay only when one gets pious company and those who once get pious company experiences eternal joy.\n Narad says:\n \"O great devotee of Lord Vishnu! Kindly relate the actions and appearance of the Lord’s devotees to me.\n\" Sanatkumar says:\n \"During the period of Pralay, when all the world was inundated, Lord Vishnu was sleeping on a Banyan leaf.\n That scene had amazed Markandeya, the supreme devotee of the Lord.\n\" The sages asked:\n \"When all the world was inundated, how did Markandeya escape?\n Sutaji kindly remove our doubt.\n\" Sutaji says:\n \"O great sages! Now, I am going to narrate the tale of Markandeya.\n Listen to it carefully.\n\" Once upon a time, there lived a fortunate sage in the pious land of India.\n The sage was famous as Mrikandu.\n He had observed a very severe penance at the holy pilgrimage center of Shaligram.\n His penance began to cause worry for Indra.\n So, accompanied by other gods, Indra reached to Lord Vishnu who was resting on Sheshnaag in Ksheersagar, the ocean of milk.\n The gods prayed the Lord to protect them from the radiance of Mrikandu.\n Listening to the prayers offered by the gods, Lord Vishnu appeared in His four-armed form holding conch, wheel, mace and lotus in each of those arms.\n His radiance was enough to beat the shine of crore Suns.\n His radiance caused tremendous joy for the gods who fell flat at the feet of the Lord.\n Lord says:\n \"O gods! Get up.\n I am fully aware about your miseries.\n But your worries are meaningless because Maharshi Mrikandu is really a gentleman.\n He is not going to harm you in any way.\n Even if the situation arises, I am always ready to protect you.\n\" Saying these words, the Lord disappeared.\n Thus, assured by the Lord’s words, the gods also returned to their abode.\n On the other hand, pleased by Mrikandu’s penance, Lord appeared before him.\n As soon as Mrikandu opened his eyes, he saw Lord Vishnu standing before him.\n Lord’s four- armed, blue and radiant appearance caused great exhilaration for Mrikandu.\n He fell flat at His feet and prayed Him with tearful eyes.\n Pleased with his prayers, Lord asked Mrikandu to seek a boon.\n But Mrikandu refused saying that he had attained salvation just by having His sight.\n Still, Lord said that His appearance never goes in vain,\" So, I will be your son who will live a long life.\" Granting this boon, the Lord disappeared.\" ", "next": "18.4", "prev": "18.2", "title": "PROFILE OF THE SAGE MARKANDEYA"}