{"index": "18.4", "image": "resized_images/TALE OF THE SAGE MARKANDEYA.png", "text": " Narad says: \"O great sage! Why did Lord Vishnu appear as the son of Mrikandu? What did He do as his son? The Puranas say that during the Pralay, Markandeya had witnessed the direct appearance of Lord Vishnu’s illusion. Kindly narrate these things in detail.\" Sanatkumar says: \"Listen O Devarshi! After observing severe penance, the sage Mrikandu got married and received an equally virtuous and chaste wife. In the tenth month after their marriage, his wife gave birth to an extremely beautiful baby. The baby in fact had incorporated the radiance of the Lord. Mrikandu carried out all the necessary rituals and consecrations of the baby happily. In his fifth year, he carried out the thread ceremony of his son and started to educate him in Vedas. His education developed all the pious virtues in his son whom he had named Markandeya. After finishing his education, sage Markandeya also started a severe penance to please Lord Vishnu. Pleased by his penance, Lord Vishnu blessed him with a boon of creating Purana Samhita. This is the reason why the sage Markandeya is also known as Narayan. O Brahmins! Lord Vishnu did not annihilate Markandeya during the Pralay only to show him His illusions. It was due to this grace that Markandeya survived the Pralay and passed that time floating on a Banyan leaf. As long as the Lord slept, Markandeya kept floating on that leaf. As long as the night of the Lord lasted, Markandeya stayed on that flimsy leaf. At the end of the night, when the inundating Pralay receded and the Lord awakened from His prolonged sleep, He began the work of creation again. It was even more amazing for Markandeya to see the inundating water recede and new creation taking place. He began to pray the Lord with folded hands. Pleased by his prayers, the Lord said that He always protected His devotees even during the most severe crises. Markandeya then asked about the appearance of the true devotees of the Lord. He also expressed his curiosity to know the reasons of their birth. Lord Vishnu says: \"O great among the sages! The greatest devotees are those who do not harm others with their mind, words and actions and who are free from envy. Those who have impartial view are best among the devotees. Those who protect the human beings, cows, Brahmins, vegetation and remain engrossed in discussion of Lord’s virtues. Those who salute the garden of basil and put the earth from basil’s roots on their heads, those who are beloved to Lord Shiva, put Tripund on their forehead and worship Him performing Yagyas facing south. Those who always donate water and cereals, cows and daughters are the excellent among all the devotees. O great sage! These are some of the characteristics of a true devotee. Cherish these characteristics and you will also attain salvation in the last.\" Thus, preaching, Lord Vishnu disappeared. Markandeya thereafter led a pious life and observed penance and in the last he too attained to the supreme abode of the Lord. ", "next": "18.5", "prev": "18.3", "title": "TALE OF THE SAGE MARKANDEYA"}