{"index": "18.6", "image": "resized_images/FATE OF KING BAAHU.png", "text": " Narad says: \"O great sage who in the dynasty of Sagar received salvation from Preta Bhava. Who was Sagar? Kindly narrate his whole story to me.\" Sanatkumar says: \"Long ago, there occurred a king named Baahu in the dynasty of Surya. He was very religious in nature and looked after his subjects like his own offspring. Everyone was happy in his kingdom, which he ruled with polity and justice\". But destiny was playing another game for the king. With time, evils like envy and ego began to rise in the mind of Baahu. He began to think that nobody else was as religious as he was. These evils in turn caused the king to incline towards sensual pleasures. O Narad! An unconscious mind is the greatest cause of destruction. Everyone, even the better half begin to nurture hostility against such a person. So, the same thing happened with the king Baahu. Many neighbouring kings together launched a massive attack on the kingdom of Baahu and defeated him after a month-long fierce battle. After his defeat, the king Baahu left his kingdom and began to wander along with his queens. At last, he came to stay beside a big lake. Even the local inhabitants and lower creatures hid seeing the king approach. His subjects too had lost their sympathies for him. Now the life of the king was not more than the death. So, repenting his condition, king Baahu met his death in the presence of the sage Aurv. At that time, his youngest queen was expecting an issue. After her husband’s death, she decided to commit Sati. But, the sage Aurv prevented her convincing that her would be son would enjoy more popularity than his father had. Besides, nothing is more wretched than killing an unborn baby. Thus, convincing the queen with all means, sage Aurv guided the queens to perform cremation of her husband and other rituals. Since then, both the queens began to live in the hermitage of sage Aurv. ", "next": "18.7", "prev": "18.5", "title": "FATE OF KING BAAHU"}