{"index": "18.7", "image": "resized_images/THE BIRTH OF SAGAR.png", "text": " Sanatkumar says :\n- \"O Narad! Both the queens were passing their time in the hermitage of sage Aurv.\n When half of the rainy season had passed, the elder queen began to cultivate evil feelings for the younger.\n She, therefore, made deceitfully the younger queen to consume poison.\n But the poison could not affect the queen and her unborn baby because of the virtues she had acquired serving the sage Aurv.\n After three months, the younger queen gave birth to a son.\n Sage Aurv carried out necessary rituals and consecrations of the child and named him Sagar because he was born with the effect of poison.\n\" Sagar began to grow in Aurv’s hermitage.\n The sage had started to train the boy in weaponry.\n One day, out of curiosity, Sagar asked his mother about his father.\n His mother related to him all the events that took place with his father king Baahu, her husband.\n Listening to the fate of his father, Sagar took an oath to destroy all those who had caused misery to his father.\n Circumambulating his teacher Aurv and taking his mother’s permission, Sagar at once set out on his mission.\n His first halt was at the hermitage of sage Vashishta.\n Sagar narrated the whole thing to the sage Vashishta.\n Sage Vashishta presented him with a number of divine weapons and saw him off blessing him with a boon for victory.\n Armed with many divine weapons and the blessings of his mother and teachers, Sagar defeated even the most powerful enemies of his father in no time and established his rule over the entire earth.\n The defeated kings took asylum in the hermitage of sage Vashishta who assured them to be fearless.\n Spies on the other hand informed Sagar about this development.\n Sagar at once set out to the hermitage of Vashishta with an intention of exterminating those kings but meanwhile, sage Vashishta had got all the kings shaven.\n So, assuming that his enemies were dead, Sagar mockingly said to sage Vashishta:\n \"O sage! Why are you guarding these characterless creatures?\n I will not spare their lives.\n\" Vashishta says:\n \"O son! You are great.\n Now listen to me carefully for your benefit.\n I have already killed your enemies, so you will not gain anything killing them again.\n O king! This physical body is the root of all the sins.\n You will not receive popularity killing the physical body.\n So, give this matter a little thought before killing them.\n\" The words of sage Vashishta soothed Sagar’s anger.\n Thereafter, sage Vashishta carried out the coronation of Sagar.\n The king Sagar had two wives, Keshini and Sumati.\n They both were the daughters of Vidharba’s king Kashyap.\n When sage Aurv heard about Sagar’s coronation, he visited his palace and returned after preaching him.\n Some months later, with a desire of having sons, both the queens secretly summoned sage Aurv once again and received the talisman for having sons.\n Meditating for a while, the sage Aurv said:\n \"O fortunate ones! One of you will receive a son who will continue his progeny in future and the other will have sixty thousand prowessive sons.\n\" The sage also advised them to seek the boon of their respective choices.\n With time, Keshini gave birth to one son Asmanjas who grew in a whimsical person.\n Sumati gave birth to sixty thousand sons who were very obedient initially but following Asmanjas, they too began to behave whimsically.\n Asmanjas had one son, Anshuman who was very obedient to his grandfather.\n Sixty thousand sons of Sagar soon began to torment all the three worlds.\n Perplexed by their atrocities, Indra appealed to the sage Kapil to get them rid of their woes.\n With the inspiration of Sage Kapil, Sagar organized an Ashwamedha Yagya.\n Indra kidnapped the horse of the Yagya and tethered at the hermitage of sage Kapil.\n When all the sixty thousand princes reached Kapil’s hermitage, they began to abuse him seeing the horse there.\n Infuriated Kapil at once incinerated them with his curse.\n King Sagar then sent Anshuman in search of his sixty thousand sons and recovered the horse.\n Sage Kapil assured Anshuman that his grandson Bhagirath would please Ganga to descend and salve his ancestors. ", "next": "18.8", "prev": "18.6", "title": "THE BIRTH OF SAGAR"}