{"index": "18.8", "image": "resized_images/SALVATION OF SAUDAS.png", "text": " Narad says: \"O great brother! Why did sage Vashishta curse Saudas and how did he recover from this curse by the virtue of the Ganges waters?\" Sanatkumar says: \"O Narad! Saudas was a virtuous king. He ruled over his subjects religiously. He was very fond of hunting. So, one day, he went on hunting in the forest. He continued his excursion all day long. Towards evening, he reached at the bank of Godavari and decided to pass the night there. In the next morning also, he began his hunting excursion one again. During the hunting, he spotted a deer and began to chase it. Chasing the deer, he reached the core of the forest. There, the king saw a pair of tigers copulating. Saudas was an expert archer. He trained an arrow and killed the tigress in just one shot. As soon as the tigress died, she assumed the form of an enormous ogress. Death of his partner infuriated the tiger, which was in fact a monster in disguise. He decided to avenge the death of his mate. On the other hand, the whole event frightened the king. He held a hasty parley with his ministers. They unanimously took a decision to give up the hunting forever. Long afterwards, king Saudas organized an Ashwamedha Yagya in the auspices of sage Vashishta. At the completion of Yagya, sage Vashishta went to take a bath before taking his meal. Meanwhile, the monster appeared there in the guise of Vashishta and expressed his desire to eat meat. Then, in the guise of the cook, the monster cooked human flesh and served it in golden bowls. When sage Vashishta arrived, Saudas offered him the dishes made of human flesh. For a while, Vashishta thought in amazement but soon he realized the whole thing. Indignantly, he cursed the king to become a man-eating demon. The king tried to assert his ignorance and said- \"You yourself had expressed your desire to eat the meat.\" With his divine sight, sage Vashishta learnt that the king had been tricked with. By then, the king himself got ready to curse the sage in retaliation. But his prudent wife Madayanti stopped him. Thus, convinced by the queen, the anger of Saudas subsided. But he had taken water in his palm, so the problem arose where to dispose it off for it was sure to burn anything it fell upon. After a little consideration, the king dropped that water right on his feet that burnt immediately. Since then, the king Saudas came to be known as Kalmaashpaad. Sage Vashishta then consoled him.Vashishta says: \"O king! Imprudence is the root of all the obstacles and crises. But O king! You have no reason to be sorry. Your miseries will end soon and you will regain your original radiance by the virtue of the Ganges’ waters.\" Saying this, sage Vashishta returned to his hermitage. The whole body of the king had turned black. Since then, he began to roam in the forests like a wild animal. There he ate whatever he found-animals, birds and even human beings. Within six months, he devoured all the animals in one hundred Yojan expanses of the forests. Then he migrated to another area in the forest. One day, in the guise of a monster, Saudas was wandering in a forest on the bank of Narmada. There he spotted a sage couple engaged in carnal conjugation. Saudas at once got hold of the sage and began to devour him. The sage’s wife pleaded him to release her husband but Saudas did not pay heed to her pleas and devoured the sage. In anguish and anger, the Brahmini cursed Saudas that he would die if he tried to copulate with a woman and that he would always remain a monster. Infuriated, Saudas cursed her in retaliation: \"O evil one! Just one curse was sufficient. Why did you pour down two curses on me? Go and become a devil.\" The Brahmini at once turned into a devil. Afterwards, both of them began to wander in the forest. One day, they reached to such part of the forest where another monster was living. That monster too had acquired the formidable appearance because of not obeying his teacher. Seeing them, the monster enquired about the reasons of their coming to that forest. They narrated the whole thing to him. Saudas says: \"O friend! Who are you? Tell me, what sins did you committed. Do not conceal anything from your friends.\" The monster says: \"Before acquiring this appearance, I was a Brahmin and well versed in all the Vedas. I lived in Magadh. One day, blinded by my knowledge and youth, I insulted my teacher. That is the reason of my acquiring this monster’s appearance. Since then, I have been eating flesh only and I do not know how many Brahmins I have devoured so far. Still, my hunger is insatiated. O fortunate one! Hence I advise each and everyone never to insult their teachers.\" Saudas says: \"What is a teacher? Who was your teacher?\" The monster says: O brother! There are many kinds of teachers but I am telling about the most revered ones. All including the teachers of Vedas, preachers of scriptures and mantras, remover of doubts, protectors, wife’s father, elder brother, mother’s brother, family priest and own mother and father fall in the category of teachers. I had received preaching about all the religions from sage Gautam while staying on the enchanting banks of the Ganges. Once, when I went to worship Shiva, I did not greet him. Sage Gautam did not mind my behavior but Lord Shiva turned me into a monster out of anger.\" That sort of pious discussion among the monsters attenuated their sins. In the meantime, a Brahmin, who had hailed from Kalinga (Orrisa), arrived there carrying the holy water of Ganges. The monsters requested the Brahmin to sprinkle some of the waters over them. They also narrated the greatness of Ganges before the Brahmin. Pleased with their willingness, and appraisal of Ganges, the Brahmin sprinkled some Ganges water on them. The monster and the ogress resumed their divine appearance but Saudas remained unchanged. His worries began to mount but the invisible Saraswati consoled and advised him to recite the Lord’s name. Saudas then migrated to Varanasi where he continuously recited the Lord’s name and took bath in the holy Ganges. Thus, he overcame the curse of Brahmini and returned to his kingdom. There, sage Vashishta once again carried out his coronation. Since then, Saudas ruled his kingdom through religious means and attained the supreme abode of Lord Vishnu. ", "next": "18.9", "prev": "18.7", "title": "SALVATION OF SAUDAS"}