{"index": "2.1.4", "image": "resized_images/The Manifestations of Goddess Laxmi.png", "text": [" Bheeshma expressed his desire to know about the manifestation of goddess Laxmi.", " Pulastya replied-- Once, after being defeated by the demons, the deities went to Lord Vishnu and sought his help.", " Lord Vishnu instructed them to collect all the medicinal herbs, and put them in the Ksheersagar, so that after the churning of the ocean ambrosia could be retrieved.", "Lord Vishnu also advised them to use the Mandar mountain as a Churner and the serpent--Sheshnag as a rope for churning the ocean.", "The deities then reached an agreement with the demons according to which both the groups were supposed to unitedly churn the ocean.", " The great Mandar mountain was uprooted and placed on the back of the tortoise--the embodiment of Lord Vishnu.", " Sheshnag coiled around that mountain and both the ends were held by the demons and the deities respectively.", " The deities intelligently chose the tail-end, while the demons in their foolishness chose the mouth-end.", " The vemon spilled by Sheshnag destroyed the power and strength off the demons.", " When the process of Churning began, the first thing to emerge from the sea-bed was Kaamdhenu-- the holy cow.", " The deities claimed the ownership of this divine cow.", " Subsequently, Vaaruni (intoxicating drink) emerged from the sea-bed, which was claimed by the ignorant demons.", " During the process of ocean-churning, various kinds of things emerged out from the ocean--Parijat, sixty crore apsaras, the moon and the Kaalkut (poison), which were distributed among the demons and the deities.", " Lord Mahadev drank the Kaalkut when he saw that there was no taker for it.", " The churning of ocean also resulted into the manifestation of ambrosia-pot, Uchchaishrava (horse) and Eravat (elephant).", " Ultimately, goddess Laxmi manifested herself, seated on a lotus.", " The deities eulogised her by chanting the mantras of Sri Sukta.", " The deities were desirous of having goddess Laxmi on their side, so were the demons, but Lord Brahma instructed Vishnu to accept her as his consort.", " The demons became furious and snatched the ambrosia-pot from the hands of Sage Dhanvantari.", " Lord Vishnu then disguised himself as the most enchanting woman and fooled the demons into giving back the ambrosia- pot.", " Lord Vishnu gave the pot to the deities who became immortal after drinking ambrosia.", " A tremendous battle was fought between the demons and the deities.", " But, the demons were defeated in this battle and fled to the netherworld to protect their lives.", " The deities eulogised Lord Vishnu and returned to heaven. "], "next": "2.1.5", "prev": "2.1.3", "title": "The Manifestations of Goddess Laxmi"}