{"index": "2.1.15", "image": "resized_images/The Significance of Rudraksha, Amla & Tulsi.png", "text": " Once, while describing about the importance of Rudraksha to the sages, Vyas said--- One who wears a Rudraksha rosary is supreme among all human beings. The mere sight of such a holy man absolves people of their sin. A Rudraksha bead bears features of a Linga and yoni on it's surface. One should not wear a rudraksha on which above mentioned features are absent. Similarly two joint beads should never be worn. All the mantras become doubly powerful when chanted with the help of rudraksha-rosary.During Satya-yuga, there lived a mighty demon named Tripurasur. He had conquered the deities and was capable of moving in the space. The deities sought help of Lord Shiva, who killed Tripurasur by the sight of his third-eye. In the process, few drops of sweat, emanating from Shiva's body fell down on the earth. These sweat drops got transformed into a large Rudraksha-tree. Amla is a very nutritious fruit and great religious significance has been attached to it. Amla fruit is very dear to Lord Vishnu and its use on the auspicious day of Ekadashi brings unmatched virtue. A person who regularly eats amla enjoys a long life.The following tale adequately describes the religious importance of amla -- Once upon a time, a chandala went into the forest for hunting. He hunted many deer and birds. Feeling hungry, he saw an amla tree and climbed up the tree. This way he satiated his hunger by eating sweet amla fruits. Unfortumately while he was climbing down the tree, he fell down and died.When the attendants of Yamaraj arrived to take back his soul, they could not do so even after repeated attempts. The attendants of Yamaraj became very surprised and went to the sages for clarification. The sages revealed to the attendants that they could not go near the chandala's dead body, because he had eaten amla just before his death. Such is the glory of amla! Once Kartikeya asked Lord Shiva about the holiest tree, which was capable of giving salvation. Lord shiva replied---The Tulsi plant is supreme among all the vegetations. She is very dear to lord Vishnu and fulfill's all the desires of a man. Lord Krishna dwells near the place where there is a Tulsi plant. Spirits and ghosts never dare to venture near the Tulsi plant. If a man attaches a Tulsi leaf to his Shikha at the time of his death, he is liberated from all his sins. One who worships Lord Vishnu by offering Tulsi-leaves attains salvation. ", "next": "2.1.16", "prev": "2.1.14", "title": "The Significance of Rudraksha, Amla & Tulsi"}