{"index": "2.1.8", "image": "resized_images/King Prithu and the Surya Dynasty.png", "text": " Bheeshma enquired Sage Pulastya about the mighty King Prithu upon whom the earth was named as Prithvi.\n Sage Pulastya replied---Anga-Prajapati was the descendant of Swayambhuva Manu and Sunitha was his wife.\n In course of time, Sunitha gave birth to a son, who was named Ven.\n After growing up, Ven turned out to be an extremely irreligious person and used to spend his time committing all sorts of immoral deeds.\n The sages tried to bring him to the virtuous path but to no avail.\n They became furious and cursed Ven as the result of which he died.\n The sages then churned his dead body, which resulted into the manifestation of a mean caste called Mlechchha.\n They kept on churning his body and in the process, an extremely virtuous entity manifested from the right hand of Ven.\n He held various weapons like mace, bow and arrows in his hands.\n He was none other than Prithu--the embodiment of Lord Vishnu.\n After being crowned as a king, Prithu was saddened to see the prevalence of immorality throughout the length and breadth of earth.\n The lack of virtuosity and religiousness among the inhabitants of earth made him extremely furious.\n He decided to destroy the earth.\n The earth became scared and fled in the guise of a cow.\n Prithu chased her wherever she went.\n At last, the cow halted at a place as she had got tired.\n To save her life, the cow agreed to fulfill all the desires of Prithu.\n Prithu then milked the cow, which later on got transformed into cereals.\n Similarly all the deities, ancestors and other human-beings milked the cow and received numerous invaluable things.\n Prithu was a just king.\n Peace and prosperity prevailed during his reign.\n People were religious and free from any kind of sorrow.\n The earth is named after him as Prithvi.\nSage Pulastya then went on to give a detailed description of Surya dynasty---Vivaswan (Surya) had three queens---Sangya, Ragyi and Prabha.\n Ragyi had a son named Raivat while Somgya was the mother of Vaivaswat--Manu, Yama and Yamuna.\n Once, Sangya being unable to bear the extreme radiance of Surya created a superficial entity from her body and instructed her to act as Surya's wife in her absence.\n The name of this superficial woman was chhaya, who had two sons and two daughters from Surya.\n The names of her sons were Saavarna--Manu and Shanaishchar, while the names of her daughters were Tapti and Vishti.\n Shanaishchar became immortal as a planet while Yamuna and Tapti became rivers.\n Vaivaswat Manu had ten sons among whom 'Ila' was the eldest.\n After appointing Ila as his successor, Vaivaswat, manu went to do penance.\nOnce, Ila transformed into a woman after tresspassing a forest where Lord Shiva and Parvati were enjoying privacy.\n It was Lord Shiva's curse that any male who ventured in to that forbidden forest would become a woman.\n Later on, Buddh became enchanted by Ila's beauty and married her.\n Meanwhile, when Ila did not return to his kingdom, his brother Ikshvaku went in search of him.\n Ikshvaku reached the outskirts of the same forest but did not enter it.\n He managed to please Shiva by his devotion.\n When Lord Shiva appeared, Ikshvaku requested him to make Ila a man once again.\n Shiva told him that it was impossible but assured him by saying \"If you perform an Ashwamedha yagya and donate all the virtue thus acquired to me, then your brother will be able to live as a man for one month.\n But, after one month he will again become a woman.\n Thus, his form will keep on changing every alternate months.\n\" Meanwhile Ila gave birth to four sons among whom Utkal, Gaya and Haritashwa were prominent.\n This way, Ila became the source from which the lineage of chandra sprouted.\nIkshvaku ruled over Madhya-desh.\n He had one hundred sons, all of whom ruled the territories situated north of Meru Mountain.\n Ikshvaku also had one hundred and fourteen more sons, who ruled over the areas situated south of Meru.\nKakusttha was Ikshvaku's grand-son.\n Kakusttha had a son named Suyodhan.\n Some other prominent kings coming from this lineage were--Prithu, Vrihadashwa, Kuwalashva, Purukutsu, Dharmasetu, Muchukund, Tridhanva, Traidharun, Satyavrat and Satyarath.\n The most truthful king Harishchandra was Satyarath's son and Rohit was his son.\n Famous kings like Raghu, Dilip Aja, Dirghabahu and Prajapati-Dasharath were the descendants of Ikshvaku.\n Dasharath had four sons among whom Sri Ram was the eldest and who had killed the demon king Ravana. Ram had two sons--Lav and Kush. ", "next": "2.1.9", "prev": "2.1.7", "title": "King Prithu and the Surya Dynasty"}