{"index": "2.1.7", "image": "resized_images/The Origin of Marudganas.png", "text": " Bheeshma requested Sage Pulastya to describe how all the Marudganas came into existence. Pulastya replied--- All the sons and grandsons of Diti had perished in the battle fought between the deities and demons. Diti---the mother of daityas (demons) wanted to take revenge, so she started doing a penance at the bank of river Saraswati, which lasted for 100 years.Being pleased by her austere penance Sage Kashyap arrived and expressed his desire to bless her with a boon. Diti wanted a mighty son who could kill Indra. Sage Kashyap then implanted his sperms in Diti's womb and instructed her to remain there (where she had been doing penance) for 100 years. He also instructed her on various do's and don'ts which a pregnant woman is expected to observe. Diti agreed to follow his instructions.Mean while, Indra got wind of her pregnancy and became scared. He wanted to destroy the foetus at any cost, so he arrived at the place where Diti was staying. He had disguised himself to avoid being recognized by Diti. He engaged himself in her servitude, waiting for an opportune moment to destroy the foetus. This way, ninety-nine years had passed and only three days were remaining after which Diti was expected to give birth to a son. As the inevitable day approached nearer, Indra started becoming restless.One day, Diti was very tired and fell down asleep. Her hair was untied and her head had stooped down while she was sleeping, just opposite to the instructions Kashyap had given to her. Finding the moment opportune, Indra entered into Diti's womb and cut the foetus into seven pieces with his Vajra. The seven fragments of foetus instantaneously got transformed into seven infants and started wailing. Indra became furious and once again he attacked them with his vajra and severed them into seven pieces each. But to Indra's sheer amazement, there were 49 infants, all wailing loudly. He tried to stop them from crying by shouting 'Marud' (don't cry), but to no avail. Indra realized that the infants had attained immortality on account of the 'Pournamasi Vrata', which Diti had devoutly observed during the course of her penance. Indra named the infants as Marudganas and blessed them. He then begged for Diti's forgiveness and took her along with the Marudganas to heaven. The Marudganas, despite being born in the clans of demons, never associated with them and hence were revered even by the deities.Bheeshma expressed his curiosity to know about the detailed description of all the fourteen manvantars. Pulastya said--The first manvantar was called Swayambhuva, named after Swayambhuva- Manu. Yamya was the prominent deity of this manvantar. Marichi and other six prominent sages were the Saptarishis of this manvantar. Swayambhuva- Manu had ten sons---Aaghnigha, Agnibahu, Vibhu, Savan, Jyotishman, Dyutiman, Havya, Medha, Medhatithi and Vasu. The second manvantar was named after Swarochish--Manu. Swarochish--Manu had four sons--Nabh, Nabhasya, Prasriti and Bhavan. Tushit was the prominent deity of this second manvantar. Dattatreya, Atri, Chyavan, Stanba, Pran, Kashyap and Vrihaspati were the saptarishis of this manvantar. The third manvantar was called Autam and derived its name from Autami Manu, who had ten sons--Isha, Urj, Tanuj, Shuchi, Shukra, Madhu, Madhav, Nabhasya, Nabh and Saha, Bhanusangyak was the prominent deity of this manvantar. Sage Urj and other six sages were the saptarishis then. The fourth manvantar was called Taamas--named after Taamas-manu, who also had ten sons like his predecessor. The names of his sons were--Akalmash, Tapodhanva, Tapomool, Tapodhan, Taporashi, Tapasya, Sutapasya, Parantap, Tapobhagi and Tapoyogi. Kavi, Prithu, Agni, Akapi, Kapi, Janya and Dhama were the Saptarishis of this manvantar, while Saadhyagana was the prominent deity. The fifth manvantar was called Raivat--named after Raivat Manu, who had ten sons as well--Varun, Tatvadarshi, chitiman, Havyap, Kavi, Mukt, Nirutsuk, Satva, Vimoh and Prakashak, Bhutrajaa and Prakriti were the two prominent deities of this manvantar and the names of the saptarishis were--Devabahu, Subahu, Parjanya, Somap, Muni, Hiranyaroma and Saptashva. Next arrived the sixth manvantar---Chakshush. This Manvantar derived its name from Chakshush--Manu, who had ten sons and among whom Ruru was the most prominent one. Lekh, Ribhu, Prithagbhoot, Varimool and Divau were the prominent deities of this manvantar. The names of Saptarishis were--Bhrigu, Sudhama, Viraj, Vishnu, Narad, Vivaswan and Abhimani. The present manvantar, which is the seventh in order, is called Vaivaswat. The Saptarishis of this manvantar are---Atri, Vashishth, Kashyap, Gautam--yogi, Bhardwaj, Vishwamitra and Jamdagni. The eighth manvantar will be called Savarnya and will be named after Savarni Manu, Savarni Manu will have ten sons---Dhriti, Variyan, Yavasu, Suvarna, Dhrishti, Charishnu, Aadya, Sumati, Vasu and Shukra. The Saptarishis of this manvantar will be--Ashwatthama, Rishyashringa, Kaushikya, Galav, Shatanand, Kaashyap and Parashuram. The nineth manvantar will be named after Ruchi--Manu and will be called Rauchya manvantar. Ruchi--manu will have a son named Rauchya. The tenth manvantar will be called Bhautya and will derive its name from Bhautya Manu--Son of Bhuti. The eleventh, twelfth, thirteenth and fourteenth manvantars will be named after Merusavarni, Ribhu, Veetdhama and Vishkvasen Manus respectively. All these fourteen Manus successively rule this world for the total period of 1000 Chaturyugas. At the end of Kalpa each of them unite with Lord Brahma. ", "next": "2.1.8", "prev": "2.1.6", "title": "The Origin of Marudganas"}