{"index": "2.1.3", "image": "resized_images/The Four Prominent Castes.png", "text": [" On being asked by Bhishma about the origin of the four prominent castes, Sage Pulastya said--- Lord Brahma created the Brahmins and the Kshatriyas from his mouth and chest respectively.", " Similarly, Vaishyas and Shudras manifested from Lord Brahma's thigh and feet respectively.", "Lord Brahma had created his 'manasputras' with the objective of increasing the population and their names were Bhrigu, Pulah, Kratu, Angira, Marichi, Daksha, Atri and Vashishth.", " But all of them were free from worldly desires and extremely virtuous.", " Seeing his effort go in vain, Lord Brahma became furious, as a result of which Rudra manifested from his forehead.", " Half of Rudra's body resembled like a male while the remaining half appeared like a female.", "Lord Brahma instructed Rudra to detach the female form from his body and commence copulative creation.", " Following his advice, Rudra detached the female part of his body and created eleven male entities.", " Similarly he created various female entities from the female part of his body.", " This way, the first human pair-Manu and Shatarupa came into existence.", " In course of time four children were born to them---Priyavrata, Uttanpad, Prasuti and Aakuti.", " Prasuti was married to Daksha Prajpati, while Aakuti became the wife of Ruchi-Prajapati.", " Prasuti gave birth to 24 daughters-- Shraddha, Laxmi, Dhriti, Pushti, Tushti, Medha, Kriya, Buddhi, Lajja, Vapu, Shanti, Keerti, Khyati, Sati, Sambhuti, Smriti, Preeti, Kshama, Santati, Ansuya,Urja, Swaha and Swadha.", " Out of them, the former thirteen were the wives of Dharma and the rest were married to various sages like Bhrigu, Shiv, Marichi, Angira, myself (Pulastya), Pulaha, Kratu, Atri, Vashishth Agni, etc.", "Shraddha gave birth to 'Kaam', Laxmi to 'Daarpa, Dhriti to Niyam, Tushti to Santosh, Pushti to Lobha, Medha to Shrut, Kriya to Dand, Nay and Vinay, Buddhi to Bodh, Lajja to Vinay, Vapu to Vyavasay, Shanti to Kshama, Siddhi to Sukh and Keerti gave birth to Yash.", " All of them were the sons of Dharma.", " Kaam had a son named Harsh from his wife Nandi, Bhrigu's wife Khyati gave birth to a daughter named Laxmi--the consort of Lord Vishnu.", " Lord Rudra accepted Sati--the daughter of Daksha Prajapati as his wife.", " Hinsa was the wife of Adharm and gave birth to Anrit and Nikriti.", " Anrit had two sons---Maya and Narak, while Nikriti had two daughters--Maaya and Vedana.", " Maaya married Maya while Vedana became the wife of Narak.", " Maaya had a son named Mrityu-- the lord of death and Vedana gave birth to Dukh.", " Five children were born to Mrityu--Vyadhi, Jara, Shok, Trishna and Krodha.", " All of them were celibates and had no progeny. "], "next": "2.1.4", "prev": "2.1.2", "title": "The Four Prominent Castes"}