{"index": "2.1.9", "image": "resized_images/Bashkali, the Demon king.png", "text": [" Bheeshma requested Sage Pulastya to reveal Why Lord Vishnu had to take incarnation as Vaman.", " Sage Pulastya replied--- Once, during Satyayuga, the demons had defeated the deities and driven them out from their abode-- heaven.", " The mighty demon, Bashkali was their leader.", " He had become immortal an account of a boon received from Lord Brahma.", " Indra went to Lord Brahma and narrated the aweful tale of the deities.", " Lord Brahma assured him that Lord Vishnu would certainly help in this matter.", " Lord Brahma contemplated on Lord Vishnu who appeared in a very short time.", " When, Lord Vishnu came to know about the deities's pitiable condition, he promised them that very soon Bashkali's wings would be clipped.", " Lord Vishnu said---\"Very soon, I will take incarnation as Vaman.", " Indra will have to come along with me and demand a piece of land measured by my three steps.", " I shall then reveal my giant form and send him to the patalloka after making him bereft of his kingdom.", " In course of time Lord Vishnu manifested as Vaman from Aditi's womb.", " His manifestation was simultaneously marked by various auspicious signs--the air became full of fragrance, the deities started rejoicing, the trees started shedding flowers on their own and all the desires of living beings were fulfilled.", " Lord Vaman then went to Bashkali's palace accompanied by Indra.", " Both of them marvelled at the grandness of Bashkali's city, which was surrounded by a high boundary-wall.", "Bashkali was a very virtuous and benevolent king.", " He was truthful and well versed in all the scripture.", " His subject lived in prosperity and enjoyed a long life.", "When the demons saw Indra coming with a dwarf they informed Bashkali.", " Bashkali instructed the demons to bring both the guests with due respect.", " Bashkali treated his guests with all honour and asked Indra about the reason for his sudden arrival.", " Indra praised Bashkali's benevolence and said---\"The short brahmin accompanying me is desirous of a piece of land measured by his three steps.", "\" Bashkali was amused at this ridiculous demand and requested Vaman to ask for anything he wished.", " But, Vaman wanted nothing more than a small piece of land measured by his three steps.", " Shukracharya-Bashkali's guru smelled something fishy and warned him, but he was not to listen.", " Bashkali then requested Vaman to go ahead and measure the land by his three steps.", "Suddenly, Lord Vaman transformed his physique into a giant size.", " His first step reached the Surya-loka and his second step touched the dhruva-loka.", " He hit the top of the universe with his third step as a result of which water poured down.", " The water got collected and came to be known as Vaishnavi river.", " But, the land had still not been measured and hence Lord Vaman reminded Bashkali of his vow and ultimately the helpless Bashkali surrendered to the will of Lord Vaman and sought his refuge.", " Lord Vaman blessed him and sent him to Patalloka. "], "next": "2.1.10", "prev": "2.1.8", "title": "Bashkali, the Demon king"}