{"index": "2.1.12", "image": "resized_images/An Ideal Brahmin and the Significance of the Gayatri Mantra.png", "text": " Describing about the qualities of an ideal brahmin, Sage Pulastya said--- Once, Narad had asked Lord Brahma as to who was worthy of receiving Vishnu's blessings.\n Lord Brahma had told Narad that Lord Vishnu showered his blessings on those who engaged themselves in the service of brahmins.\n A brahmin should be virtuous and well versed in all the scriptures.\n A brahmin who does not observe the rituals as mentioned in the Vedas, brings disgrace to his ancestors.\n An ideal brahmin is respectful towards his parents, teachers and treats his guests with due honour.\n He never aspires for women other than his wife and chants the sacred Gayatri mantra everyday.\n Goddess Gayatri is said to have manifested in the lineage of Sankhyayan.\n She is of fair complexion and fire is the symbolical expression of her mouth.\n Lord Brahma dwells on her forehead, Lord Vishnu in her heart and Lord Rudra has his abode in her braided hair.\n The Gayatri mantra consists of 24 letters and each of them is related with a specific deity.\n There is a mention of Gayatri mantra, which consists of 18 letters.\n It begins with the word 'agni' and ends with 'swaha'.\n The mantra is as follows---OM AGNERVAKPUNSI YAJURDEDIN JUSHTA SOMAM PIBA SWAHA.\n A person, who chants the mantra for 100 times, becomes liberated from gravest of sin.\n The various deities related with the twenty-four letters of Gayatri Mantra are as under- Deity • 1st letter ---- Agni • 2nd letter ---- Vayu • 3rd letter ---- Surya • 4th letter ---- Aakash • 5th letter ---- Yamraj • 6th letter ---- Varun • 7th letter ---- Vrihaspati • 8th letter ---- Parjanya • 9th letter ---- Indra • 10th letter ---- Gandharva • 11th letter ---- Poosha • 12th letter ---- Mitra • 13th letter ---- Twashta • 14th letter ---- Vasu • 15th letter ---- Marudganas • 16th letter ---- Soma • 17th letter ---- Angira • 18th letter ---- Vishwadeva • 19th letter ---- Ashwini kumar • 20th letter ---- Prajapati • 21st letter ---- All the deities • 22nd letter ---- Rudra • 23rd letter ---- Brahma • 24th letter ---- Vishnu A devotee should then perform the ritual of 'nyas' by mentally establishing different words of the Gayatri mantra in the various parts of his body as given below -- • OM BHUH --- in the heart, • OM BHUVAH --- in the head, • OM SWAH --- in the top-knot (Shikha), • OM TATSAVITURVARENYAM --- in the whole body, • OM BHARGODEVASYA DHIMAHI --- in both the eyes • OM DHIYO YO NAH PRACHODAYAT --- in both the hands.\n Regular chanting of Gayatri mantra bestowes similar virtues attained by the study of all the four vedas.\n A brahmin who does not know Gayatri mantra is considered to be worse than a shudra.\n Anybody who chants Gayatri mantra attains salvation.\n body as given below -- ", "next": "2.1.13", "prev": "2.1.11", "title": "An Ideal Brahmin and the Significance of the Gayatri Mantra"}