{"index": "2.1.6", "image": "resized_images/The Origin of Deities, Demons and Serpents.png", "text": " Bheeshma requested Sage Pulastya to explain how different entities like the deities, demons and serpents came into being.\n Pulastya replied---Having failed in his repeated attempts of increasing population by the means of 'sankalpa' Daksha Prajapati was left with no option but to take the help of copulative creation.\n He begot sixty daughters from his wife named Virini.\n In course of time ten of them were married to Dharma whose names were---Arundhati, Vasu, Jami, Lamba, Bhanu, Marutvati, Sankalpa, Muhurta, Saadhya and Vishwa.\nVishwa gave birth to Vishwadeva, while Saadhyaa was the mother of Saddhya.\n Marutvati gave birth to Marutvan.\n Vasu had eight sons who became famous as the Vasus---yourself (Bheeshma), Dhruv, Soma, Dhar, Anil, Anal, Pratyush and Prabhas.\n Bhanu had a son by the same name i.\ne.\n Bhanu.\n Mahurta begot deities, who were the lords of auspicious moments.\n Lamba gave birth to Ghosh while Jami had a daughter named Nagvithi.\n Arundhati became the mother of all the creatures of this world.\n As far as the offspring of eight Vasus are concerned, 'you' (Bheeshma) have four sons-- Shant, Vaitand, Samb and Munibabhru.\n Dhruv had a son named Kaal.\n While Soma was the father of Varcha.\n Dhar had two sons--Dravin and Havyavaah.\n Anil had three sons--- Pran, Raman and Shishir.\n Anal also had three sons---Shakh, Upshakh and Naigameya.\n Pratyush had a son named Deval, who later on became a famous sage.\n Prabhas was the father of Prajapati Vishwakarma--the architect of the deities.\n The names of the eleven Rudras are---Ajaikpad, Ahirbudhnya, Virupaksh, Raivat, Har, Bahuroop, Trayambak, Savitra, Jayant, Pinaki and Aparajit.\n All of them are said to be the lords of the Ganas and have all together 84 crore progenies known as the Rudraganas.\n Sage Kashyap had thirteen wives---Aditi, Diti, Danu, Arishta, Sursa, Surabhi, Vinta, Tamra, Krodhvasha, Ira, Kadru, Khasa and Muni.\n Kashyap had two sons from Diti---Hiranyakashipu and Hiranyaksha.\n Hiranyakashipu had four sons--- Prahlad, Anuhlad, Sanhlad and Hlad.\n Prahlad also had four sons---One of them was Virochan.\n Virochan was the father of Bali.\n Vanasur, who had one thousand arms, was the eldest son of Bali.\nHiranyaksha had four sons, who themselves had 27 crore sons and grandsons in all.\n Kashyap had begotten one hundred sons from Danu, among whom Viprachitti was the most powerful.\nViprachitti had fourteen sons from Sinhika---Sainhikeya (Rahu), Kansa, Shankh, Nala, Vatapi, Ilwal, Namuchi, Khasrima, Anjan, Narak, Kaalnaabh, Parmanu, Kalpavirya and Dhanuvanshavivardhan.\n Kashyap also had six daughters from Tamra--Shuki, Shyeni, Bhasi, Gridhi, Sugridhi and Shuchi.\n All six of them gave birth to various species of birds.\n Shuki was the mother of Parrots and Owls.\n Shyeni gave birth to hawks while Bhasi was the mother of ospreys (a large fish eating birds.\n) Gridhi gave birth to Vultures and Sugridhi was the mother of pigeons.\n Shuchi was the mother of cranes, Swans and other similar aquatic birds.\n Vinita was the mother of Garuda and Arun---Supreme among birds.\n Arun was the father of Sampati and Jatayu.\nSursa was the mother of the serpents and had given birth to one thousand snakes.\n Similarly, Kadru gave birth to one thousand cobras.\nSurabhi, one of the thirteen wives of Kashyap had given birth to cows, buffaloes as well as beautiful women.\n Muni was the mother of the celestial damsels --apsaras.\n Arishta gave birth to Kinnars and Gandharvas.\n Ira was the mother of various vegetation like grass, trees, creepers and bushes.\n Khasa gave birth to crore of Rakshashas (monsters) and Yakshas.\nKashyap had also begotten forty-nine Marudganas from Diti. ", "next": "2.1.7", "prev": "2.1.5", "title": "The Origin of Deities, Demons and Serpents"}