{"index": "2.1.14", "image": "resized_images/Narottam – The Brahmin.png", "text": " Describing about the importance of five virtuous deeds, Pulastya said to Bheeshma---\"The five supreme virtuous deeds are--obedience to parents, faithfulness towards husband, equanimity, not having enmity towards friends and devotion towards Lord Vishnu. By pleasing his father, one pleases all the deities. Mother is superior even to all the places of pilgrimage combined together. Pulastya then narrated the same tale to Bheeshma, which lord Brahma had once told some prominent sages --- Once, there lived a famous Brahmin called Narottam. He had acquired divine powers on account of his austere penance but unfortunately he never treated his parents with respect.After taking his daily bath, Narottam hanged his wet clothes in the open sky without any support and they used to dry without falling down on the earth. This special power had made him very arrogant.One day, a crane flying in the sky passed dung on his face, which made him very furious. Narottam cursed the crane as the result of which it was burnt to death. His special power vanished due to the sin acquired by killing an innocent bird. Now, no longer his clothes remained in suspended position in the sky. Narottam became very sad. Suddenly he heard a heavenly voice instructing him to see a 'chandala' named Mook. \"His discourses would be beneficial for you.\"- Said the heavenly voice. Narottam went in search of Mook--the chandal and found him in the servitude of his parents. Mook was a great devotee of his parents and his total devotion towards his parents had blessed him with an extraordinary power-his house used to hang in the air without any support.Narottam was deeply amazed at this wonderful sight. He wanted to know how Mook had acquired such divine powers. But, Mook requested him to wait, which made Narottam very angry. Mook then told Narottam---\"I can talk to you only after attending to my parents. I am not that crane which was charred to death by your curse. If you don't have time then go and meet that 'faithful- wife. She will answer your questions.\" Narottam did not know where that faithful wife lived, so he stood there wondering what to do next. Suddenly Lord Vishnu emerged from Mook's house disguised as a brahmin. He took Narottam to the 'faithful-wife's house. All along the way Lord Vishnu preached Narottam on the qualities of a chaste woman. As both of them were about to reach that chaste woman's house, lord Vishnu disappeared, leaving Narottam all alone. Narottam requested the woman to enlighten him on the finer points of virtuosity. But, the woman was busy attending her husband and requested him to wait. Narottam threatened to curse her, to which the woman replied---I am not that crane whom you had cursed. If you are in a hurry then you can go and meet 'Dharm--Tulaadhar'. He is an honest businessman and is capable of answering your queries.\" Lord Vishnu once again appeared from that woman's house disguised as a brahmin. Narottam asked him as to how were both Mook and faithful-wife aware of the incident in which the crane was charred to death. Lord Vishnu told him that both of them had acquired this special power by the virtue of their respective religiousness. Lord Vishnu and Narottam proceeded towards the place where Dharmtuladhar did his business transactions. As they were about to reach the place, Lord Vishnu disappeared once again, leaving Narottam all alone.Narottam saw Dharmtuladhar busy in his dealings with total honesty. He requested him to reveal as to what made the wet clothes to hang in the air without any support. Dharmtuladhar requested him to wait but Narottam was in a hurry to get answer to his questions. Dharmtuladhar told Narottam--Please wait for sometime, as I am busy doing my business transactions. If you don't have time then you can go and meet Adrohak, who is fully capable of giving answer to your questions. Lord Vishnu once again accompanied him disguised as a brahmin. When both of them were about to reach the place where Adrohak used to live, lord Vishnu disappeared and Narottam was left all by himself, once again. Narottam requested Adrohak to preach on the essence of religiousness. Adrohak was a man of impeccable conduct and had full control over the sensual urges. He advised Narottam to meet the supreme devotee of Lord Vishnu, who lived nearby. Adrohak said-- You would get answers to all your questions. He will reveal to you the reason that made wet clothes to hang in air without any support.Narottam then proceeded towards the place where the supreme devotee of Lord Vishnu lived. Lord Vishnu once again accompanied him in the guise of a brahmin.After reaching there, Narottam expressed his desire of seeing Lord Vishnu. The supreme devotee took him to a temple situated inside the house-premise. Narottam was amazed to see the same brahmin, who had been accompanying him all along the way, siting on a lotus flower. He realized that the brahmin was lord Vishnu himself. Lord Vishnu blessed him and said---Be respectful towards your parents, if you want to attain to my abode. I dwell in the houses of people who are virtuous, truthful, possessed equanimity and who have full control over their passion. This is why you found me present at the homes of chandal, Tuladhar & Adrohak. Narottam realized his mistake and decided to be in the servitude of his parents for the rest of his life. ", "next": "2.1.15", "prev": "2.1.13", "title": "Narottam – The Brahmin"}