{"index": "2.2.6", "image": "resized_images/Kunjal Narrates about his Previous Birth.png", "text": [" Sage Chyavan, who had been listening to the narration of Kunjal, was amazed by his profound knowledge.", " He asked Kunjal---O great soul! Who are you?", " From where did you acquire such divine knowledge.", "' Kunjal, who remembered everything about his previous birth said-- In my previous birth, I was the youngest son of a brahmin named Vidyadhar.", " My name was Dharma Sharma.", " Seeing my dislike for study, my father became worried about my future.", " I used to waste my time loitering here and there.", " People used to make fun of my stupidity, which made me extremely sad.", " I decided to acquire knowledge but did not find anybody willing to teach me.", " In due course of time I became old but was still an idiot.", " One day, I was sitting in a temple cursing my fate.", " Suddenly, a sage arrived there and asked me as to what made me so sad.", " I narrated my woeful tale.", " The sage felt pity on my condition and blessed me with divine knowledge that made me capable of having advance knowledge of all the future incidents of the world.", " Sage Chyavan was curious to know about the reason that made Dharma Sharma to be born as a parrot.", " Kunjal replied--- O Brahmin! A man is influenced by the company he keeps.", " The reason why I took birth as a parrot is related with an incident, which occurred in my previous birth.", " Once, a wicked fowler sold a parrot to a brahmin who in turn presented it to me.", " With the passage of time I became very attached with the parrot and gradually deviated from my virtuous path.", " As a result all my divine knowledge vanished and I became an idiot once again.", " One day,a cat arrived and killed that parrot in my absence.", " I became very sad and used to spend my time crying over the dead parrot.", " Ultimately I died but even at the time of death, my mind was preoccupied with the thoughts of my beloved parrot.", " As a result, I was born as a parrot but fortunately I remembered my previous birth even while I was still in my mother's womb.", " I was full of remorse and used to curse myself for having wasted my life.", "Sage Chyavan was amazed by the narration of Kunjal--the learned parrot. "], "next": "2.3", "prev": "2.2.5", "title": "Kunjal Narrates about his Previous Birth"}