{"index": "2.2.3", "image": "resized_images/Yayati marries Ashrubindumati.png", "text": " Once, king Yayati went into a forest for hunting.\n He saw a stag, which had four horns and chased it.\n The deer led him deep into the forest and then disappeared.\n Yayati was tired and thirsty.\n He saw a lake and decided to quench his thirst.\n First of all he took his bath and then drank sweet water from the lake.\nAs Yayati was relaxing at the bank of that lake, he heard a sweet voice singing a song.\n Yayati proceeded towards the direction from which the sound was coming.\n He saw a beautiful woman singing a song.\n Her companion accompanied the beautiful woman.\nYayati became enchanted by the divine beauty of that woman and wanted to marry her.\n The beautiful woman's companion told Yayati that her friend could marry him only after he shed the signs of his old age.\n The beautiful woman was Ashrubindumati--the daughter of Rati.\nVishala-her companion was the daughter of Varun.\n Yayati returned to his palace and requested his two sons--Taru and Yadu to exchange their youth in lieu of his old age, but both of them refused to oblige him.\n Yayati cursed both of them.\n Yayati had a son---Puru from his wife named Sharmishtha.\n When he made the same request to Puru, he agreed without any hesitation.\n Yayati became pleased with Puru and appointed him as his successor.\n Now, Yayati became young once again and went to meet Ashrubindumati.\n But, Ashrubindumati's friend Vishala was still not convinced and expressed apprehension that her friend would never play second fiddle to his two wives-- Sharmishtha and Devayani.\nKing Yayati, being blinded by his lust, assured Vishala that Ashrubindumati would enjoy the supreme authority and she had nothing to fear.\n He said--\"I promise that you will be my only wife and I will have nothing to do with my wives.\n\" This way Yayati married Ashrubindumati and enjoyed a blissful married life for twenty-thousand years.\n Once, Ashrubindumati expressed her desire of visiting all the divine places--Indraloka, Brahmaloka, Shivaloka and Vishnuloka.\n Yayati took back his old age from Puru and returned his youth.\n He appointed Puru as his successor and instructed his subject to live peacefully.\n But, the people wanted to be with Yayati, so all of them accompanied him to the heaven.\n Yayati visited all the divine places and ultimately attained to Vishnuloka. ", "next": "2.2.4", "prev": "2.2.2", "title": "Yayati marries Ashrubindumati"}