{"index": "2.3.3", "image": "resized_images/‘Dharma-Teertha’ & Yamuna-Snan.png", "text": " Sage Narad continued with the description of various holy places and said--- \"A pilgrim must visit Dharma Teerth, which is named after the lord of death-- Dharma.\n Once upon a time Dharmaraj had performed an austere penance at that place this is the reason why it became famous as Dharma Teerth.\n By visiting Dharma Teerth, a man liberated all his ancestors up to seventh generation.\n After that a pilgrim should go to Kalap-forest, Saugandhik-forest, Suvarna-Dhumavanti respectively.\n All the above mentioned holy places are capable of giving salvation.\n\" Describing about the virtues of taking a holy dip in river Kalini (Yamuna) sage Narad said -- A person who takes a holy dip in Yamuna becomes liberated from all his sorrows.\n The virtue acquired by taking a bath in Yamuna is greater than paying visits to various holy places like Pushkar, Kurukshetra, Brahmavarta and Kashi.\nTaking a dip in Yamuna also helps in the fulfillment of all the desires of a man.\n Although, different rituals have been attributed to various yugas like Saytayuga--penance, Treta--Knowledge, Dwapar--yagya and Kaliyug--Donation, yet virtue of taking a holy dip in Yamuna transcends even time.\n\" \"Although the whole stretch of river Yamuna is believed to be holy, yet Yamuna flowing near Mathura holds special importance because of her deep association with lord Krishna.\n\"Narad narrated a tale to prove the significance of taking a bath in Yamuna.\n \"During Satyayuga there lived a Vaishya named Hemakundal.\n He had earned lot of wealth by dint of hard work.\n Although he was very rich yet happiness deluded him, as he had no progeny.\n He was worried as to who would inherit his property after his death.\n \"In course of time, Hemakundal attained old age and after realizing about the impermanence of the world indulged himself in virtuous deeds.\n He was blessed with two sons--Shrikundal & Vikundal.\n When both his sons grew up, Hemakundal went into the forest to do penance.\n\" \"Shri Kundal and Hemakundal squandered the whole wealth which their father had earned so painstakingly.\n Both of them were of loose moral character and had illicit relationship with many prostitutes.\n In a very short time they became poor and both of them starved to death.\n When the yamdoots reached yamloka after taking their souls, Yamraj ordered--'Put Shri Kundal in Raurav hell but send Vikundal to the heaven.\n' While Vikundal was being taken to the heaven he asked one of the yamdoots--'The sins committed by my brother and me were almost identitical then why is my brother being sent to hell while I am being sent to heaven.\n' The yamdoot replied-You are being metted out this special treatment on account of your virtues acquired by bathing twice in river Yamuna.\nThere was a brahmin friend of your's named Swamitra.\nYou had accompanied him to Mathura and twice taken bath in the holy Yamuna.\n By the virtue of the first bath you became liberated from all your sins, while the second bath helped you in attaining to the heaven.\nVikundal requested the yamdoot to allow his brother to accompany him to heaven.\n Yamdoot replied that his brother could accompany him to the heaven provided he donated all his virtues to him.\n Vikundal agreed to donate his virtues to his elder brother for the sake of his liberation.\n This way, both Shrikundal and Vikundal attained to the heaven. ", "next": "2.3.4", "prev": "2.3.2", "title": "‘Dharma-Teertha’ & Yamuna-Snan"}