{"index": "2.3.1", "image": "resized_images/Some Prominent Holy Places in Bharat-Varsha.png", "text": [" Once, sages requested Sutji to describe about the most prominent places of pilgrimage situated in Bharatvarsha.", " Sutji commenced his narration by describing the origin of creation and then switched over to the geographical characteristics of Bharatvarsha.", " Sutji said---'There are seven prominent mountain ranges in Bharatvarsha--Mahendra, Malay, Sahya, Shaktiman, Rikshavan, Vindhya and Pariyatra.", " Some prominent rivers supplying potable water to the inhabitants of Bharatvarsha are---Ganga, Sindhu, Saraswati, Godwari, Narmada, Shatadru, Yamuna, Vipasha, Mahanadi, Vidisham, Varuna etc.", " The names of the main Janapadas situated in the northern part of Bharatvarsha are Kuru, Panchal, Shalva, Matreya, Jaangal, Shoorsen, Pulind, Baudh, Chedi, Matsya, Bhoj, Sindhu, Utkal, Koshal, Madra, Kalinga, Kashi, Malav, Magadh, Videh, Anga, Banga, Surashtra, Kekay, Kashmir & Gandhar.", " Similarly, Janpadas like Dravid, Keral.", " Prachya, karnatak, Kuntal, chol, Sauhrid, Kona, Korak, Kalad, Mushal and Sutap are situated in the southern part of Bharatvarsha.", " Sutji then described about the greatness of Pushkar teerth by recounting an incident related with the Pandavas--- \"One day, Sage Narad visited the Pandavas who were living in exile.", " The Pandavas had visited many places during the course of their exile period and wanted to know about the fruits they had acquired due to their pilgrimage.", " \"Sage Narad then recounted an incident when king Dilip had once posed the same question to Sage Vashishth.", " Sage Vashishth while describing about the greatness of Pushkar said---Pushkar teerth is the holiest place where lord Brahma has his abode.", " Deities consider themselves fortunate to be at Pushkar.", " A person who takes a holy dip at Pushkar and worships lord Brahma acquires virtues equivalent to the accomplishment of the Ashwamedha yagya.", "\" Sage Vashishth continued with the description of some other prominent places of pilgrimage like Jambumarg, Narmada Amarkantak etc. "], "next": "2.3.2", "prev": "2.3", "title": "Some Prominent Holy Places in Bharat-Varsha"}