{"index": "2.4.1", "image": "resized_images/Sheshnag narrates the Tales of Sri Rama’s Return from Lanka.png", "text": " Once, Sages requested Sutji to describe about Sri Ram's return from Lanka.\n Sutji narrated the same tale, which Sheshnag had once told Vatsyayan.\nSheshnag said--After the killing of demon king Ravan, Sri Ram appointed Vibhishan as the king of Lanka.\n He then decided to return to Ayodhya on Pushpak-Viman, which Vibhishan had presented to him.\n He along with Sita, Laxman, Sugreev and Hanuman boarded the aircraft and flew towards Ayodhya.\nThe earth looked beautiful from such a high altitude and Sri Ram was continuously describing about the importance of various places over which the aircraft flew.\n As the aircraft was about to enter the airspace of Ayodhya, Sri Ram recognized Bharat, who was living at Nandigram at that time.\n Bharat had vowed not to enter Ayodhya till the return of Sri Ram, hence he stayed at Nandigram situated at the outskirts of Ayodhya awaiting Sri Ram's return.\n He led an austere life as the result of which he had become weak and feeble.\n On seeing Bharat, Sri Ram instructed Hanuman to inform him about his (Ram's) arrival.\n Hanuman went to the hermitage of Bharat and informed him about Sri Ram's arrival.\n Bharat's joy knew no bound and he expressed his desire to reward Hanuman for bringing such auspicious news.\n Bharat then accompanied Hanuman and went to meet Sri Ram.\nSri Ram's heart was filled with grief when he saw Bharat, who looked like a hermit in his 'Valkal' and 'Kaupin'.\n On the other hand Bharat cursed himself for being the cause of Sri Ram's miseries.\n Bharat asked for Sri Ram's forgiveness and said---'O Lord! You had to go into exile only because of me.\n I can never be absolved of my sin.\n' Sri Ram consoled him and after taking Bharat into his embrace enquired about his welfare.\n He told Bharat that he had to undergo the sufferings of exile because of his own destiny.\n'You are not at fault.\n Don't curse yourself for my misery.\n' said Sri Ram.\n At last all of them including Bharat boarded Pushpak Viman and the aircraft took- off for Ayodhya.\nContinuing with Sri Ram's tale, Sheshnag said--When Sumanth brought the news of Sri Ram's arrival at Ayodhya, people danced in joy, Preparations started being made for Sri Ram's grand reception.\n The whole city of Ayodhya was decorated with rows of lighted lamps.\n Sri Ram and Sita alighted from the Pushpak Viman and both of them were carried in a palanquin to the palace.\n People stood in queues on both sides of the road with folded hands.\n Sri Ram blessed them by raising his hand.\nFirst of all Ram went to meet Kaikayi who was full of remorse and guilt.\n Sri Ram consoled her and then went to meet Sumitra to pay his obeisance to her.\n At last, he went to meet his own mother--Kaushalya, who was dying to see him.\n Kaushalya blessed Sri Ram, Sita and Laxman.\n Bharat then instructed the royal astrologers to decide upon an auspicious moment for Sri Ram's coronation.\n Thus Sri Ram became the king of Ayodhya.\n During his reign peace and prosperity prevailed everywhere.\n People were virtuous and there was no sign of sin. ", "next": "2.4.2", "prev": "2.4", "title": "Sheshnag narrates the Tales of Sri Rama’s Return from Lanka"}