{"index": "2.4.2", "image": "resized_images/Ravana – The Mighty Demon.png", "text": " People of Ayodhya lived peacefully during Sri Ram's reign until one fateful day when they were struck by a bad news--Sri Ram had abandoned Sita after a Washerman leveled an unfair charge against her character.\n Such was the greatness of Sri Ram that opinion of each and every individual was given due respect irrespective of his position and status.\n One day, Sage Agastya arrived in the royal court of Sri Ram.\n After the formal Salutations were over.\n Sage Agastya complimented Sri Ram for killing Ravana.\n Sri Ram asked Agastya--'Who was Ravana-- the tormentor of deities?\n I am anxious to know about the origin of his whole clan.\n\" Sage Agastya replied--Vishrava was the grandson of Lord Brahma.\n His father was sage Pulastya.\n Vishrava had two wives--Mandakini and Kaikasi.\n Mandakani's son was Kubera while Kaikasi was the mother of Ravana, Kumbhakarna and Vibhishan.\n Kubera ruled over Lanka.\n One day, Kubera, came to see his parents boarded on his aircraft--Pushpak Viman.\n After he returned to Lanka, Ravana, who was very much impressed by Kubera's royal appearances asked Kaikasi--\"Who was this fellow?\n From where did he acquire such an amazing aircraft.\n\" Kaikasi revealed to Ravana that the guest was none other than his step-brother Kubera.\n She said--\"Kubera is the son of your step mother--Mandakini.\n He has made his mother proud by his conduct but I am ashamed of you, because of your inconsequential existence.\n You are no better than a worm.\n\" Ravan decided to prove his mother wrong by acquiring insurmountable power and authority.\n Ravana went to the forest and performed an austere penance for ten thousand years by standing on one foot.\n He fixed his gaze at the sun and never for a moment did he remove his gaze from it.\n Kumbhakarna and Vibhishan also engaged themselves in austere penance.\n At last, Lord Brahma became pleased and blessed Ravana with a vast kingdom.\n Ravan then started tormenting his step-brother Kumbhakarna.\n He snatched Kubera's Pushpak Viman and drove him out of Lanka.\n Ravan then turned his attention towards the deities and drove them out of heaven.\n The deities went to seek the help of Lord Brahma who in turn took them to Lord Shiva.\n Even Lord Shiva was clueless about the means by which the indomitable Ravana could be subdued.\n Ultimately all of them including Lord Shiva went to Lord Vishnu and sought his help.\n Lord Vishnu assured them by saying --- \"I shall take incarnation as Ram at a place called Ayodhya.\n Presently, Ayodhya is being ruled by Dashrath, who inspite of having three queens, does not have any son.\n I shall manifest myself as Ram.\n Don't worry! I shall eliminate the menace called Ravana.\n\" Sage Agastya also told Sri Ram that Ravana belonged to the caste called 'Brahmrakshas'.\n This way, Sage Agastya after having finished his narration looked at Sri Ram anticipating further queries. ", "next": "2.4.3", "prev": "2.4.1", "title": "Ravana – The Mighty Demon"}