{"index": "2.5.15", "image": "resized_images/Killing of Kansa.png", "text": " Continuing with the divine tales of Sri Krishna, Lord Mahadeva told Parvati-- When Kansa failed in his repeated attempts to kill Sri Krishna, he instructed 'Akrura' to invite both Krishna and Balaram to Mathura on the pretext of attending a ceremony called Dhanush-yagya. Kansa had planned to kill Sri Krishna by deceitful means.Akrura was a great devotee of Sri Krishna and was aware of Kansa's evil intentions. But, he had no other option but to follow the command of his master-Kansa. So, Akrura went to Vraja where Sri Krishna and Balaram used to live. Sri Krishna and Balaram were delighted to meet Akrura. After the formal exchange of pleasantaries, Krishna took Akrura to his home. Akrura conveyed the instructions of Kansa to Nanda and requested him to send both Sri Krishna and Balaram to Mathura. Akrura said--'Sri Krishna is the incarnation of Lord Vishnu and Kansa will be killed by him.'Nanda and Yashoda were reluctant to send Sri Krishna to Mathura but Sri Krishna convinced them, Ultimately. Akrura returned to Mathura accompanied by Krishna and Balaram. The people of Vraja became sad when the time for Krishna's departure to Mathura arrived. When Akrura reached Mathura accompanied by Sri Krishna and Balaram it was already evening. Sri Krishna saw a dyer with colourful apparels going towards Kansa's palace. Sri Krishna playfully demanded some set of clothes from that dyer which he refused to give. Sri Krishna was infuriated and slapped him so hard that he started vomiting blood. In a short time the dyer was dead. Sri Krishna and Balaram chose some beautiful set of clothes for themselves and proceeded towards the palace of Kansa. After sometime they met a crooked woman carrying 'sandal-wood-paste'. Sri Krishna demanded some sandal wood paste from her, which she gave without any hesitation. Sri Krishna blessed that crooked woman as a result of which she was cured of her physical--deformity. At last, both Sri Krishna and Balaram reached the oblation--site where 'Dhanush-yagya' was suppossed to be performed. Sri Krishna lifted the divine bow kept there and broke it into two pieces.When Kansa learnt that the divine bow had been broken, he ordered Chaanur to kill Krishna in a wrestling-bout. Kansa also fortified his palace by positioning wild elephants and mighty warriors at all the entrance-points.Sri Krishna and Balaram spent the night at the oblation-site. In the morning both of them proceeded towards the palace. Sri Krishna found an elephant named Kuvalyapeeda standing at the main entrance of the palace. He killed that ferocious elephant without much difficulty. Sri Krishna and Balaram then entered the gymnasium where wrestling-bouts were supposed to take place. All the demons those who had witnessed Sri Krishna killing that huge elephant without any problem, became terrified and fled away from the gymnasium. Sri Krishna and Balaram entered the chamber of Kansa. Kansa became terrified and ordered his trusted lientenants--Chanur and Mushtik to kill Krishna.Chanur confronted Sri Krishna while Mushtik fought a duel with Balaram. Ultimately, both the demons were killed after a fierce duel. Now, Kansa was left all alone, Sri Krishna pulled Kansa from the throne where he was sitting and slapped him so hard that he fell down on the ground. The injury proved to be fatal and as a result Kansa died. Balaram also killed Kansa's younger brother whose named was Sunama. After killing Kansa, Krishna and Balaram went to meet their parents--Vasudev and Devaki. They also freed their maternal grandfather- Ugrasena who had been imprisioned by Kansa. At last they appointed Ugrasena as the king of Mathura. ", "next": "2.5.16", "prev": "2.5.14", "title": "Killing of Kansa"}