{"index": "2.5.14", "image": "resized_images/Sri Krshna.png", "text": [" Parvati requested Lord Mahadeva to narrate the divine tales of Vasudeva Krishna.", " Lord Mahadeva replied--Vasudev was the descendant of yadu.", " His father was Devameedha.", " He was married to Devaki--the daughter of Ugrasena.", "Ugrasena also had a mighty son named Kansa.", " Kansa was extremely affectionate towards his sister Devaki.", " After her marriage, while Devaki was going to her husband's house on a chariot being driven by Kansa, suddenly a heavenly voice was heard.", " 'Kansa, you would meet death at the hands of Devaki's eighth son.", "' Kansa became very scarred and wanted to kill his sister then and there.", " But, Vasudev requested Kansa to spare Devaki's life and promised to hand over any child that she gave birth to.", " Thus Kansa imprisoned both Vasudev and Devaki.", "In course of time, Devaki gave birth to seven sons and Kansa killed each of them.", " Lord Sri Hari manifested himself when Devaki conceived for the eighth time.", " It was the month of Shravan and the day was 'Krishna-ashtami' when Sri Hari took his incarnation at midnight.", " Soon after taking his incarnation he gave a glimpse of his divine form to Vasudev and Devaki.", " On the instruction of Sri Hari, Vasudeva carried the infant to Nand's house.", " He had no problem in moving out of the prison as all the guards had fallen asleep due to the illusion of Sri Hari.", " On seeing the swift currents of overflooded yamuna, Vasudev became worried.", " But the level of river Yamuna receded as soon as Sri Krishna touched the river with his feet.", " Sheshnag protected Sri Krishna from heavy rain with his thousand hoods.", " When Vasudev reached Nand's house he found that Nand's wife-- Yashoda had given birth to a baby girl.", " Yashoda was sleeping at that time and Vasudev had no problem in exchanging Sri Krishna with that baby girl.", " Vasudev then returned to the prison and laid down the baby girl beside Devaki.", " The baby-girl started crying and the guards immediately woke up.", " They informed Kansa about the birth of Devaki's eighth child.", " Kansa tried to kill that baby girl by smashing her head, but she escaped from his hands and flew up in the sky.", " She thundered---'Your death is certain as your assasin has already taken birth.", "' Kansa was terrified at the prospect of his death.", " He instructed his soldiers to kill all the infants' whereever they were to be found in his kingdom.", " He also ordered the release of Vasudev and Devaki, as there was no point keeping them in captivity.", "Meanwhile, Sri Krishna grew up under the guardianship of Nand and Yashoda.", " One day Kansa sent a wicked ogress named Putna to kill Sri Krishna.", " Putma had applied poison on her breasts and tried to kill Krishna by breast-feeding him.", " Sri Krishna sucked her breast with such ferocity that she died.", " Thus, Sri Krishna gave the first glimpse of his divinity to the inhabitants of Vajra.", "Sri Krishna accomplished many such divine deeds during his childhood.", " He grew up to be a mischieveous child and used to play numerous pranks on the fellow Gopis.", " He used to steal their butter and curd.", " One day, all the Gopis complained to Yashoda about Sri Krishna's misdeeds.", " Yashoda became angry and tied him with a wooden-mortar in order to prevent him from troubling the Gopis.", " She then placed that mortar between two trees so that Krishna could not move.", " But, Sri Krishna toddled away uprooting both the huge trees.", " Once, a demon named Bakasur disguised himself as a huge heron and tried to kill Sri Krishna.", " But, Sri Krishna hit him with a stone with such force that he met an instant death.", "This way Sri Krishna had killed many ferocious demons while he was still a small child.", " Some of them well Kaliya--the serpent etc, Dhenukasur, Arisht, Keshi etc.", " A significant incident had occurred during Krishna's childhood.", " People of Vraja were devotees of Indra and used to worship him.", " Sri Krishna stopped this tradition and encouraged people to worship Govardhan mountain.", " Indra became extremely furious and caused incessant rain for one week.", " Sri Krishna protected the people by lifting Govardhan mountain and shielding them from the continuous downpour.", "At last, Indra accepted defeat and eulogized Sri Krishna. "], "next": "2.5.15", "prev": "2.5.13", "title": "Sri Krshna"}