{"index": "2.5.11", "image": "resized_images/Sri Rama Grows Up.png", "text": " Continuing with the tale of Sri Ram, Lord Mahadeva told Parvati--Dasharath requested Vashishth to perform the Jaatkarm Sanskar of Sri Ram.\n In course of time Kaikeyi gave birth to Bharat--an incarnation of Panchajanya conch.\n Similarly, Sumitra gave birth to two sons--Laxman and Shatrughan.\n Laxman was the incarnation of Sheshnag while Shatrughan was the incarnation of Sudershan chakra.\n Sri Ram and his brothers received education under the guidance of Sage Vashishth.\n In a very short time they became proficient in all the scriptures and mastered various weaponaries.\n Although all the four brothers were very close to each other, yet Laxman could not bear to live in Ram's separation even for a moment and was specially close to him.\n Sita manifested herself from the field while Janak was ploughing it.\n King Janak brought up Sita with great love and care.\n At that time, Vishwamitra was busy performing a grand yagya at Siddhashram.\n But the demons created numerous problems and made it impossible for him to accomplish the yagya.\n Vishwamitra went to Ayodhya and requested Dasharath to send Sri Ram and Laxman along with him so that the yagya could be accomplished without any problems.\n Dasharath agreed to send Sri Ram and Laxman along with Vishwamitra.\nThis way, Vishwamitra returned to his hermitage acompanied by both the brothers.\n Garuda presented a pair of bow and imperishable set of arrows to both the brothers.\n While staying at the hermitage Sri Ram and Laxman killed many demons like Taraka and Subahu.\n When Marich tried to disrupt the yagya, Sri Ram attacked him with Pavan-astra, which sent Marich flying across the sea-shore.\nMeanwhile, on learning that Janak was performing Vajapeya yagya at Janakpur, Vishwamitra took Sri-Ram and Laxman to attend it.\n On the way Sri Ram liberated Ahalya who had turned into a rock after being cursed by her husband.\nAfter reaching Janakpur, Sri Ram broke Lord Shiva's bow and married Sita.\n Laxman married Urmila.\n Dasharath had come to attend the marriage ceremony accompanied by Bharat and Shatrughan.\n Bharat was married to Mandavi while Shatrughan married Shrutkeerti.\n Meanwhile, on learning that Sri Ram had broken Shiva's bow, Parshuram arrived there and challenged him, but ultimately Parashuram realized about the divinity of Sri Ram and accepted his superiority.\nAt last, Sri Ram, Laxman, Bharat and Shatrughan returned to Ayodhya alongwith their respective consorts. ", "next": "2.5.12", "prev": "2.5.10", "title": "Sri Rama Grows Up"}