{"index": "2.5.19", "image": "resized_images/Anirudha Marries Usha.png", "text": [" Lord Mahadeva continued with the divine tales of Sri Krishna--O Parvati! Sri Krishna had a son from Rukmini whose name was 'Aniruddha'.", " Aniruddha was very brave and had killed a demon named Shambasur.", " There is an interesting tale how Aniruddha married Usha.", " Once, Usha--the daughter of Bangur, saw a very handsome young man in her dreams.", " She was so infatuated by his handsome personality that she developed a deep desire of marrying him.", " When she woke up next morning, she expressed her desire to her companion--Chitralekha.", "Chitralekha was an accomplished painter.", " She drew a sketch of a handsome man as per the descriptions of Usha.", " When the painting was ready, Chitralekha revealed to Usha that the preson who she had seen in her dream was none other than Aniruddha.", " Chitralekha had divine powers.", " She went to Dwarka and abducted Aniruddha while he was asleep.", " She then carried the sleeping Aniruddha and laid him on the bed of Usha.", "When Usha woke up, She was thrilled to see the man of her dreams.", " Aniruddha remained there for many days without Banasur being aware of his presence.", "One day, Banasur came to know about Aniruddhas' presence.", " He became furious and imprisoned Aniruddha.", "Sage Narad informed Sri Krishna about Aniruddha's imprisonment.", " Sri Krishna went to fight a battle against Banasur and release Aniruddha from his imprisonment.", " Although Sri Krishna was leading a large army and was accompanied by mighty warriors like Baldeva and Pradyumna yet he was aware that it was not easy to fight Banasur who had one thousand arms and whom Lord Shiva had vowed to protect.", " A fierce battle commenced between the armies of Sri Krishna and Lord Shiva.", " But the battle remained indecisive for a long time.", " Meanwhile, Banasur came forward to fight against Sri Krishna.", "Very soon Sri Krishna severed all the thousand hands of Banasur with his 'chakra'.", " Lord Shiva then requested Sri Krishna to spare Banasur's life and said -'Banasur has received the boon of immortality from me.", " Now, only you can protect the dignity of my boon given to him.", "' Sri Krishna spared Banasur's life.", " Banasur then agreed to marry his daughter to Aniruddha.", " This way Aniruddha married Usha with great fanfare. "], "next": "2.5.20", "prev": "2.5.18", "title": "Anirudha Marries Usha"}