{"index": "2.5.12", "image": "resized_images/Sri Rama’s Exile.png", "text": [" Lord Mahadeva continued with the tale of Sri Ram and told Parvati --Dasharath wanted to appoint Sri Ram as his successor but Kaikeyi did not like this idea.", " She wanted Bharat to be made the king of Ayodhya and Sri Ram to be sent into exile for 14 years.", " Once, Kaikeyi had saved Dasharath's life while he was fighting a battle against the demons.", " To show his gratitude, Dasharath had promised two boons to her.", " At that time, Kaikeyi had told Dasharath that she would make her demand at the appropriate time.", " This way, Dasharath was compelled by Kaikeyi to accept the two demands.", " As a result, Sri Ram was sent into exile.", " Bharat refused to become the king of Ayodhya and vowed to wait till Sri Ram returned.", " Dasharath could not bear the sorrow of Ram's separation and died in his sorrow.", " Bharat tried his best to convince Sri Ram to change his mind and accept the throne, but Sri Ram did not listen to his request.", " Bharat then brought Sri Ram's wooden-sandal and kept it on the throne.", " He vowed to spend rest of his life in austerities till Sri Ram returned.", " While Sri Ram was still in exile, he went to the hermitage of Sage Atri and received his blessings.", " Atri's wife- Anasuya preached Sita on the virtues of chastity.", " Sri Ram also visited hermitages of some other prominent sages like Sharbhanga, Suteeksha, Agastya etc.", " Once, while Sri Ram was living in Panchavati, Shurpanakha arrived there.", " Shurpanakha was Ravana's sister and wanted to marry Sri Ram, But Laxman severed her nose and ears.", " She went to a mighty demon named Khar and narrated her woeful tale.", " Khar attacked Ram with a huge army, which comprised of brave warriors like Trishira Dushan etc.", " Sri Ram was Victorious in this battle and Khar, Trishira and Dushan were killed.", " Shurpanakha went to Ravan and informed him about the misdeeds of Ram.", " Ravan was infuriated and wanted to take revenge.", " He abducted Sita with the help of Marich.", "When Jatayu saw Ravan carrying Sita to Lanka, he fought with valiance but was injured in the ensuing battle.", "Sri Ram went in search of Sita and met Jatayu, who was injured and who informed Ram that Sita had been abducted by the demon king Ravan.", "Sri Ram met Hanuman at the Rishyamook mountain.", " Later on he befriended Sugreeva on the advice of Hanuman.", " Sugreeva had enemity with his brother-Bali.", " Sri Ram killed Bali and made Sugreeva the king.", " Sri Ram requested Hanuman to find out the whereabouts of Sita.", " Hanuman went to Lanka and found Sita at Ashoka Vatika.", " He destroyed the garden and killed many demons including Ravana's son--Akshay Kumar.", " Ultimately, he was captured by Meghnath and taken to Ravana's court.", " Ravan ordered Hanuman's tail to be ignited.", " Hanuman then burnt the city of Lanka and returned to Sri Ram.", " When Sri Ran came to know about the exact location of Sita, he decided to attack Lanka with a huge army, which comprised of monkeys.", " The army camped at the sea-shore where Vibhishan came to meet him.", " A bridge was built across the ocean and the army reached Lanka.", " A fierce battle took place in which many demons were killed.", " At last, Ravan came forward to fight against Sri Ram but was killed.", "Sri Ram appointed Vibhishan as the king of Lanka and blessed him.", " Vibhishan presented his pushpak Viman to Sri Ram.", " All of them boarded the Pushpak Viman and flew towards Ayodhya.", " On the way Sri Ram met Bharat who was still awaiting his arrival at Nandigram.", " Sri Ram was very pleased to meet Bharat.", " Ultimately all of them returned to Ayodhya. "], "next": "2.5.13", "prev": "2.5.11", "title": "Sri Rama’s Exile"}