{"index": "2.5.18", "image": "resized_images/Sri Krshna’s Queens.png", "text": [" Continuing with the divine tales of Sri Krishna, Lord Mahadeva told Parvati--Sri Krishna had 16 thousand queens among whom Satyabhama, Kalindi, Mitravinda, etc.", " were prominent.", "King Sattajit had a priceless diamond named-- Syamantak, which he had presented to his younger brother--Prasena.", " Sri Krishna was fascinated by that diamond and demanded it from Prasena, which he refused to part with.", " One day, Sri Krishna alongwith Prasena and other yadavas went into the forest for hunting.", " While chasing a deer, Prasena seceded from his group and was killed by a lion.", " The lion took the diamond and started playing with it.", " Incidentally, Jambavan--who had once fought along with Sri Ram against Ravana, saw the lion playing with the diamond.", " He killed that lion and took the diamond in his possession.", " When Sri Krishna returned to Dwarka, he was surprised by a strange rumour, which pervaded the whole city.", " Some people suspected that Sri Krishna had killed Prasena for the diamond.", "Sri Krishna was very much distributed by this baseless rumour.", " To clear the doubts, he went into the forest accompanied by all the residents of Dwarka and showed the dead body of Prasena, which was still lying there.", " When people saw the mutilated corpse of Prasena, which bore marks of the lion's claws and canines, they became convinced of Sri Krishna's innocense.", " While returning back to Dwarka, Sri Krishna saw an effulgent cave.", " Sri Krishna was very surprised and wanted to find out the source of light.", " He entered the cave and saw Prasena's diamond hanging on top of a cradle, in which a child was lying.", " A woman was singing a lulaby so that the child falls asleep---'The lion killed Prasena while Jambavan killed the lion and acquired this diamond from its possession.", " O child! Don't cry as this priceless diamond belongs to your father.", "'Sri Krishna furiously blew his conch.", " Jambavan came out from the cave after listening to the sound of the conch.", " A fierce duel took place between them, which continued for ten days.", " At last, Jambavan realized that the person against whom he was fighting was none other than Sri Ram himself.", " Jambhavan then gave his daughter--Jambavati to Krishna in marriage and gave lot of wealth as dowry including that 'Syamantak' diamond.", " Bhadraraj had three daughters-- Sulakshamana, Nagnajiti and Susheela.", " Sri Krishna had married all three of them in a 'Swayamwara'.", " This way, Sri Krishna had altogether eight prominent queen consorts--Rukmini, Satyabhama, Kalindi, Mitravinda, Jambavati, Nagnajiti, Sulakshamana and Susheela.", " There lived a mighty demon named Narakasur.", " He had defeated the deities and snatched the divine earrings of Aditi--the mother of deities.", " He had created an aerial city in which he lived alongwith other demons.", " The deities went to Sri Krishna and sought his help.", " Sri Krishna flew up in the sky mounted on the back of Garuda.", " Satyabhama was also accompanying him.", " Sri Krishna was amazed to see the well fortified palace of Narakasur.", " When the demons saw Srikrishna, they attacked him but Sri Krishna challenged them by blowin his conch.", " Narakasur came forward to fight Sri Krishna.", " A fierce battle took place in which Sri Krishna broke Narakasur's bow with his arrows.", " Ultimately, Sri Krishna was successful in killing Narakasur.", " Sri Krishna then returned the whole wealth to the deities, which Narakasur had looted from them.", " He also liberated sixteen thousand women whom Narakasur had imprisoned.", " After being liberated all the women accepted Sri Krishna as their husband. "], "next": "2.5.19", "prev": "2.5.17", "title": "Sri Krshna’s Queens"}