{"index": "2.5.9", "image": "resized_images/Vaman Incarnation.png", "text": [" Continuing with the various incarnations of Lord Vishnu, Lord Mahadeva told Parvati --- Prahlad had a son named Virochan.", "The most benevolent king--'Mahabahu-Bali' was Virochan's son.", " Bali had defeated the deities and ruled over all the three worlds.", " Sage Kashyap commenced the most austere penance--Payovrata to help the deities regain their lost kingdom (heaven) once again.", " He was accompanied by his wife--Aditi in his penance which lasted for one thousand years.", " At last, Lord Vishnu became pleased by their penance and appeared before them.", " Sage Kashyap narrated the woeful tales of the deities and requested him to make Indra the Lord of all the three worlds.", " Lord Vishnu promised that he would take incarnation as Vaman.", "In course of time, Aditi became pregnant and ultimately gave birth to Lord Vaman.", " Lord Vaman appeared in the form of a 'Brahmchari'.", " He wore a deer--Skin and carried a stick and a 'mekhala' in both his hands.", " Lord Vishnu enquired the deities about the future course of action.", " The deities informed him that Bali was busy performing a yagya and he would not turn down any demand made to him because if he did so there was a fear of loosing all his virtues attained by the performance of the yagya.", " Lord Vaman went to the oblation site where Bali was performing a yagya and demanded a small piece of land measured by his three steps.", " Bali agreed to meet the demand of his guest inspite of Shukracharya's warning.", "Bali resolved to donate land by holding holy water in his palm.", " Now, Lord Vaman abandoned his dwarfish form and appeared in a giant form.", " He measured the whole earth by his first step.", " Lord Vishnu then measured the whole sky by his second step.", " The helpless Bali agreed to donate all the three worlds to protect his vow.", "Ultimately, Lord Vishnu sent Bali to the Rasatala and thus Indra became the ruler of heaven once again. "], "next": "2.5.10", "prev": "2.5.8", "title": "Vaman Incarnation"}