{"index": "2.5.13", "image": "resized_images/Sri Rama’s Coronation.png", "text": [" Describing the coronation of Sri Ram Lord Mahadeva told Parvati--People of Ayodhya rejoiced at the return of Sri Ram.", " An auspicious day was chosen for his coronation and Sri Ram became the king of Ayodhya amidst the chantings of Vedic mantras.", " Sri Ram ruled over Ayodhya for one thousand years without any problem.", " Meanwhile, some ignorant people started pointing out fingers at the character of Sita.", "Sri Ram decided to abandon Sita in the forest to quell the rumour.", " Sita was pregnant at that time.", " Feeling pity on her condition, Valmiki took her to his hermitage where Sita gave birth to Lav and Kush.", " Meanwhile Sri Ram decided to perform Ashwamedha yagya at the bank of river Gomati.", " But, since the yagya could not have been accomplished without Sita, therefore he performed the rituals seated beside a golden idol of Sita, In the mean time Valmiki arrived there, accompanied by Sita.", " He requested Sri Ram to accept Sita, vouching for her chastity.", "Sri Ram told Valmiki--'I am confident of Sita's chastity but she will have to prove her chastity for the satisfaction of common people.", "' Sita was deeply hurt by Sri Ram's unkind remarks.", " She said--'May mother earth swallow me if I ever had thought about any man other than my lord Sri Ram.", "' Hardly had Sita finished her lines than the earth cracked and Sita vanished into that crevice.", " Sri Ram's heart was filled with remorse but thinking that it was perhaps in his destiny to live in separation with Sita, returned to Ayodhya accompanied by Lav and Kush.", " In course of time, Kaushalya, Sumitra and Kaikeyi left for heavenly abode.", " Sri Ram continued to rule Ayodhya for 10,000 more years.", " One day, Kala (death) arrived and reminded Sri Ram that the time had arrived for him to leave his mortal body.", " Meanwhile Laxman became aware of Sri Ram's decision of leaving his mortal body.", " He gave up his life by taking samadhi in river Saryu.", " Sri Ram could not bear the sorrow caused by Laxman's bereavment.", " He appointed Lav and Kush as the kings of Dwarawati and Kushawati respectively and decided to leave for heavenly abode.", " Sri Ram entered the water of river Saryu, flowing at the distance of three yojans from Ayodhya. "], "next": "2.5.14", "prev": "2.5.12", "title": "Sri Rama’s Coronation"}