{"index": "2.5.22", "image": "resized_images/Lord Vishnu – The Almighty God.png", "text": [" Describing about the superiority of Lord Vishnu among the trinity Gods' Sage Vashishth narrated the following tale--During ancient times, Swayambhuva manu had once gone to Mandarachal mountain to perform a yagya.", " Many scholars and learned men had come to attend that yagya.", " Very soon, they got into a debate as to who was the supreme among all the deities.", " Some of them eulogised the greatness of Brahma, while some said that lord Shiva was the greatest of all the deities.", " Failing to come to any conclusion all of them requested Sage Bhrigu to find out as to who was the greatest among the trinity Gods.", " Sage Bhrigu went to meet Lord Shiva at Kailash mountain.", " He saw Nandi standing guard at the main entrance.", " Sage Bhrigu arrogantly ordered Nandi to inform Lord Shiva of his arrival.", " Nandi refused to comply with Bhrigu's command.", " Sage Bhrigu cursed Lord Shiva by saying--Your master- Shiva, would bear the consequences of showing disrespect to me.", " From today onwards people would make offerings of forbidden articles to him.", "' Sage Bhrigu then went to meet Lord Brahma.", " After reaching Brahmaloka, he made salutations to lord Brahma.", "Lord Brahma also did not give any respect to Sage Bhrigu and neglected him.", " Sage Bhrigu became furious and cursed Lord Brahma---'Being intoxicated by your Rajoguna, you have shown disrespect to me.", " From today onwards people will not worhsip you.", "' Sage Bhrigu then went to meet Lord Vishnu at his abode- Ksheersagar.", " He did not have any problem in reaching the place where Lord Vishnu was taking rest on Sheshnag, engrossed in his yoganidra.", " Goddess Laxmi was pressing Vishnu's legs with total devotion.", " Sage Bhrigu kicked Lord Vishnu on his chest.", " Lord Vishnu woke up and seeing sage Bhrigu said---'O Great Brahmin! Your tender foot must have got hurt because of my chest, which is as hard as Vajra.", " How blessed I am to have been touched by a brahmin's foot.", "' Lord Vishnu got up and eulogised Sage Bhrigu.", " This gesture of Lord Vishnu made Sage Bhrigu cry in joy.", " Now, he was convinced as to who was the supreme among all the three deities.", "Sage Bhrigu returned to Mandarachal mountain where all the sages were anxiously waiting for him.", " He declared-- 'Lord Brahma is the possesser of Rajoguna, while Lord Shiva possesses tamoguna.", " Only Lord Vishnu is the proud possessor of Satvaguna and hence He is the supreme among all three of them.", "' After finishing his tale, Sage Vashishth told the sages that anybody who worships Lord Vishnu with complete faith and total devotion become liberated from all his sins.", " A devotee of Lord Vishnu attains to Vishnu Loka after his death. "], "next": "2.5.23", "prev": "2.5.21", "title": "Lord Vishnu – The Almighty God"}