{"index": "2.5.7", "image": "resized_images/The Incarnations of Matsya and Kurma.png", "text": [" Once, goddess Parvati expressed her desire to know about all the incarnations of Lord Vishnu.", "Lord Mahadeva replied-- Lord Brahma had created numerous Prajapatis like Bhrigu, Marichi, Atri, Daksha, Kardam, Pulastya, Pulaha, Angira and Kratu.", " Marichi was the father of Kashyap.", " Sage Kashyap had four wives-- Aditi, Diti, Kadru and Vinta.", "Aditi was the mother of Deities while Diti gave birth to demons like--Makar, Hayagreeva, Mahabali, Hiranyaksha, Hiranyakashipu Jambha, Maya etc.", " Makar was a mighty demon, Who after deceitfully acquiring the Vedas from Lord Brahma had hidden himself inside an ocean.", " Lord Brahma requested Vishnu to liberate the sacred Vedas from the possession of Makar.", " Lord Vishnu then took the incarnation of Matsya and after killing Makar gave back the vedas to Lord Brahma.", " Durvasa was the son of Sage Atri.", " Once, he went to Indraloka to see Indra.", " At that time, Indra was planning to go out somewhere.", " Durvasa presented a garland of Parijat flowers to Indra.", " Indra, after receiving the garland from Durvasa kept it carelessly on the forehead of his elephant-Eravat.", " This garland was trampled under its feet by the elephant, which infuriated Sage Durvasa.", " He cursed Indra by saying---Immense prosperity has made you arrogant.", " But you will become a pauper within a very short time.", " Durvasa's words came to be true and Indra found that not only the heaven but all the three worlds had become bereft of goddess Laxmi.", " Prosperity vanished and poverty prevailed everywhere.", "The deities became worried and went to take the help of Lord Brahma.", " Lord Brahma took the deities to Lord Vishnu.", " Lord Vishnu became pleased with their eulogy and said -- I will take incarnation as Kurma.", " If the ocean were churned with the help of Mandarachal mountain and Vasuki, then goddess Laxmi would manifest herself.", " I shall hold the Mandarachal mountain on my back.", "This way the churning of ocean commenced.", " The Mandarachal mountain was uprooted and placed inside the 'Ksheer-Sagar' and which rested on the back of Lord Kurma.", " The serpent--Vasuki, was held by deities and demons on both the ends.", " First of all the most venomous poison--Kalkut emerged from the ocean.", " Seeing both the deities and demons unwilling to accept it.", " (Lord Shiva) drank it.", " After the emergence of Kalkut, goddess Daridra and Varuni manifested themselves.", " Similarly, Eravat- elephant, Uchchaishrava-horse, Dhanvantaari, Surabhi--cow and Parijat- tree emerged from the ocean.", "Ultimately, goddess Laxmi manifested herself.", " The deities requested her to dwell in the heart of Lord Vishnu and bless all the three worlds by her presence.", " Goddess Laxmi agreed and blessed them. "], "next": "2.5.8", "prev": "2.5.6", "title": "The Incarnations of Matsya and Kurma"}