{"index": "2.5.23", "image": "resized_images/Parashuram.png", "text": " Describing Lord Vishnu's incarnation as Parshuram, Lord Mahadeva told Parvati- -Sage Jamadagni came from the lineage of Bhrigu.\n He had pleased Indra by his tremendous penance and received Surabhi cow in return.\n In course of time he married the daughter of king Renuk whose name was Renuka.\n A child was born to them, who was named 'Ram' by Sage Bhrigu.\n The child was also known as 'Jamadganya' because of Jamdagni.\n After growing up, Ram became proficient in all the scriptures.\n He also mastered various weaponaries.\n One day, the king of Haihaya named Arjun arrived at the hermitage of Jamadagni.\n Sage Jamdagni treated the king with due honour and respect.\n He presented numerous gifts to the king.\n Arjun wanted nothing else but the Surabhi--cow from Sage Jamdagni which he was unwilling to part away with.\n Ultimately, Arjun forcibly took away the divine cow.\n The cow was unwilling to go alongwith Arjun and she attacked his army with her sharp horns.\n As a result, Arjun's whole army was liquidated within no time.\nThe revengeful Arjun killed Jamadagni.\n At the time of this incident.\n Ram was not present in the hermitage.\n Ram wanted to avenge his father's death and did a tremendous penance to please Lord Vishnu.\n Lord Vishnu became pleased by his devotion and presented many divine weapons to him.\n The weapons included the famous axe--Parshu and Vaishnav-bow.\n After acquiring Parshu from Lord Vishnu, Ram became famous as Parshuram.\n He had vowed to kill all the Kshatriyas, which he did only, the clan of Ikshavaku was spared by him as he had promised his mother that he would not harm Ikshavaku and his clan.\n After freeing the earth from the terror of Kshatriyas, Parshuram performed an Ashwamedha yagya and donated his whole kingdom, to the brahmins.\n He then went to do penance at the hermitage of Nar-Narayan. END OF PADMA PURAN ", "next": "3", "prev": "2.5.22", "title": "Parashuram"}