{"index": "2.5.16", "image": "resized_images/Jarasandh.png", "text": [" Jarasandh was the father-in-law of Kansa.", " When he learnt about Kansa' death he surrounded Mathura with a huge army.", " Sri Krishna was well aware of Jarasandh's might and bravery.", " He was also convinced that it would not be easy to defeat Jarasandh.", " So, he remembered Daruk--his eternal charioteer and sought his help.", " Daruk appeared with a divine chariot named Sugreeva-- pushpak.", " The chariot was well armed with all the divine weapons of lord Vishnu.", " Sri Krishna and Balaram then entered the battlefied mounted on that divine chariot.", " A fierce battle was fought between Sri Krishna and Jarasandh's army.", " Jarasandh covered Krishna chariot with his various weapons but Sri Krishna destroyed them with his 'Chakra'.", " Sri Krishna then destroyed Jarasandh's army by showering volley of arrows from his famous bow--Sharang.", " Seeing the death and destruction in his army, Jarasandh came forward to fight Balaram.", " Balaram attacked Jarasandh with his dangerous weapon--Hala (plough) and destroyed his chariot.", " Jarasandh fell down on the ground and as Balaram was about to kill him Sri Krishna requested Balaram not to kill Jarasandh.", " After being defeated, Jarasandh sought the help of Kaalyan, who had a large army.", " Kaalyavan agreed to help Jarasandh and surrounded Mathura with his army.", " Realizing that Mathura was no longer a safe place to live, Sri Krishna shifted the whole population of Mathura to Dwarka and went to fight Kaalyavan.", " The battle continued for a long period and after realizing that it was not easy to defeat his enemy, Sri Krishna, ran towards the cave where 'Muchkund' had been sleeping since many past eras.", " Muchkund was blessed with a boon according to which any person upon whom he put his glance after woking from his sleep would die.", " Krishna hid himself behind Muchkund.", " Kaalyavan, who was chasing Krishna, entered the cave and kicked Muchkund.", " Muchkund opened his eyes and saw Kaalyavan.", " Kaalyavan was burnt to ashes.", " This way, Sri Krishna was able to defeat his powerful enemy by his cleverness. "], "next": "2.5.17", "prev": "2.5.15", "title": "Jarasandh"}