{"index": "2.5.20", "image": "resized_images/The Decline of the Yadu Dynasty.png", "text": [" Parvati was listening to the divine tales of Sri Krishna with rapt attention.", " Lord Mahadeva told Parvati-- 'Paundrak was the king of Kashi.", " He did an austere penance for twelve years to please me.", " When I appeared before him, he requested me to make his appearance look like Sri Krishna.", " I blessed him with an appearance similar to that of Sri Krishna.", " People became confused as to who the real Krishna was.", " One day, Narad arrived at Kashi and castigated Paundrak by saying that his intention of befooling people would not meet success as long as real Krishna was alive.", " Paundrak went to Dwarka with a large army and challenged Sri Krishna for a duel.", " Sri Krishna severed the impersonator's head with his chakra.", " Meanwhile, Jarasandh continued to torment the yadavas.", " Sri Krishna decided to settle the matter for once and all.", " He advised Bheema to challenge Jarasandh for a wrestling-bout.", " Jarasandh and Bheema fought valiantly for 27 days.", " While both of them were fighting, Sri Krishna signalled Bheema to tear apart Jarasandh's thighs.", " After the killing of Jarasandh, Sri Krishna released all the kings who had been imprisoned by him.", " After the great war of Mahabharat had ended, Yudhishthir decided to perform a Rajasuya-yagya at Indraprashth.", " Sri Krishna also went there to bless the Pandavas.", " Shishupal was also present at the ceremony.", " He had an old grudge against Sri Krishna and started abusing him.", " Initially Krishna tried to overlook his abuses but when situation went beyond repair Sri Krishna severed his head with his chakra.", " Dantavaktra attacked Mathura to avenge the death of Shishupal.", " A long battle was fought at the bank of river yamuna, which continued for many days.", " Ultimately, Sri Krishna was successful in killing Dantavaktra with his mace.", " There was a childhood friend of Sri Krishna whose name was Sudama.", " He was a poor brahmin.", " Once, he went to meet Sri Krishna.", " Sri Krishna, being an incarnation of the almighty immediately understood the precarious situation his poor friend was living in.", " He blessed Sudama as a result of which he got rid of his poverty and became prosperous.", " Sri Krishna had one crore sons from his sixteen thousand queens.", " Pradyumna was his eldest son.", " The yadavas dominated the whole earth and had become arrogant after being intoxicated by their power.", " There is an interesting tale how this powerful yadava dynasty met their downfall -- Once, some young yadavas played a prank with Sage Kanva, which caused the downfall of the Yadavas.", " One day, some Yadva children went at the bank of river Narmada where sage Kanva was doing penance.", " Samba was one of those Yadava children.", " He disguised himself as a pregnant woman by keeping a pestle under his clothes.", " All the yadava children then went near Sage Kanva and asked him as to when was the pregnant woman supposed to deliver a child.", "Sage Kanva furiously cursed them that the whole clan of yadavas would be liquidated because of that very pestle.", " All the children were scarred and told Sri Krishna about the mistake they had made.", " Sri Krishna ordered that the iron pestle be crushed to powder and be thrown into a pond.", " But, that was not the end of the matter, as long reeds grew all around the pond.", " The reeds had very sharp edges.", " A fish swallowed a small part of that iron pestle and was subsequently caught by a fowler, who retrieved that iron-piece from the fish and fixed it on the top of his arrow.", " In course of time all the Yadavas developed enemity among themselves and killed each other with those sharp-edged reeds.", " Once, Sri Krishna was taking rest under the shade of 'Kalpa' tree.", " The fowler mistook his pink foot to be that of a deer and pierced it with his arrow.", " When the fowler arrived at the spot he found Sri Krishna in an injured condition.", " The fowler regretted his action and begged for Sri Krishna's pardon.", " Sri Krishna consoled the fowler by saying that he had committed no crime.", " Meanwhile, Daruk arrived there on his chariot.", " Sri Krishna instructed Daruk to call Arjuna as soon as possible.", " Arjuna arrived at the site within a short time.", " Sri Krishna told Arjuna--'The time for my final departure has arrived.", " Please call all my eight queen consorts.", "' Arjuna rushed towards Dwarka to summon the queens but Sri Krishna had already left for his heavenly abode before he could come back with the queens.", " Arjuna informed the queens about Sri Krishna's injury.", " In a short time the news spread like a wild fire and all the residents of Dwarka rushed towards the site of incident.", " After reaching there, the eight queen consorts of Krishna found that their beloved husband had already departed.", " All of them gave up their lives and united with Sri Krishna.", " The great Yadavas like Vasudev, Ugrasena and Akrur followed suit.", " Balaram could not bear the sorrow caused by Sri Krishna's separation and he gave up his life.", " His wife--Revati entered the burning pyre with her husband's body in her lap.", " Similarly all the rest of Sri Krishna's family members like Rukmi's daughter, Pradyumna, Usha and Aniruddha left for heavenly abode.", " Arjuna performed the last rite of all the dead Yadavas.", "Eventually, Dwaraka got submerged into the ocean.", " Thus, Sri Krishna after having liberated the earth from all the sinners left his mortal body.", " After completing his story Lord Mahadeva told Parvati that Sri Krishna takes incarnation whenever there is predominance of sin or sinners.", " He also revealed to her that Sri Krishna would incarnate as Kalki at the fag end of Kalkiyuga to liquidate the 'mlechchhas'. "], "next": "2.5.21", "prev": "2.5.19", "title": "The Decline of the Yadu Dynasty"}