{"index": "2.5.8", "image": "resized_images/NriSimha Incarnation.png", "text": " Continuing with the various incarnations of Lord Vishnu, Lord Mahadeva told Parvati --- Sage Kashyap had two mighty sons from Diti--Hiranyakashipu and Hiranyaksha. Hiranyaksha had once carried the earth to Rasatala. The deities requested Lord Vishnu to rescue the earth. Lord Vishnu took the incarnation of a boar and killed Hiranyaksha with his sharp horn.When Hiranyakshipu learnt about his brother's death he went to Merugiri mountain and started doing penance to please me (Lord Shiva). I blessed him with immortality, Later on, Hiranyakashipu married Uttanpad's daughter--Kalyani and had a son named Prahlad from her.Inspite of being born in the clan of a demon, Prahlad proved to be an extremely religious child and was a supreme devotee of Lord Vishnu. When Hiranyakshipu came to know about Prahlad's religious tendency, he tried his best to stop him from worshipping Vishnu. But, all his efforts went in vain and Prahlad continued to worship Lord Vishnu.Hiranyakashipu instructed his subordinates to kill Prahlad but each time he came out unharmed. One day, Hiranyakashipu pulled out his sword and said---'You say that Vishnu is omnipresent. Is he present in this pillar?' Having said like this he assaulted the pillar with his sword. Suddenly to his Sheer amazement, Lord Vishnu manifested himself from that pillar in the form of Nrisimha. Hiranyakashipu had been blessed by Lord Shiva that he could be killed neither by a man nor a beast. No weapon could harm him. He could be killed neither during the day nor during the night. Hiranyakashiu had taken into consideration all the possible threat perceptions to his life and tried to become immortal.But, Lord Vishnu takes incarnation to protect the humanity whenever religiousness is under threat. This time, Lord Vishnu took incarnation as Nrisimha (partly lion and partly human) and tore apart his belly with his sharp nails.After the death of Hiranyakashipu, Prahlad was coronated as his successor. Prahlad ruled justly and his subject were happy and satisfied. ", "next": "2.5.9", "prev": "2.5.7", "title": "NriSimha Incarnation"}