{"index": "3.1.16", "image": "resized_images/The Description of Universal Order.png", "text": [" When the great sages crowned Prithu as the king of the entire earth, Brahma had also divided the kingdoms.", " Thus, Brahma appointed Chandrama as the ruler of all the Nakshatras, planets, Brahmins, vegetation, Yagya, penance etc.", " He also appointed Kuber as the ruler of the kings, Varun as the ruler of the water bodies, Vishnu as the ruler of Adityas and Agni as the ruler of Vasus.", " Similarly, Daksha was appointed as the ruler of all the Prajapatis, Indra as the ruler of Marudgana and Prahlad was appointed as the ruler of the demons.", " Dharmaraaj Yama became the ruler of Pitragana and Airavat became the ruler of all the elephants.", " Garud came to rule the birds.", " Indra was appointed as king of the gods, Uchchaisharva as the king of the horses, Vrishabh as the king of the cows.", " Lion became the king of the beasts, Sheshnaag of the snakes, Himalaya became the king of all the landmasses, Kapil became the king of the sages and tiger became the king of those animals that have nails and long teeth.", " Thereafter, Brahma appointed Dikpals (guardians of the directions) on all corners of the earth.", " These Dikpals still guard the earth, which has seven continents and scores of big and small cities.", " All the gods, demons, human beings, animals, birds, reptiles, in fact every living being have originated from the parts of omnipotent Lord Vishnu.", " Hence nobody but Lord Vishnu has the capacity to foster all the living beings on earth.", " That eternal God creates the world fosters it and ultimately destroys it.", " Thus, the Lord has four parts in the form of this entire creation.", " One of His parts remains unmanifested as Brahma.", " Second part appears like Prajapatis.", " Time is His third part whereas all the living beings constitute His fourth part.", " Since the beginning, during the existence and till the ultimate annihilation of the universe, the process of creation continued through Brahma, Prajapatis and all other living beings.", " In the beginning, Brahma creates the primitive living beings.", " Then the process of creation is taken over by Prajapatis.", " When their progenies populate the world, the process of creation continues spontaneously.", " Without Kaal, no one including Brahma, Prajapatis and all the living beings can carry out the process of creation.", " Shri Hari is in the base of every new creation that takes place through a pre-existing creation.", " The supreme abode of Lord Vishnu remains intangible.", " Shri Hari bears the intangible, pure and all pervasive spirit of the universe as Kaustubh Mani.", " He bears the intelligence as his mace.", " He bears the two kinds of ego in his conch and Shaarang bow.", " Third kind of ego is present as the wheel in His hand.", " Vayjayanti garland that adorns His neck represents five senses and five physical elements.", " He bears the sense and motor organs as the arrows and the sword that He holds is knowledge.", " Thus, everything is dependent on Shri Hari.", " He is Himself intangible but for the benefit of human being, he bears all these things as ornaments.", " Even the counting of time is present in Him.", " God is present in all the seven worlds.", " He is the base of all the knowledge, our ancestor and the ancestors of our ancestors.", " He is present in the gods, human beings, animals, all the Vedas, Ayurveda, Puraan and other religious scriptures.", " All the visible and invisible things in the world have Lord Vishnu in them.", " Nothing is different from Him.", " Such a feeling in the mind keeps all the miseries and physical ailments away. "], "next": "3.2", "prev": "3.1.15", "title": "The Description of Universal Order"}