{"index": "3.1.15", "image": "resized_images/Lineage of Kashyap’s Other Wives and Origin of Marudgana.png", "text": " After the death of Hiranyakashipu, Prahlad continued his lineage.\n Prahlad had a son, Virochan.\n Virochan in his turn had Bali as his son.\n The prowessive Bali was sent to the nether world by Vaaman incarnation of Lord.\n Bali had one hundred sons among whom Baanasur was the eldest.\n Kashyap’s second wife Danu had sons like Dwimurdha, Shambar, Ayomuk, Shankushira, Kapil, Shankar, Ekchakra, Mahabaahu, Taarak, Mahabal, Swarbhanu, Vrishparva, Pulom and Viprachiti.\n Swarbhanu had a daughter- Prabha whereas Sarmishtha, Updan, and Haishira were the daughters of Vrishparva.\n Vaishwanar had two daughters- Puloma and Kaalka who were married to Kashyap.\n From the part of Kashyap, they gave birth to sixty thousand giants known as Paulom and Kaalkeya.\n Kashyap’s another wife, Taamra gave birth to six daughters- Shuki, Shyeni, Bhaasi, Sugreevi, Suchi and Griddhrika.\n Shuki gave birth to the birds like parrots, owls and crows.\n Shyeni gave birth to sleep while Bhaasi produced light.\n Griddhrika gave birth to vultures whereas Suchi produced aquatic birds.\n Sugreevi gave birth to equine animals like horse, camels and asses.\n Vinata, one of the wives of Kashyap gave birth to Garud and Arun.\n Garud became the vehicle of Lord Vishnu while Arun became the charioteer of the Sun.\n Surasa gave birth to millions of the snakes.\n Kadru also had great snakes like Shesha, Vaasuki, Takshak, Shankhshwet, Mahapadm, Kambal, Ashwatar, Ilaputra, Naag, Karkotak, Dhananjay etc.\n as her sons.\n Krodhavasha gave birth to anger and devils.\n Surabhi gave birth to cows and buffaloes.\n Ira gave birth to the trees, creepers, and scores of grasses.\n Khaasa gave birth to Yaksha and monsters.\n Muni produced elves whereas Arishta gave birth to Gandharvas.\n After the annihilation of her sons, Diti once again pleased Kashyap and sought a son who could destroy even Indra.\n Kashyap granted her boon but stipulated that she would have such a son only when she observes complete sanctity during one hundred years of gestation period.\n Diti agreed to abide by the stipulation.\n Then they copulated as a result of which Diti conceived.\n When Indra came to know that Diti had conceived a son who would be able to destroy even him he arrived at Kashyap’s hermitage and began to serve Diti with full devotion.\n He had in fact arrived there to see if by chance Diti ever violated the stipulation for then he would easily destroy the unborn child without incurring any sin.\n Sometime before the completion of gestation period, one day, Diti did violate the stipulation.\n She forgot to wash her feet after attending nature’s call and retired on the bed.\n Indra was waiting for the moment.\n He at once entered Diti’s womb carrying his mace in hand.\n There he broke the foetus into seven pieces but still the foetus survived and began to cry loudly.\n Indra then broke each of those seven pieces into seven pieces more and consoled them not to cry.\n Those forty-nine pieces of Diti’s foetus later on came to be known as Marudgana the assistants of Indra. ", "next": "3.1.16", "prev": "3.1.14", "title": "Lineage of Kashyap’s Other Wives and Origin of Marudgana"}