{"index": "3.1.12", "image": "resized_images/Attempts to Kill Prahlad.png", "text": [" When the demons saw that their all efforts failed to faze Prahlad and that he was preaching the demon children they informed Hiranyakashipu about all these happenings.", " Hiranyakashipu at once called his cook and ordered him to poison Prahlad through food.", " But the poisonous food also could not hurt Prahlad.", " In fact, its poison was rendered ineffective by the recitation of Lord’s name.", " This frightened the cook.", " He informed Hiranyakashipu about that miraculous event.", " Hiranyakashipu then ordered the priests who were Prahlad’s teachers to invoke the ogress Kritya in order to kill Prahlad.", " The teachers tried to convince Prahlad before invoking Kritya\"O prince, you are the son of great Hiranyakashipu and have taken birth in Brahma’s lineage.", " What have you to do with matters like God and all that?", " The whole world is dependent on your father.", " You should also take refuge of your father and stop praising his opponent.", " Father is revered and even greater than the teachers.", "\" Prahlad said-\"O fortunate ones! I know the prowess of my father.", " I also do not doubt regarding my father’s reverence and greatness.", " I will not commit any crime against him but kindly listen to me what I mean by the endless God.", "\" \"O teachers! There are four attainable goals in one’s life.", " You ask me what have I to do with He, who helps all the human beings to attain these four goals- Dharma, Arth, Kama and Moksha.", " You are my teachers.", " You are free to say anything to me.", " But within me stays He who is the creator of all, who is the preserver of all and who is the destroyer of all of us.", " Kindly forgive me if I have committed any thing wrong in your honour.", "\" The teachers said-\"O foolish boy, we saved you from imminent death thinking that you are our disciple and that you will not balderdash in future.", " But still you speak nonsense.", " Listen, if you don’t drop your stubbornness we’ll have to invoke Kritya the ogress in order to get you slain.", "\" Unfazed Prahlad said that life and death were immaterial for the soul that protects or destroys itself through auspicious and inauspicious deeds.", " Hence one should always strive to behave in an auspicious way.", " But Prahlad’s words further enraged his teachers.", " They invoked the ogress Kritya to get Prahlad slain.", " Kritya hit Prahlad’s chest hard with her trident.", " But as soon as the trident touched his chest it broke into pieces without harming Prahlad.", " Seeing her attempt failed, Kritya killed the teachers and disappeared.", " His teachers’ death caused immense pain for Prahlad.", " Mourning for their death, he prayed Lord Vishnu to resurrect them.", " Hearing his prayers, Lord Vishnu once again granted life to his teachers.", " The teachers got up as if from a deep slumber.", " They realised their mistake and blessed Prahlad and resolved never to have hostility against him.", " Then they went to the palace and informed Hiranyakashipu about all the happenings. "], "next": "3.1.13", "prev": "3.1.11", "title": "Attempts to Kill Prahlad"}