{"index": "3.1.8", "image": "resized_images/Tale of King Ven and Prithu.png", "text": [" Parashar says- \" With the help of Dhruv, his wife gave birth to two sons- Sishti and Bhavya.", " Sishti had five sons- Ripu, Ripunjay, Vipra, Vikal and Vrikteja.", " Ripu had a brilliant son Chaakshush.", " Chaakshush had a son Manu.", " Manu had sons- Puru, Kuru, Shatadyumna, Tapasvi, Satyavaan, Suchi, Agnishtome, Atiraatra, Sudyumna and Abhimanyu.", " Kuru had sons- Anga, Suman, Khyaati, Kratu, Angira and Shivi.", " Anga had a son named Ven.", " The sages had churned the right hand of Ven to produce a son named Vainya.", " He later on became renowned as Prithu.", " He had even milked the earth for the benefit of his subjects.", "\" Maitreya says- \"Why did the sages churn Ven’s hand?", " What was their purpose of getting Prithu?", "\" Parashar says- \"Mrityu had his first child as a daughter named Sunitha who was married to Anga.", " Sunitha had given birth to Ven.", " Ven had all the faults of his maternal grandfather Mrityu and hence was devil-like in nature.", "\" At the time of his coronation, Ven had declared- \"I am the God and the Yagyapurush.", " Hence, in future, no one shall perform Yagyas and donate Dakshina.", "\" The sages praised him and said- \"O king! We speak about the benefit of you and your subjects.", " Through grand Yagyas, we shall worship omnipotent Lord Hari.", " Thus pleased, he will grant all your desires.", " O king! In the kingdom of which kings, Lord Hari is worshipped as the presiding deity of Yagyas, He fulfils all their desires.", "\" Ven said- \"Who is greater than me and even venerable, whom you regard as the presiding deity of the Yagyas?", " All the deities like Brahma;", " Vishnu, Mahesh, Indra, Vayu etc.", " are present in the body of the king.", " Hence, the king has all the virtues of these deities.", " Therefore, do what I say.", " Such as a woman’s duty is to serve her husband, similarly it is your duty of all of you to obey my dictate.", "\" The sages tried to convince Ven repeatedly but in vain.", " At last, when he did not agree to their proposal, the sages killed him.", " Immediately after killing the king, the sages saw the clouds of dust rising all around.", " It was revealed to them upon enquiry that the subjects of a king-less kingdom have resorted to plundering and looting each other and it was because of that stampede that clouds of dust were rising.", " The sages then churned the thighs of issue-less king and produced an ugly black man.", " He was feeling excited and asked the sages what he should do?", " The sages asked him to Nishid (sit down);", " hence he came to be known as Nishaad.", " His progeny came to be known as Nishaadgana.", " Appearance of Nishaad did away with all the sins of Ven.", " The sages then churned Ven’s right hand and produced prowessive Prithu whose body was radiating like fire.", " As soon as he appeared, bow and arrow and shield of Lord Shiva descended from heaven and all the subjects felt extreme joy.", " With the birth of such a pious son, Ven attained a position in the heaven.", " For the coronation of Prithu, Brahma himself had appeared there with the water from all the rivers and oceans, all kinds of gems and along with all the deities.", " Presence of chakra in right hand of Prithu pleased Brahma.", " This chakra of Lord Vishnu is present in the hands of extremely dominating kings.", " Such a king remains unaffected even by the gods.", " Thus occupying the royal throne, King Prithu was a boon for his subjects.", " He was so religious that the seas and mountains paved way for him.", " His flag always remained fresh and new.", " Even there was no need to sow the seeds;", " the earth herself provided all the cereals.", " Cows gave milk spontaneously and every leaf of all the trees in the kingdom was full of honey.", " Immediately after his appearance, King Prithu organised a grand Yagya.", " At the time of Somabhishek (bathing with grape-wine) during the Yagya, a man and a woman appeared from the earth.", " The sages advised them to pray King Prithu.", " With folded hands they asked that the king had arrived moments before them.", " His reputation had not spread far and wide.", " Why should then they pray such a king?", " The sage said that they should pray the king for the great achievements he would attain in future.", " King Prithu thought that it was because of merits that a man becomes praiseworthy.", " ‘Hence I will do exactly the same things that this couple would recite during the prayers’ thought the king.", " Thus during the later course, king Prithu planted those virtues firmly in his conscience and ruled the earth.", " During his rule, he performed many great Yagyas.", " During the anarchy of his father’s regime, all the vegetation had been destroyed from all over the earth.", " There was nothing for the subjects to satisfy their hunger with.", " So, they approached him and said- \"O great king! Due to the anarchy of your father’s regime, the earth had annihilated all the cereals within her.", " Your subjects have no choice but to starve.", " Kindly protect us from this condition.", "\" Pitiable condition of the subjects infuriated king Prithu.", " Taking the divine weapons of Lord Shiva, he ran after the earth.", " In guise of the cow, the earth ran in all the three worlds but wherever she went she found Prithu still chasing her.", " Thus shivering with fear, she ultimately appeared before him and said- \"O king! Don’t you see the sin in killing a helpless woman.", "\" Prithu said- \"If killing a wretched person benefits scores of other people, there is no sin doing so.", "\" The earth said- \"You want to kill me in the interest of your subjects but think what will be the base of the subject then?", "\" Prithu said- \"You need not worry about that.", " I will myself support my subjects.", "\" These words frightened the earth.", " She greeted the king and said- \"O king! All the tasks started with a distinct purpose reach their completion successfully, so I am telling you a way out of the present condition.", " Do then, as you desire.", " I can give out all the herbs and cereals that I have annihilated in the form of milk.", " So, for the benefit of the subjects, kindly produce such a calf for which I can give milk spontaneously with motherly feelings.", " You then provide me with a plain surface everywhere so that I can produce milk that is the seed of all the cereals and herbs.", "\" King Prithu then uprooted many great mountains with his bow and arrow and stowed them at a single place.", " Before that there was no distinct demarcation of village, towns, cities etc.", " because of the plain surface of the earth and there was no distinct sequence of cereals, cows, agriculture and trade.", " All this systems started from the time of Prithu.", " Since then people began to populate those parts of the earth that were plain.", " For the benefit of his subjects, King Pritu himself milked all the cereals from earth making Swayambhu Manu a calf.", " It is the cereals that still sustain the entire population of the world.", " Since then King Prithu came to be known as the father of earth because he had spared her life. "], "next": "3.1.9", "prev": "3.1.7", "title": "Tale of King Ven and Prithu"}