{"index": "3.1.10", "image": "resized_images/Marriage of Prachetas and Birth of Prajapatis.png", "text": " Parashar says- During the time when Prachetas were engaged in penance, the earth was unprotected. Hence, huge trees came to cover her everywhere on land. Their foliage was so dense they that cut off entire sky and the sun could not reach the surface of the earth. After their emergence from the sea, Prachetas got very angry when they saw the trees. In anger, they let out formidable flames mixed with ghastly winds and uprooted all the trees before reducing them to ashes. A massive destruction of the trees followed. Seeing that Soma, the king of the trees approached Prachetas and requested- 'O kings! Kindly relinquish your anger and listen to what I say.' I will mediate a pact between the trees and you. The trees have produced an extremely pretty girl named Marisha. Her creation has been meant only for the continuation of your progeny. She will produce Daksha Prajapati who will be as radiant as the fire and cause much increase in your progeny further. In the ancient times, a great savant of Vedas, sage Kandu was observing penance at the bank of river Gomti. Frightened by his penance Indra sent an elf Prabhalocha to create a disturbance. That elf successfully created a disturbance in the penance of Kandu who then began to live with her in a cave. Kandu passed one hundred years enjoying sensual pleasures with the elf. One day, the elf expressed her desire to leave for her heavenly abode. This came as a shock for the sage Kandu. He requested her to stay for some more time with him. The elf agreed to his request and stayed with him for another hundred years. Then once again she expressed her desire to leave for her heavenly abode. Once again, blinded by lust, the sage requested her to stay for some more time. Once again the elf stayed for another hundred years with Kandu. Thus, every time, when the elf got ready to leave, sage stopped her. The elf knew about the agony of separation that a person experiences who is blinded by lust. She also feared the curse that such a person might pour down out of agony. Thus she herself did not desert the sage and their love kept on increasing like a new moon. One day, towards the evening, the sage hurriedly left his hut. Amazingly Prabhalocha enquired about the reasons why he was going out in such a hurry. The sage replied that as it was dusk, he should offer his evening prayers. The sage's reply amazed the elf further. Laughingly, she said- \"O knower of religion, your day has ended after hundreds of years! Who will not be surprised to learn that your day ends after hundreds of years.\" The sage said- \"You had arrived at the river bank right in the morning today. You passed the whole day with me and now its evening. Why do you laugh at me then? Prabhalocha said- \"O Brahmin! Hundreds of years have passed since I had arrived at your hut.\" Perplexed sage asked her- \"Tell me exactly how much time has passed in our present communion? Prabhalocha told the sage that they had together passed nine hundred and seven years six months and three days. Hearing this, the sage began to curse himself that he was so sunk in the carnal pleasure with the elf that he even forgot the time. He also began to fret that his whole penance had been brought to nought. Thus cursing himself, the sage also scolded the elf and asked her to leave his hut at once. \"The elf was shivering in fear while her whole body was drenched in sweat. When she left the hermitage, she wiped her sweat with the leaves of the trees. While having carnal pleasure with the sage, Prabhalocha had conceived. Her foetus also oozed out in the form of sweat and was collected on the leaves. The wind brought the different parts of the foetus together while I nourished it with my rays. Thus the foetus grew safely and ultimately took birth as a girl child, Marisha. The trees will present you that same girl as your wife\", said Soma. On the other hand after his penance was disturbed sage Kandu migrated to Purushottam region (modern Jagannath-Puri) and began his penance afresh to please Lord Vishnu. Tale of Marisha's previous birth Marisha, daughter of sage Kandu and Prabhalocha was a queen in her previous birth. She had lost her husband without having any child. She had then pleased Lord Vishnu with her devotion. The Lord had then asked her to seek a boon. She said- \"O Lord! Having been widowed at a young age, I feel that my life has gone futile. I am very unfortunate. Hence O Lord! May I have by your grace, a virtuous husband like you and sons like Prajapati in my next birth. May I take birth not from the body of my mother. Lord Vishnu said- \"All your wishes shall come true in your next birth. You will have ten prowessive and popular husbands. With their help, you will give birth to Prajapati whose progeny will populate all the three worlds. You will take birth not from your mother's body still you will be unmatched in beauty.\" Thus, coerced by Soma, Prachetas dropped their angry stance and accepted Marisha as their wife. From the parts of Prachetas, Marisha gave birth to Daksha Prajapati who had emerged from Brahma earlier. Following the dictate of Brahma, Daksha Prajapati produced different kinds of living beings as his children. First of all, he created womenfolk from his mind. He got ten of those women married to Dharma. Thirteen women were married to Kashyap while twenty-seven were married to Chandrama. All the gods, demons, Nagas, cows, birds, Gandharvas, Apsaras, giants etc. are the progeny of those fifty women. Maitreya says- \"O great sage! I want to hear the tale of origin of the gods, the demons and all other creatures in detail.\" Parashar says- \"Daksha created the sages, Gandharvas, demons, and serpents from his mind first. But none of those creatures could continue the progeny. So, with an intention of producing his progeny through carnal union, Daksha married Asikni, the daughter of another Prajapati. Daksha and Asikni together produced five thousand sons. All of those sons were eager to continue the process of reproduction when Devarshi Narad approached them and said- \"O children! It appears from your action that all of you are eager to begin the process of reproduction right now. But before you do anything, kindly listen to what I say. All of you are so ignorant that you do not know anything about the earth. How then will you carry out the reproduction? Look! You can move anywhere in the universe, so why don't you go and see the end of the earth?\" Thus motivated by Narad, all the five thousand sons of Daksha dived into the sea and never returned thereafter like a river annihilates in the ocean. Daksha then married Vairuni and produced one thousand sons. They also intended to carry out reproduction but were misguided by Narad. They too followed the footsteps of their elder brothers. Learning about the fate of his sons, Daksha cursed Narad. Then Daksha and Vairuni gave birth to sixty daughters. Ten of them were married to Dharma, thirteen to Kashyap, twenty- seven to Soma, four to Arishtnemi and two to Angira and Krishasva each. Arundhati, Vasu, Yaami, Lambaa, Bhaanu, Marutvati, Sankalpa, Muhurta, Saadhya and Vishwa were the wives of Dharma. Vishwa gave birth to Vishwadeva, Saadhya to Saadhyagana; Marutvaan was the son of Marutvati. Vasu gave birth to eight Vasus. Lambaa gave birth to Ghosha, Yaami to Naagveethi whereas Arundhati gave birth to all other creatures that dwell on earth. Sankalpa produced Sankalp that is omnipresent resolution. Names of the eight Vasus were Aap, Dhruv, Soma, Dharma, Anil, Anal, Pratyush and Prabhas. Vaitand, Shram, Shant and Dhvani were the sons of Aap. All annihilating Kaal was the son of Dhruv. Varcha was the son of Soma. Dravin, Huta, Ityavar, Shishir, Pran and Varun were the sons of Dharma. Manojav and Avigyaatgati were the sons of Anil. Sharastamb, Shaakh, Vishaakh and Naigmeya were the sons of Anal. Pratyush had a son Deval. Vatstree the sister of Brihaspati was the wife of Prabhas. They had Vishwakarma as their son. Vishwakarma himself had four sons- Ajaikpad, Ahirbudhanya, Twashta, and Rudra. The great penancer Vishwaroop was the son of Twasta. O great sage! Har, Bahuroop, Treyambak, Aparajit, Vrishakapi, Shambhu, Kapardi, Raivat, Mrigvyadh, Sharpa and Kapaali are the eleven Rudras. Sage Kashyap had thirteen wives- Aditi, Diti, Danu, Arishta, Surasa, Khasaa, Surabhi, Vinata, Taamra, Krodhavasha, Ira, Kadru and Muni. Now listen to the description of their progenies. During the previous Manavantar, there were twelve gods named Tushit. At the end of the Manavantar, they met together and said- \"O brothers! Let us now enter the womb of Aditi and take birth as the gods again in Vaivasvat Manavantar.\" Thus, Vishnu, Indra, Aryama, Dhataa, Twashta, Pushaa, Vivasvaan, Savita, Maitra, Varun, Anshu and Bhaga, these twelve sons of Aditi came to be known as Aditya. The twenty-seven wives of Soma gave birth to many talented sons. Wives of Arishtnemi gave birth to sixteen sons. Thus in all thirty-three gods including eight Vasus, eleven Rudra, twelve Aditya, Prajapati and Vashatkar have been described in the Vedas. All of them are capable of taking birth at will. Just as the Sun rises and sets, similarly these gods also appear in different Yugas. From the part of Kashyap, Diti gave birth to two invincible sons, Hiranyakashipu and Hiranyaaksh and a daughter Sinhika who was married to Viprachiti. Hiranyakashipu had four sons- Anuhlad, Aahlad, Sahlad and Prahlad. ", "next": "3.1.11", "prev": "3.1.9", "title": "Marriage of Prachetas and Birth of Prajapatis"}