{"index": "3.1.4", "image": "resized_images/Birth of Prajapatis and their Progeny.png", "text": " At one point, the process of creation got saturated and no increase took place in the number of living beings. Then, with a desire of continuing the creation, Lord created nine sages from His thought. Then he produced nine daughters and handed them over as the wives to those nine sages. When initially produced sons of Brahma took to asceticism, He got very much infuriated. His anger was enough to burn all the three worlds. From this anger, Rudra originated who was shining like the Sun. Rudra had appeared in half- masculine and half-feminine form. Immediately after His appearance, Rudra separated His body into eleven male parts and eleven female parts. Then Swayambhu Manu appeared from the body of Brahma. He agreed to follow Brahma’s dictate of continuing creation. He got a woman Shatrupa who had also appeared along with him. Together they begot two sons, Priyavrata and Utaanpaad and two daughters, Prasooti and Aakooti. These two daughters were married to Daksha and Prajapati respectively. Prajapati and Aakooti gave birth to twins, Yagya and Dakshina. Yagya and Dakshina got married and produced twelve sons who later on came to be known as Yaam, the gods. Daksha and Prasooti produced twenty-four daughters, thirteen of which were married to Dharma. The remaining eleven daughters were married to Bhrigu, Shiva, Marichi, Angira, Pulastya, Pulaha, Kratu, Atri, Vashishta, Agni and Pitars. From his thirteen wives, Dharma produced Kama, Darpa, Niyam, Santosh, Lobha, Shrut, Dand, Naya, Vinay, Bodh, Vyavasaay, Kshema, Sukh and Yash. Kama got married to Rati and produced Harsh. Darpa married Hinsa and produced a son Anrit and a daughter Nikriti. Anrit and Nikriti got married and produced Bhaya and Narak and their wives Maya and Vedana. Maya produced Mrityu, the destroyer of all the creatures in the world. Vedana produced a son, Dukh. Mrityu produced Vyadhi, Jara, Shok, Trishna and Krodh. These are all the fierce appearances of Lord Vishnu and cause Pralay. The omnipresent eternal God creates this world in the form of Manus, protects it and ultimately destroys it. There are four kinds of Pralay- Naimittik, Prakritik, Aatyantik and Nitya. Among them, Naimittik is Brahma Pralay during which God takes a nap. During Prakritik Pralay, the universe annihilates in nature. Annihilation of Yogi in the Supreme Being is Aatyantik Pralay and a decay of physical elements that continues day and night is Nitya Pralay. ", "next": "3.1.5", "prev": "3.1.3", "title": "Birth of Prajapatis and their Progeny"}