{"index": "3.1.7", "image": "resized_images/Dhruv Pleases God with his Penance.png", "text": " The prince Dhruv greeted the sages and continued on his journey.\n At last, he reached a beautiful forest Madhuvan on the bank of the river Yamuna.\n It was the same forest, which was later occupied by a demon Madhu.\n Shatrughana, the youngest brother of Lord Rama had killed the demon Lavan, the son of Madhu in the same forest and founded the township of Mathura.\n In the same forest, prince Dhruv decided to carry out his penance.\n As per the dictate of the sages, he began to recite the mantra continuously.\n Very soon, the earth began to move because of Dhruv’s severe penance.\n Even the seat of Indra could not remain stable.\n A stampede resulted among the gods.\n The gods then hatched a conspiracy to disturb the penance.\n According to the plan an illusionary image of Suniti, Dhruv’s mother appeared before him and pleaded - \"O son! Please stop this severe penance that is bound to decay your body.\n I got you after great desires and worship.\n It is not proper for you to take your stepmother’s words so seriously and desert your real mother.\n You are my only support.\n You are only four or five years old.\n Presently you should pay more attention to your plays and studies.\n Why are you observing such a severe penance then?\n O son! If you don’t give up your penance right now I will give my life.\n\" But Dhruv was so much sunk in the contemplation of Lord Vishnu that he did not hear the wailing of his mother.\n\" His mother then said- \"Run, O son! Run away to save your life.\n Look! Formidable demons are approaching.\n They are carrying lethal weapons.\n\" Suddenly that illusionary image blew out intense fire from her mouth.\n That fire took appearance of many dreadful monsters, who were shouting loudly like ‘kill him’, ‘eat him’.\n Those monsters bore the heads of lion, camel, crocodile etc.\n and appeared extremely formidable.\n The monsters were roaring loudly.\n But Dhruv’s mind was deeply in contemplation.\n He neither saw the monsters or heard the noises made by them.\n Thus, seeing their all attempts failed.\n The gods decided to take refuge at Lord Vishnu.\n There they said- \"O Lord! We have come to you perplexed by the severe penance of Dhruv the son of Utaanpaad.\n His penance is increasing like a waxing Moon.\n We are not sure if he desires for the position of Indra, Surya, Kuber, Varun or any other deity.\n But kindly remove our fears.\n\" Assuring the gods, the Lord said- \"That boy has no desire for attaining the position of any deity.\n But I will definitely grant him whatever he desires.\n But all of you need not worry.\n\" The gods greeted the Lord and returned.\n Ultimately pleased by the severe penance of Dhruv, Lord Vishnu appeared before him in his formal four-armed form and said- \"Dhruv! May it all be well for you.\n I am very much pleased with you.\n\" Hearing these words Dhruv opened his eyes and to his amazement found Lord Vishnu standing before him.\n For a moment he did not believe his eyes.\n Standing before him was the same Lord Vishnu whom he used to see in contemplation.\n For a moment, Dhruv forgot how to pray God.\n He then took refuge of God and said- \"O Lord! If you are pleased with me, kindly bless me with power to pray you.\n My mind is exhilarated with devotion for you.\n It wishes to pray you.\n\" Hearing these words the Lord touched Dhruv with His conch and as soon as it happened, an unbinding stream of devotional prayer sprang from Dhruv’s mouth.\n At the completion of the prayer Lord Vishnu said- \"O son! Your penance succeeds with my sight but my presenting a sight should also not go waste.\n So seek a boon of your desire.\n\" Dhruv said- \"O Lord! Nothing is hidden from your divine sight.\n I started this severe penance out of desperation caused by the harsh words of my stepmother.\n She had ridiculed my insistence of playing in my father’s lap saying that as I was not born to her, I had no right to the king’s love.\n Hence, O Lord! I wish to attain such a position that could be the base of the entire universe.\n\" Lord said- \"O son! You were born in a Brahmin family in your previous birth.\n Then you had pleased me by your abidance to the religion.\n You were also a friend of a prince and wished to enjoy the same royal luxuries that your friend was enjoying.\n You had in fact wished to be a prince.\n Hence O son! You are born as a prince in this birth.\n It is rare to get a place in the lineage of Swayambhu Manu.\n But this honour has no value for a devotee like you.\n O son! I will definitely accord you the position that is excellent among all the three worlds.\n In future you will be the base of all the planets and all the constellations.\n I grant you a fixed position that is far above the Sun, the Moon, the planets, constellations, Saptarishis and all the gods who fly about in divine aircraft.\n Besides it, you will stay there for a complete Kalpa whereas even the gods do not stay in their position more than a single Manvantara.\n Your mother Suniti too will come to stay with you as a bright star for the same period of time.\n There she will stay on an aircraft.\n People will see you with faith for you will show them the right direction.\n\" Thus receiving a boon from Lord Vishnu, Dhruv occupied a fixed position in the northern sky.\n Even the sage like Shukracharya praises Dhruv that how fortunate he is.\n.\n.\n.\n that even Saptarishis go around him? That pivotal position of Dhruv would continue even in the ages to come. ", "next": "3.1.8", "prev": "3.1.6", "title": "Dhruv Pleases God with his Penance"}