{"index": "3.1.6", "image": "resized_images/Dhruv’s Migration to the Forest.png", "text": [" Swayambhu Manu had two sons- Priyavrata and Utaanpaad.", " Utaanpaad had two wives- Suruchi and Suniti.", " Suruchi had a son- Uttam while Suniti had also a son- Dhruv.", " King Utaanpaad loved Suruchi more than he loved Suniti.", " One day the king was sitting on the throne.", " Prince Uttam was playing in his lap.", " Meanwhile Dhruv also arrived there and insisted to play in the lap of his father.", " At his insistence, queen Suruchi ridiculed that as he was not born to her he had no right to the king’s love, … \"so your insistence is useless.", " Though you are also a son of this king but this throne belongs to my son.", " Don’t you know that you have been born to Suniti.", "\" Getting angry over his stepmother’s ridicules, Dhruv went to his mother.", " Suniti consoled her son and enquired about the reason for his anger.", " Dhruv narrated the whole thing to his mother.", " Suniti too got perplexed and said:", " \"O son! Suniti speaks the truth but you don’t worry for no one can do away the virtues of your deeds that you performed in your previous birth.", " Hence you should not feel sorry over such petty things.", " If you feel really sorry by the words of your stepmother why don’t you try to gather virtues?", " Why don’t you try to be a gentle and altruistic person?", "\" Thus consoled by mother Dhruv said- \"Mother! Since now onwards, I will do every such thing so that I may attain the most respected position in the world.", " I am no longer desirous of getting a position granted by others.", " I will achieve the same position as my father has.", "\" Saying this Dhruv left the palace and the town and reached a dense forest.", " Seven Munishwars (mendicants) were already present in the forest.", " Dhruv greeted them all and said very politely- \"O great sages! I am the prince Dhruv.", " King Utaanpaad is my father and his younger queen Suniti is my mother.", " I have arrived here out of desperation.", "\" The sages said- \"O prince! You are just a small boy.", " You have no reason to be worried because your father is still alive and neither you have any disease.", " What then caused you such a severe desperation?", "\" Dhruv narrated the whole events and also that how his stepmother Suruchi ridiculed about his inferior position in the palace.", " The sages said- \"O prince! Kindly tell us whatever you have decided to do to change your destiny and also tell us if we can help you in any way.", "\" Dhruv said-\"O sages! I neither long for wealth or for the kingdom.", " I simply long to enjoy such a position that nobody have ever enjoyed earlier.", " Kindly help me and guide me what I should do to attain such a position.", "\" Marichi said-\"O prince! Nobody can attain such an unparalleled position without the worship of Govind (an epithet of Lord Vishnu), so you also worship that eternal Supreme Being.", "\" Atri said- \"He who is far above the tangible can only satisfy Him and bring you that supreme position.", "\" Angira said-\"Go and worship Govind who holds the entire universe within Him.", "\" Pulastya said-\"Even the wretched people attain the rare salvation worshipping Hari.", "\" Pulaha said-\"Go and worship that Vishnu worshipping whom even Indra attained the position of the gods’ king.", "\" Kratu said- \"Go and worship Janardana who is supreme, who is deity of the Yagyas and Yagya Himself.", "\" Vashishta said-\"O son! You will attain whatever you wish by worshipping Lord Vishnu.", "\" Dhruv said - \"O sages! At my prayers all of you told me about whom I should worship.", " Now kindly tell me what should I do to please the Lord.", "\" The sages said- \"It is imperative for a person, who wishes to worship Lord Vishnu that first of all, he should expel all other menial thoughts from his mind and replace them with the contemplation Lord alone.", " O prince! Thus concentrate on that omnipotent eternal Lord with the mantra - ‘OM NAMO BHAGWATE VAASUDEVAAY’ .", " Your grandfather Swayambhu Manu had himself recited this mantra during the previous age and had received the perfection of his desire from the Lord.", " So you too go and recite the same mantra in order to please Lord Vishnu.\" "], "next": "3.1.7", "prev": "3.1.5", "title": "Dhruv’s Migration to the Forest"}