{"index": "3.1.5", "image": "resized_images/Creation of Rudra and Omnipresence of Laxmi.png", "text": " In the beginning of Kalpa when Brahma was thinking about a son, who would be like him in virtues, a boy with reddish-blue body appeared in his lap.\n Brahma addressed the boy with names like Rudra, Bhava, Shiv, Ibhaan, Pashupati, Bheema, Ugra and Mahadev.\n Brahma also fixed Surya, water, earth, air, fire, sky, Dikshit (graduate scholar) Brahmin and the Moon His abode.\n Since then, all these things idolise Shiv.\n These eleven idols of Shiv have wives like Suvarchala, Usha, Vikeshi, Apara, Shiva, Swaha, Disha and Rohini.\n Shanaishchar, Shukra, Lohitaang, Manojav, Skand, Sarg, Santaan and Buddh are the sons of these idols respectively.\n Rudra Himself got Sati, the daughter of Daksha Prajapati as His wife.\n Sati had committed self-immolation because of the disrespect that her father had shown for her husband.\n In her next birth, she had appeared as Parvati, the daughter of Himalaya and Maina.\n Parvati too got married to Shiv.\n Khyaati got married to Bhrigu and gave birth to two sons Dhata and Vidhaata and a daughter Lakshmi.\n Lakshmi then married Lord Vishnu.\n Maitreya says - \"O sage! It is heard that Lakshmi was produced from Ksheersagar during the churning of the sea but you say that Lakshmi was the daughter of Bhrigu and Khyaati.\n How is it possible?\n\" Parashar says- \"O great Brahmin! Lakshmi who never separates from the Lord is Herself eternal like Him.\n But still, as you have expressed your doubt, I will narrate you the real story.\n\" The famous short-tempered sage Durvaasa is a partial incarnation of Shankar.\n One day, he was wandering on the earth when all of a sudden, he happened to see an extremely divine beauty.\n She was wearing a garland of beautiful flowers.\n The sage requested the beauty to give him that garland.\n She presented the garland respectfully to the sage.\n The sage adorned the garland on his head and began to wander again.\n Right at that moment, he saw Indra riding on Airaavat and going somewhere in the procession of the gods.\n Instinctively, sage Durvaasa put that garland around the neck of Indra but Indra removed it and put it on Airaavat’s head.\n Airaavat pulled the garland with his trunk and smashed it on the ground.\n This whole sequence of events infuriated Durvaasa who cursed Indra.\n \"O Indra! You are so inebriated with your luxuries that you dared to insult my humble gift.\n Hence, all your splendour shall be destroyed.\n You will lose all your wealth.\n\" Indra at once descended from the elephant and began to request sage Durvaasa.\n Durvaasa said- \"Indra! Forgiveness has no place in my personality.\n So, all your repenting is meaningless.\n\" Saying this, sage Durvaasa departed from the scene and Indra to left for Amravati.\n Very soon, the curse began to show its influence.\n With the loss of Indra’s luxuries, all the verdancy on the earth too began to wane.\n Hermits too began to give up Yagyas.\n All the human beings began to be guided by greed and gave up pious virtues.\n And at a place where pious virtues have no room, Lakshmi too doesn’t stay there.\n She made her abode in the abysmal depth of the sea.\n Very soon, the demons launched an attack on the gods and drove them out of heaven.\n Indra along with other gods approached Brahma and told him the whole thing.\n Brahma suggested them to take refuge at Lord Vishnu.\n He assured them also that Lord Vishnu would definitely protect them.\n Brahma even accompanied the gods to Lord Vishnu.\n There, they together prayed Lord Vishnu and intimated Him about their ordeal.\n Pleased by their prayers, Lord Vishnu appeared before them and said- \"I will definitely help you regain your splendour.\n Presently, do what I say.\n You reconcile with the demons and convince them to carry out the churning of the sea.\n Then bring all kinds of herbs and put them in the sea.\n With the help of the demons and using Mandaraachal as churner and Vaasuki, the Naag as the rope to carry out the churning of the sea.\n Thus, you will recover ambrosia drinking which, all of you will become immortal and regain your strength.\n\" Following the advice of Lord Vishnu, the gods reconciled with the demons and convinced them to carry out the churning of the sea.\n They together procured all kinds of herbs and put them in the sea.\n Then they began the churning using Mandaraachal Mountain.\n As soon as the churning began, Mandaraachal began to sink.\n Lord Vishnu took incarnation of Kachchhap (the great tortoise) and bore the weight of the mighty mountain on His back.\n During the churning, Kamadhenu, the wishful cow was the first to emerge.\n It was presented to the sages as an aid for their Yagyas.\n It was followed by the damsel, Vaaruni, Kalpavriksha (the wishful tree) after which, beautiful elves appeared.\n The Moon followed the elves and was taken up by Shiva on His forehead.\n During the churning, huge quantity of poison had also emerged.\n It was drunk by Lord Shiva and some parts of it were taken up by the serpents.\n In the end, Dhanvantari himself emerged from the sea carrying the urn of ambrosia.\n It was during the churning itself that Lakshmi appeared once again from the sea holding lotuses in her hands.\n All the sages prayed her.\n Then taking bath with divine water, goddess Lakshmi took her seat in the heart of Lord Vishnu.\n When the demons saw that Lakshmi had chosen Lord Vishnu’s heart as her abode, they got perplexed.\n They at once snatched the urn from Dhanvantari and ran away.\n Then a row broke out among them over the drinking of ambrosia.\n Each of the demons wanted to drink ambrosia in maximum quantity.\n Meanwhile, Lord Vishnu also arrived there in the guise of an extremely pretty woman Mohini and took possession of the urn.\n Mohini had pleased the demons with her sweet smile while distributing ambrosia among the gods.\n Thus, the gods came to drink ambrosia.\n When at last, the demons realised that they had been cheated they immediately attacked the gods.\n But since the gods had regained their strength, they soon defeated the demons without much ado.\n Afterwards, the gods prayed Lord Vishnu and returned to heaven to rule it.\n The world also regained its verdancy.\n After regaining his splendour, comforts and luxuries of the heaven, Indra prayed goddess Lakshmi with devotion and respect.\n Pleased by the prayers of Indra, Lakshmi asked him to seek a boon.\n Indra said- \"O goddess! If you are pleased with me, kindly bless me with a boon that first you will never desert this world and also that you will never desert those who worship you with this prayer.\n\" Lakshmi granted these boons.\n Thus, Lakshmi had appeared as the daughter of Bhrigu and his wife Khyaati.\n Then second time, she emerged from beneath the sea during its churning.\n Thus, whenever Lord Vishnu takes an incarnation, Lakshmi accompanies Him.\n When God appears in divine form, she too takes a divine appearance. When God appears in human form, Lakshmi appears in human form also. ", "next": "3.1.6", "prev": "3.1.4", "title": "Creation of Rudra and Omnipresence of Laxmi"}