{"index": "3.1.11", "image": "resized_images/Tale of Prahlad and Narasimha Incarnation.png", "text": [" Parashar says- By the boon of Brahma, Hiranyakashipu had acquired tremendous power and came to control all the three worlds.", " He had driven the gods out of heaven and used to receive the oblations offered to Surya, Vayu, Agni, Varun, Chandrama, Kuber, Yamaraaj etc.", " Because of his fear, all those gods roamed on earth.", " All the creatures began to worship Hiranyakashipu.", " Beautiful and amorous elves danced in his palace while Gandharvas accompanied them on instruments.", " Prahlad was the youngest son of Hiranyakashipu.", " Like other children, he too was sent to Gurukula to be educated.", " One day, his teachers took Prahlad to Hiranyakashipu who was engaged in drinking of wine at that moment.", " Lovingly he took his son into his lap and asked- \"O son, tell me, what you have learnt so far in the auspices of your teachers?", "\" Prahlad said- \"O father! I salute to that Shri Hari who has no beginning, no end and no mid-part, who doesn’t take birth and who is free from growth and decay.", "\" Hearing this, Hiranyakashipu looked at the teachers with bloodshot eyes and shouted at them- \"O wretched Brahmins! In sheer violation of my orders, you have taught my son to praise my enemy.", "\" The teachers tried to express their apology saying that what Prahlad was saying was not taught by them.", " Hiranyakashipu asked then Prahlad who had taught him like that.", " Prahlad said- \"O father! Lord Vishnu who resides in the heart of us all is the supreme creature.", " Who can teach anybody anything apart from Him?", "\" Hiranyakashipu said- \"O fool! Who is that Vishnu about whom you are describing before me, the Lord of entire world?", "\" Prahlad replied- \"Lord Vishnu is he who is contemplated about by the Yogis.", " He is the originator of the entire universe.", " His virtues cannot be described in words.", " That Parmeshwar is Vishnu.", "\" Hiranyakashipu said- \"Fool! Who can be Parmeshwar other than me?", " Do you want to die that you are babbling like that?", "\" Prahlad said- \"O father! Your anger is baseless.", " Lord Vishnu is the creator of all of us including you and me.", " He controls our breaths.", "\" Infuriated Hiranyakashipu then ordered the teachers to take Prahlad away at once and wash his brain thoroughly.", " The teachers took Prahlad with them to their Gurukula.", " Prahlad began to concentrate in his studies.", " After many months, Hiranyakashipu once again called Prahlad to his palace and asked about his learning.", " Once again, Prahlad began to praise Lord Vishnu.", " This time, Hiranyakashipu ordered his assassination.", " He began to see his son as a threat to his throne.", " By the orders of Hiranyakashipu, many formidable demons attacked Prahlad with their weapons but Prahlad stood unfazed.", " He said- \"O fools! Lord Vishnu is present in you, in me and even in your weapons.", " May your weapons have no effect on me.", "\" Indeed, the weapons of the demons could not even touch Prahlad.", " Hiranyakashipu said- \"I can still pardon your life provided that you stop praising my opponent.", "\" Prahlad said- \"O father! I fear nothing.", " By the God’s grace, I am free from the fear of birth and death.", "\" Hiranyakashipu then got Prahlad thrown amidst venomous snakes.", " But, biting by the snakes had no effect on Prahlad because his mind was contemplating in Lord Vishnu.", " Hiranyakashipu then got Prahlad trampled by big bull elephants.", " But even elephants could not harm Prahlad.", " Instead their tusks were broken as soon as they touched Prahlad.", " Even then Prahlad tried to pacify his father that it was Lord’s strength that protected him every time.", " Prahlad’s teachers who were the sons of Shukracharya then assured Hiranyakashipu that Prahlad was having a fickle mind because of his tender age.", " They also assured the demon king of transforming Prahlad and took him to their hermitage once again.", " Prahlad’s Preaching But in the hermitage, Prahlad assembled other demon children and said- \" Friends, listen to my preaching carefully and don’t take it for granted because I have no personal interest in it.", " Every living being takes birth and suffers a lot while passing his life through childhood, youth and old age.", " The end result of life is nothing but death.", " It is one’s Karma that accompany him birth after birth.", " But in every birth, this soul mistakes hunger, thirst, cold or hot for the pleasures.", " More of the luxuries one collects, more the sorrow increases.", " Attachment and passion are the greatest cause of sorrow.", " Even after passing a life that is full of sorrow, one suffers the agony of death and rebirth again.", " This whole cycle continues again and again.", " Lord Vishnu is the ultimate refuge for the soul, which feels drowned in the ocean of sorrow.", "\" Don’t be confused with my young age.", " I am a boy like you.", " But the soul that stays within me is eternal.", " The soul has no distinct stages in life.", " But a human being is inflicted with lot of misconceptions.", " In the childhood, he prefers to play than contemplating on God.", " In the youth, lust and carnal pleasures attract the mind.", " Still a human being doesn’t get serious about his benefit.", " He keeps on postponing his spiritual matters for his old age.", " But in old age, a human being has no option but to see his trembling fingers and repent about his past.", " Thus a human being spoils his whole life.", " A wise person hence must ignore the different stages of his body’s stay on earth and make efforts for his benefit right in his childhood.", " What I have told you is unchangeable fact.", " Start reciting Lord Vishnu’s name for my pleasure atleast.", " His remembrance is enough to destroy all the sins.", " May your mind always contemplate on Him day and night. Thus all your miseries shall come to an end. "], "next": "3.1.12", "prev": "3.1.10", "title": "Tale of Prahlad and Narasimha Incarnation"}