{"index": "3.1.1", "image": "resized_images/Introduction and Origin of the Universe from Basic Elements.png", "text": " Sage Parashar, the exponent of Vishnu Puraan had narrated this grand treatise to Maitreya.\n Sage Suta inherited it from Maitreya.\n The text presented here is a narration by Suta.\n Suta says- One day, Maitreya greeted sage Parashar and said- \"Gurudev, you have studied all the scriptures.\n I wish to hear the tale of universe’s origin from you.\n How will be the ages that are about to come?\n What is the reason for this whole creation?\n Who created it?\n Where did it exist?\n Whom did it mingle with?\n And with whom it will annihilate eventually?\n Apart from these, I also wish to hear about the expansion of fathomless sky, origin of ocean and mountains, origin of earth, expansion of the Sun, division of time in four ages, Pralay, religion, sages, kings, creation of Vedas by Vedavyasa, origin of four classes in our society and system of four Ashrams in one’s life.\n\" Parashar says:\n \"Maitreya, you have reminded me today of the description once made by my grandfather Vashishta.\n When I learnt that the monster, which was created by Vishwamitra, had devoured my father, I grew quite angry and started a Yagya to destroy all the monsters.\n The Yagya destroyed such a large number of monsters that the whole race began to face the fear of extinction.\n My grandfather consoled me that too much anger was not good and that all the monsters could not be blamed for my father’s death.\n According to my grandfather my father was sure to face such a fate ultimately.\n Only the fools get angry.\n A human being bears the fruit of his deeds himself.\n O son! Anger destroys all the virtues of penance.\n Hence, ascetics always shun anger.\n Hence, stop this Yagya for forgiving has always been the virtue of ascetics.\n\" Thus, convinced by my grandfather, I stopped the Yagya.\n At the same time, Brahma’s son, Pulastya, arrived there and said- \"Despite your anger, you forgave the monsters when convinced by your grandfather Vashishta.\n You will learn all the scriptures and give commentaries on Puraans.\n You will also learn the real appearance of the gods\".\n Vashishta also endorsed these words of Pulastya.\n \"O Maitreya! Now I narrate to you, the whole contents of Puraan.\n This whole universe has originated from Lord Vishnu.\n It is existing within Him and will annihilate in Him eventually.\n\" Parashar says:\n \"The trinity of Brahma, Vishnu and Mahesh is also known as the creator, the preserver and the destroyer.\n All of them salve the devotees.\n All of them have equal importance.\n Still, preserver who fosters and protects all the living beings is far more significant.\n I salute to Him and narrate the tale that was once narrated by Brahma to all the Dakshas.\n Dakshas had narrated this tale to the King Purukutsa at the bank of the river Narmada.\n In turn, Purukutsa narrated this tale to Saraswat who narrated it to me.\n\" \"O Brahmin! Lord is eternal and endless.\n Hence, origin of universe, its existence and annihilation are also unending processes.\n During the period of Pralay, the nature exists in a state of equilibrium.\n It is during this period that Purush (masculine forces of creation) separates from Prakriti (feminine forces of creation) and Kaalroop of Vishnu (eternal, unending form of the Lord) is manifested.\n Lord Vishnu is beyond all the bonding of life like birth, growth, intelligence, senses, decay and death.\n Purush is the first appearance of Lord Vishnu.\n Prakriti is the manifestation of His action while Kaalroop is His supreme appearance.\n\" During the Pralay, there was neither day nor night, neither earth nor sky and neither darkness nor light.\n At the subsidence of Pralay, with His desire, the Lord entered the Purush who is beyond all bonding.\n His entry stimulated the process of creation.\n First of all, a single great element originated encompassing all the other lesser elements.\n From this great element originated three egos- Sattvic, Rajas and Taamas.\n Taamas created sky with sound as the main virtue.\n The sky then created the sense of touch.\n Touch produced air.\n Hence, touch is the main feature of air;\n no one can see air but only have an experience of it through touch.\n Air created Roop, which gave birth to fire with Roop as its main virtue.\n Fire gave birth to taste.\n Taste produced water with taste as its main property.\n From water originated scent, which produced earth with scent as the main feature.\n These senses have no special expression.\n The ego Rajas produced ten sense organs whereas the ruling deities of these organs were produced by Sattvic ego.\n Thus, the ten deities who rule ten sense organs and the eleventh entity mind are Sattvic in nature.\n Skin, eyes, ears, nose and tongue- these five organs aid the mind in its function.\n O Maitreya! Anus, sex organs, hands, legs and speech organs are the five organs that help in action.\n Works like excretion, reproduction, movement and speech are carried out with the help of these five organs.\n All the five elements like sky, air, fire, water and earth are full of emotions.\n Hence, they are also known to have a special significance.\n All these elements have different and distinct powers.\n Without their combination, creation of the universe was impossible.\n In the beginning, all these elements were present in the great ball or egg, which came into existence because of the inspiration of the Lord.\n As this ball increased in size, it formed the base as Prakriti in which, Lord Vishnu Himself entered as Hiranyagarbh.\n When the universe comes into existence, Lord Vishnu fosters it till the end of Kalpa.\n At the end of Kalpa, Lord Vishnu Himself devours the entire physical elements in Rudra appearance.\n During that time, He inundates the entire universe and Himself sleeps on Shesha in Ksheersagar.\n When he awakes once again, He begins the process of creation in the appearance of Brahma. ", "next": "3.1.2", "prev": "3.1", "title": "Introduction and Origin of the Universe from Basic Elements"}