{"index": "3.1.13", "image": "resized_images/Description of Lord’s Virtues by Prahlad and Protection of Prahlad by Sudarshan Chakra.png", "text": " Hearing the news of Kritya’s failure to kill Prahlad, killing of teachers and their subsequent revival as effected by Prahlad, Hiranyakashipu called his son and asked if all those miracles were natural or he knew some magical tricks.\n Prahlad said- \"O father, neither I know any magic nor is the miracle a part of my nature.\n All these are ordinary things for he who has eternal God in his heart.\n No one can harm those who never wish ill for the others.\n All the living beings are equal for Him.\n In every creature, I see the same Lord Vishnu who is present within me;\n hence I never try to harm him or her.\n I cannot even think of harming anybody.\n It is this feeling that protects me from every physical, mental or divinely discomfort.\n\" But these words failed to please Hiranyakashipu.\n He ordered his men to throw Prahlad from a very high fort.\n Even this attempt, however failed to cause any harm to Prahlad for the mother earth took him in her lap tenderly in the midway.\n Suspecting some illusionary powers helping Prahlad, Hiranyakashipu ordered Shambarasur to kill him using his illusionary powers.\n Shambarasur created many illusions to kill Prahlad.\n But right then Lord Vishnu sent His Sudarshan Chakra to counter those demonic illusions and protect Prahlad.\n Sudarshan Chakra destroyed all the demonic illusions one by one.\n Then Hiranyakashipu ordered Vayu to dry up Prahlad to death.\n When Vayu entered Prahlad’s body and began to dry him up, the Lord came to stay in his heart where God absorbed all the drying effects of the air thus rendering it weak.\n After all those attempts failed, Prahlad returned to his teachers’ hermitage and resumed his education once again.\n The teachers trained him all the relevant subjects.\n Then they once again took Prahlad to his father and told him that now his education was over.\n Hiranyakashipu asked- \"O son! How should one behave with the others?\n Tell me what have learned so far.\n I am eager to know your opinions.\n\" Prahlad said-\"O father, indeed my teachers have taught me in different subjects.\n I have too learned them with heart.\n They taught me that diplomatic policies should be applied in order to train friendship.\n But excuse me father, I see no friend or no enemy, so in my opinion these policies are totally irrelevant.\n Tell me O father what is the use of means when there is nobody to be trained.\n Lord Vishnu is present everywhere.\n In you, in me and in all other creatures.\n Hence instead of using in sinisterly actions, one should use his wits for good and benefit of all.\n\" \"O fortunate one, everybody longs for the throne and a big kingdom.\n But only those attain these things who really deserve and have them in their destiny.\n Even the most inert and imprudent people who are weak and know nothing about the policies get these things because of destiny.\n Hence all those who wish for splendour must strive to accumulate pious actions.\n Those who long for salvation must strive to acquire impartial view for all.\n Such actions please God and when He is pleased all the miseries are attenuated.\n\" Hearing these words, Hiranyakashipu kicked Prahlad hard and ordered his demons to tie him in Naagpaash and throw into the sea.\n The demons obeyed their master and threw Prahlad into the sea after tying him in Naagpaash.\n With Prahlad’s motion great disturbances occurred in the sea, seeing that Hiranyakashipu ordered the demons to cover the sea with huge mountains so that Prahlad could not get a passage to escape.\n When the demons uprooted huge mountains and put them into the sea, Prahlad began to pray God with concentrated mind. ", "next": "3.1.14", "prev": "3.1.12", "title": "Description of Lord’s Virtues by Prahlad and Protection of Prahlad by Sudarshan Chakra"}