{"index": "3.2.6", "image": "resized_images/Description of Hells.png", "text": " Beneath the earth and water are situated the hells into which, the sinners are thrown.\n Raurav, Sukar, Rodha, Taal, Vishsan, Mahajwaal, Taptakumbh, Lavan, Vilohit, Rudhirambh, Vaitarni, Krimish, Krimibhojan, Asipatravan, Krishna, Lalabhaksha, Daarun, Puyuvah, Paap, Vahnijwaal, Adhahshira, Sandansh, Kaalsutra, Tamas, Aavichi, Swabhojan, Apratishthit and Aprachi are the main hells.\n These are all under the domain of Yamaraaj.\n Those who give false witness are thrown into Raurav hell.\n Those who kill unborn babies and cows or destroy the villages fall into Rodha hell.\n Those who drink wine, kill Brahmin or steal gold fall into Sukar hell.\n Those who kill Kshatriya or Vaishya fall into Taal hell.\n Those who copulate with teacher’s wife or their own sister fall in Taptakumbh hell.\n Those who sell women and horses fall in Taptloha hell.\n Those who copulate with their daughter or daughter-in-law fall into Mahajwaal hell.\n Those who criticise the teachers and the Vedas or sell Vedas fall into Lavan hell.\n Those who violate social norms fall in Vilohit hell and those who envy the gods, the Brahmins and their parents fall in Krimibhaksha hell.\n Those who dine first even before the parents, the gods and the guests fall into Lalabhaksha hell.\n Those who manufacture arrows fall in Vedhak hell.\n Those who manufacture swords fall in Vishsan hell.\n Backbiters, killers of friends and sellers of wine fall in Rudhiraandh hell.\n Destroyers of Yagya and villages fall in Vaitarni hell.\n Thus, the sinners have to suffer scores of tortures in these and many other hells.\n These sinners after passing their lives in the hell take birth as worms, aquatic animals and birds, terrestrial animals, human beings, religious people etc.\n Only those sinners who do not expiate for their sins fall into the hell.\n Our sages have made provisions of expiation for those sinners who feel guilty in their conscience after committing their sins.\n Remembrance of Lord’s name is in itself the greatest expiation.\n Remembrance of Lord’s name anytime in life destroys all the previous sins instantaneously.\n Hence recitation of Vasudeva’s name is sure way of attaining salvation.\n Thus those who recite and remember Lord Vishnu’s name never fall in any hell because their sins have been destroyed.\n Anything where one feels pleasant is heaven and opposite of it is hell. ", "next": "3.2.7", "prev": "3.2.5", "title": "Description of Hells"}