{"index": "3.2.11", "image": "resized_images/Description of the Nine Planets.png", "text": " The Moon rides a chariot with three wheels. This chariot is hauled by ten horses. During its entire journey, the Moon passes through all the twenty-seven Nakshatras. These horses haul the Moon’s chariot for a complete Kalpa. With his rays, the Sun nourishes the Moon, which loses its strength because of drinking of its ambrosia by the gods. When the gods brought even the last drop of nectar from the Moon, it enters the Sun’s sphere. That day is known as Amavasya (moonless night). That day, the Moon first enters the water then the foliage of the trees, creepers etc. and ultimately enters the Sun’s sphere. That is why, anybody who cuts trees or even plucks a leaf commits crime equal to killing of Brahmin. On the day of Amavasya, Pitragana drink the nectar from the Moon and feel sated. Thus, Moon sates the gods during the brighter phase and the Pitragana during darker phase. The Moon also showers its nectar on the trees, creepers and other vegetation. It also causes exhilaration for the human beings, animals, birds and creatures like insects etc. Buddha (Mercury) is the son of the Moon. His chariot is made of fire and air and is hauled by eight horses of deep yellow colour. The chariot of Shukra (Venus) is also very splendid and is adorned by beautiful flags. Mangal (Mars) rides a golden chariot, which is born from the fire. His chariot is hauled by eight red horses. Brihaspati rides a golden chariot hauled by eight yellow horses. Shani (Saturn) is famous for slow motion. He rides a chariot which was born from the sky. The colour of his chariot’s horses is also very peculiar. Rahu’s chariot is brown in colour and is hauled by eight black horses. Ketu’s chariot is also drawn by eight horses, which are red in colour. Chariots of all the nine planets are tied to Dhruv. Thus, all of them traverse the same path again and again year after year. Sighting of Shishumaar chakra (constellation path) in the night destroys all the sins that a human being commits during the daytime. Water is a tangible form of Lord Vishnu. Even the earth was born out of water. Stars, all the three worlds, forests, vegetation, mountains, directions, rivers, sea and entire nature is the form of Lord Vishnu. This vivid nature thus shows omnipresence character of Lord Vishnu. ", "next": "3.2.12", "prev": "3.2.10", "title": "Description of the Nine Planets"}