{"index": "3.2.12", "image": "resized_images/Life Sketch of Bharat.png", "text": " Maitreya says- \"Lord! Now I wish to hear various tales from the life of King Bharat.\n He was born in a pious land and always contemplated on God.\n Even then why he failed to attain salvation?\n What did he do in his next birth as a Brahmin?\n\" Parashar says- King Bharat always contemplated on God.\n He stayed at Shaalgraam for a long time.\n There he used to recite the names of God and collect various materials for His worship.\n Other than that, he did not do anything.\n One day while he was taking bath in the river, a doe arrived at the opposite bank.\n She was in the final stage of pregnancy.\n While she was drinking water, a lion roared somewhere in the forest behind her.\n That roar frightened the doe so much that she jumped across the river to save her life.\n Exertion of jumping resulted in premature littering of her fawn, which fell in the river.\n On the other hand, the doe also could not bear the pain and died.\n King Bharat rescued the just born fawn and brought it to his hermitage.\n Since then he began to foster the fawn with love and care.\n With time, Bharat’s attachment grew for the fawn and whenever it went out of sight, he would feel perplexed.\n Soon King Bharat deserted everything for the love of the fawn.\n He even left his routine worship and meditation for it would be hard to concentrate whenever the fawn was near and at times when the fawn was out of sight, it worried Bharat and hence he could not concentrate.\n But the fawn could not give up its natural instincts.\n When it grew up, one day, it happened to sight a herd of deer and mingled with it to find a mate of its own choice and since that day, it never returned to the hermitage.\n Separation from the deer proved fatal for the King Bharat.\n While dying his mind was fully concentrating on the thoughts of the deer which he had fostered with love and care.\n Because of it, Bharat took his next birth as a deer.\n But still he remembered his past life.\n So he deserted his herd and found a place in Shaalgraam where he passed his time eating dry grass and foliage.\n In his next birth, Bharat was born in a cultured Brahmin family.\n In this birth also, he remembered his past lives.\n Since birth, Bharat knew all the rituals and scriptures and saw his soul in a transcendental way.\n Hence, even after his thread ceremony, he did not take up his education.\n Even the teachers failed to incite his interest in education.\n Bharat roamed here and there, clad in rags and was hence insulted by fellow Brahmins and village folk.\n Thus Bharat remained indifferent to the others’ treatment and sustained himself on whatever little he got to eat.\n After the demise of his father, his brothers made him work hard in the fields but gave little to eat.\n Because of his inertness, he was known as Jadabharat.\n One night, when Jadabharat was guarding his fields, the king’s commander-in- chief, Vrishatraaj caught him and took him away.\n The king wanted to sacrifice him before goddess Mahakali.\n But seeing the supreme Yogi being brought as a votive animal, goddess Mahakali expressed her wrath by decapitating the king and drank his blood.\n In another incident later on, the king of Sauveer was travelling in a palanquin to visit sage Kapil for religious preaching.\n Incidentally, one man fell short to carry his palanquin, so the other carriers saw and caught Jadabharat to forcibly engage him in the work of carrying the palanquin.\n While walking, Jadabharat was taking care not to put his feet on any creature.\n So he was moving very slowly whereas other carriers were walking briskly.\n As a result of it, the palanquin was moving jerkily causing irritation to the king.\n The king enquired the carriers about the reasons of that jerky motion.\n The carriers informed him that it was because of the new recruit who is moving very slowly.\n The king shouted at Jadabharat- \"You appear to be quite burly.\n Don’t you have enough strength?\n Does a little work tire you?\n\" Jadabharat said- \"O king! Neither I am burly nor carrying your palanquin.\n I am neither tired nor there is any need for me to labour.\n\" The king said- \"Apparently you are burly and my palanquin is also resting on your shoulder.\n Carrying a load always tires anybody.\n How are you different then from the others?\n\" Jadabharat said- \"O king! First of all, tell me, what do you see directly?\n Your saying that I am carrying your palanquin is also meaningless.\n Now listen to what I say.\n Both my feet are resting on the earth.\n On the feet are thighs, and on the thighs is belly, on the belly are chest, shoulders and arms.\n Your palanquin is resting on the shoulders.\n What load am I carrying then?\n You are in the palanquin and I am on the earth are meaningless words.\n All the creatures, you and me are all carried by the five basic elements.\n Even our virtues are controlled by our action.\n Only action is born out of ignorance.\n The soul is pure, non- degradable, calm, intangible and beyond all nature.\n This same soul pervades all the creatures.\n It neither grows nor decays.\n Why did you say then that I am burly?\n If this palanquin that is resting on my shoulders-chest-belly-thighs and feet, could be a burden for me, it could also be a burden for you.\n Like this, all the living beings are carrying not only this palanquin but all the mountains, trees, houses and even the earth.\n\" Saying this, Jadabharat became silent, still carrying the palanquin.\n The king at once got down from the palanquin and fell at Jadabharat’s feet and said- \"O Brahmin! Leave this palanquin and tell me why have you taken this guise.\n Who are you?\n What is the reason of your coming here?\n I am eager to know about you.\n\" Jadabharat said- \"I cannot tell what I am and for the reason why I came here, I can say only that coming and going are all done so that one can experience their result.\n The soul takes an incarnation only to experience the joy and sorrow as per its deeds.\n Why are you then enquiring specifically about the reason for my coming here?\n\" The king said- \"The soul transmigrates from one body to another only because of its action.\n I want to hear from you preaching regarding ‘who am I cannot be told’.\n O Brahmin! The soul that is eternal and experiences the results of its action is I.\n This mark of ego is not a cause of demerit in the soul.\n\" Jadabharat said- \"You are right that words do not cause any demerit in the soul.\n But the ego expressed in the form of words is the reason for demerit in soul.\n When the same and single soul stays in everybody, possessive words are then meaningless.\n You are the king.\n This is the palanquin.\n They are the carriers and those are the subjects.\n O king! None of these words has any meaning.\n This palanquin is made of the wood received from some tree.\n So tell me what it should be called as- a palanquin or wood.\n Nobody says that the king is sitting on a tree.\n It is because of specific construction that a heap of wood has assumed the shape of a palanquin.\n For the purpose of action, the same soul is identified physically as a man, a woman, a cow, a goat, a horse, an elephant, a bird or a tree.\n But in fact, the soul is none of them.\n Things like wealth, king, kingdom, king’s army and all other things that you possess are not fact.\n They are imaginations.\n For the subjects, you are king.\n For the son, you are father.\n For the wife, you are husband, and the father of her children.\n O king! Tell me, what should I address you as?\n Are you different from any of these nouns?\n Hence, always be careful while considering who am I?\n O king! The soul is so arranged in different roles that it is very difficult to tell specifically its real identity.\" ", "next": "3.2.13", "prev": "3.2.11", "title": "Life Sketch of Bharat"}