{"index": "3.2.8", "image": "resized_images/Order of the Sun, the Stars and other Constellations.png", "text": " The Sun travels speedily across the sky like an arrow.\n He determines the night and the day.\n With the rising and setting of the Sun, one can have knowledge of the directions.\n Sun lights up all the places in the entire world except Brahmaloka.\n Sun’s rays that reach Brahmaloka return back rendered ineffective by the radiance of Brahma.\n Since Mount Sumeru is situated at the north of all the islands and Varsh, hence towards the northern side of it, one part of land experiences the day while another part experiences the night all the time.\n The radiant Sun setting merges with fire.\n Hence, fire also has the power of illuminating and warming its environment.\n At the beginning of Uttaraayan (northward motion of the Sun), the Sun enters the zodiac of Capricorn.\n Travelling through Aquarius and Pisces, it reaches the equator which is at the centre of the earth.\n Thereafter the nights begin to decrease in comparison of the days.\n Then travelling through Aries, Taurus and Gemini, the Sun enters Cancer to begin its southward journey.\n The period of time between the day and night is dusk twilight.\n At that time, formidable demons try to swallow the Sun.\n Thus they have fierce battle with the Sun.\n The recitation of hymns by learned Brahmins during dusk twilight helps the Sun regain his lost radiance.\n With his brilliance then the demons are destroyed.\n Thus the Sun is a perfect form of Lord Vishnu.\n It shines with its inner radiance.\n Omkar is a symbolisation of the Sun.\n It is also mandatory for the Brahmins to perform evening worship.\n Those who do not worship in the evening hurt the Sun.\n Towards the north of Saptarishi constellation, where polestar is situated, there is an abode of Lord Vishnu.\n Only those sages can reach there who are free from faults and whose sins and pious deeds have been attenuated.\n Supremely brilliant Dhruv stays in the abode of Vishnu.\n Every other thing is dependent upon Dhruv.\n All the Nakshatras also depend on Dhruv.\n On Nakshatras depend the clouds and on the clouds depends the rain and on the rains depend the nourishment of entire world.\n Thus, all the other things come to depend upon Dhruv.\n The sacred Ganges which is the destroyer of every sin also rises from the abode of Lord Vishnu.\n Dhruv bears the Ganges on his head.\n Flowing through the sphere of the Moon, the Ganges falls on Mount Meru and flows in every direction to sanctify the entire world.\n Bathing in the water of the Ganges destroys all the sins.\n Offering of oblations in the waters of Ganges satiates dead ancestors for one hundred years.\n Starry, chameleon-like appearance of Lord Vishnu can be seen in the night sky.\n A polestar is present in its tail.\n All the other stars, the Sun, the Moon and other planets are present on different parts of this chameleon and go round the polestar.\n Uttanpaad’s son Dhruv had pleased this chameleon-like appearance of Lord Vishnu with his penance and sought a fixed position in His tail.\n Even the Sun is dependent on Dhruv.\n The Sun keeps on evaporating the water for eight months in a year.\n This evaporated water then rains for four months and nourishes the soil and produces different kinds of cereals for the nourishment of the entire world.\n The water that is evaporated by the Sun also nourishes the Moon.\n But the Moon itself does not consume that water.\n Instead it gives that water to the clouds.\n During winter season, this water released by the Moon falls on earth as snow and dew.\n The Sun draws water from Akashganga (the Milky Way) also and causes it to rain on earth at once.\n That water is so sacred that mere touch of it destroys all the sins.\n The rains that fall during Nakshatras like Kritika;\n Rohini, Addra etc. come from the water of Akashganga. ", "next": "3.2.9", "prev": "3.2.7", "title": "Order of the Sun, the Stars and other Constellations"}