{"index": "3.2.4", "image": "resized_images/Description of Other Dvipas.png", "text": " Plakshdweep- Plakshdweep has an expansion of 2,00,000 Yojans. Its ruler Meghatithi had seven sons- Shaanthaya, Shishir, Sukhodaya, Anand, Shiva, Kshemak and Dhruv. Those seven princes later on came to rule Plakshdweep. Hence, Plakshdweep had seven divisions named after these seven princes. Seven mountains mark the boundaries of Plakshdweep. These are Gomed, Chandra, Naarad, Dundubhi, Sobhak, Sumana and Vaibhraaj. People of Plakshdweep live long and pleasant life. Seven rivers namely Anutapta, Shikhi, Vipaasha, Tridiva, Aklamaa, Amrita and Sukrita flow in Plakshdweep. In all the islands from Plakshdweep to Shaakhdweep, only Tretayug stays. Plaksh tree (Paakad) abound in Plakshdweep. Lord Vishnu is worshipped there as Soma. Shaalmaldweep- Vayushmaan was the ruler of Shaalmaldweep. He too had seven sons- Shwet, Harit, Jibhoot, Rohit, Vaidyut, Maanas and Suprabh. Hence Shaalmaldweep was also divided into seven divisions named after these princes. A sea of sugarcane juice surrounds this island. Shaalmaldweep has seven mountains which are the source of all the gemstones. Seven rivers flow in Shaalmaldweep. These rivers contain innumerable kinds of medicinal herbs. Lord Vishnu is worshipped there in Vayu form. Because of the abundance of Semul (silk cotton) trees, this island came to be known as Shaalmaldweep. A sea of wine surrounds this island. Kushdweep- The ruler of Kushdweep, Jyotishmaan had seven sons. Their names were Venumaan, Vairath, Lamban, Ghriti, Prabhakar and Kapil. The divisions of this island were named after them. This island too has seven mountains and seven rivers. Lord Vishnu is worshipped here in Janardan form. Because of abundance of Kusha grass, this island is known as Kushdweep. A sea of ghee surrounds this island. Kraunchdweep- The ruler of Kraunchdweep, Dyutimaan had seven sons named Kushal, Mandak, Ushna, Peevar, Andhkaarak, Muni and Dudhumbi. Hence the seven divisions of this island were named after these princes. This island too has seven mountains and seven main rivers with hundreds of small rivers and tributaries. Lord Vishnu is worshipped here in Rudra form through Yagyas. A sea of whey surrounds this island. Shaakhdweep- The ruler of Shaakhdweep Bhavya, also had seven sons named Jalad, Kumar, Sukumar, Marichak, Kutumod, Maudaaki and Mahadrum. Hence the seven divisions of this island were named after these princes; this island too has seven mountains and seven holy rivers. Lord Vishnu is worshipped here in Surya form. Because of an abundance of Shaakh trees, this island got its name. A sea of milk surrounds this island. Pushkardweep- This is the largest among all the seven islands. Its ruler Savan had two sons- Mahavir and Dhaataki. Hence, this island has two divisions- Mahavirkhand and Dhaatakikhand. A huge mountain named Maansotra is situated at the centre of this great island. Brahma stays on a huge Banyan tree in this island. A sea of sweet water surrounds this island. ", "next": "3.2.5", "prev": "3.2.3", "title": "Description of Other Dvipas"}