{"index": "3.2.10", "image": "resized_images/Description of Surya Shakti and Vaishnava Shakti.png", "text": [" Maitreya says- \"Lord, if only the seven Ganas are entrusted with the job of causing cold and summer, drought and rain, what is the purpose then of the Sun’s existence?", " \" Parashar says- It is true that Surya is one of the seven Ganas.", " Yet being the chief among them, it has special significance.", " Omnipotent para-power of Lord Vishnu is nothing but the three Vedas.", " These together stay within the Sun and provide it with energy necessary to sustain the world.", " Their presence within the Sun remains constant irrespective of the Sun’s changing names every month.", " In the morning, Rigveda prays the Sun with its Shrutis.", " In the noontime, Yajurveda prays the Sun whereas in the evening, Shrutis of Samaveda pray the Sun.", " Thus, Lord Vishnu always energises the Sun.", " Brahma, Vishnu and Mahesh are also present in trinity form.", " Their trinity too represents the three Vedas.", " At the beginning of creation, Brahma was in the form of Rigveda.", " During the sustenance of the universe, Lord Vishnu stays in Yajurveda form whereas at the end of the creation when Pralay occurs, Rudra takes Samaveda form.", " Hence the recitation of Samaveda is considered inauspicious.", " Energies of the trinity stays within the Sun in synergetic form.", " Hence the Sun glows brilliantly and destroys the darkness.", " Lord Vishnu, who represents energy of this trinity, never rises nor sets.", " His Vaishnavi Shakti never parts with the Sun’s chariot and stays there irrespective of the changing names of the Sun with months.", " Thus, the Sun, which causes the formation of day and night always satiates Pitragana, Devgana and human beings.", " One of the Sun’s rays named Sushumna nourishes the Moon during its brighter phase.", " Then during the darker phase, the gods drink the phases of the Moon, which are in fact, ambrosia accumulated during the brighter phase.", " When two days are left for the completion of darker phase, Pitragana drink the remaining two phases of the Moon.", " Thus, the Sun satiates the gods and the deceased ancestors.", " The water that the Sun draws from earth is returned to the earth in the form of rains.", " This rainfall produces cereals, which nourish the entire population on earth. "], "next": "3.2.11", "prev": "3.2.9", "title": "Description of Surya Shakti and Vaishnava Shakti"}