{"index": "3.2.15", "image": "resized_images/Ribhu Preaches Nidaagh.png", "text": [" One thousand years after this incident, Ribhu once again decided to see his disciple Nidaagh.", " So he once again arrived in Veernagar.", " At that time, king of that town was leading a procession of his army.", " So there was a great crowd on the main road of the town.", " Nidaagh was carrying some worship materials from the forest but seeing a huge crowd on the road, he stood aside waiting for its dispersion.", " Meanwhile, Ribhu also arrived there.", " Seeing Nidaagh standing alone away from the crowd, Ribhu approached him and asked why he was standing there.", " Nidaagh said- \"O Brahmin! Today, the king of our town had taken out a procession.", " So I am standing here waiting for the dispersion of crowd so that I can reach home and offer my worship.", "\" Ribhu asked- \" It appears from your words that you know everything about your town.", " Kindly tell me who is the king and who are the subjects?", "\" Nidaagh said- \"The one who is riding an elephant is the king and those who are following him on the ground are his subjects.", "\" Ribhu said- \"O Nidaagh! You have shown me the king and the elephant together but did not show their distinguishing symptoms separately.", " Who is the king among them and who is the elephant?", "\" Nidaagh said- \"The one who is above is the king and the one who is beneath is the elephant.", "\" Ribhu said- \"Kindly elaborate what is above and what is beneath?", "\" As soon as Ribhu finished his words, Nidaagh climbed on his shoulders and said- \"Look, like the king, I am above you and like the elephant, you are beneath me.", "\" Ribhu said- \"If you are like the king and I am like the elephant, kindly explain to me, who are you and who am I?", "\" Nidaagh at once climbed down and fell at Ribhu’s feet and said- \"Certainly, you are the great sage Ribhu.", "\" Ribhu said- \"Yes, I am Ribhu and I have come to preach you out of affection.", "\" Thereafter Ribhu preached Nidaagh on the universality of soul and development of impartial view and left.", " By his preaching, Nidaagh’s ignorance dispersed and he began to see all the creatures equal to impartially.", " O king! Like the Brahmin who attains salvation because of impartial view, you also develop an impartial view regarding soul.", " Then you will not see anyone separate from you.", " Everything in this world is a manifestation of soul.", " Parashar says- \"Thus preached by Jadabharat, the king of Sauveer left his partial attitude.", " Jadabharat too received salvation when he realised the true knowledge.\" "], "next": "3.3", "prev": "3.2.14", "title": "Ribhu Preaches Nidaagh"}