{"index": "3.2.9", "image": "resized_images/Twelve Names of the Sun.png", "text": " In the month of Chaitra, the Sun rides his chariot as Dhaata.\n During that period, elf Kratusthala, sage Pulastya, Naag Vaasuki, Yaksha Rathmirith, demon Heti and the Gandharva Tumbaru are also present on the chariot as his assistants.\n In the month of Vaishaakh, the Sun rides his chariot as Aryamaa with sage Pulah, Yaksha Rathauja, elf Punjasthala, demon Praheti, snake Kachchhveer and Gandharva Naarad as his assistants.\n In the month of Jyeshtha, the Sun is known as Mitra with sage Atri, snake Takshak, demon Paurusheya, elf Menaka, Gandharva Haha and Yaksha Rathswan as his assistants.\n In the month of Ashaad, the Sun rides his chariot as Varun with sage Vashishta, snake Naag, elf Sahajanya, Gandharva Huhu, demon Ratha and Yaksha Rathachitra as his assistants.\n In the month of Shraavan, the Sun is known as Indra with Gandharva Vishwabasu, Yaksha Strot, snake Elaputra, sage Angira, elf Prabhalocha and the demon Sarpi as his assistants.\n In the month of Bhaadrapad, the Sun is known as Vivasvaan.\n With Gandharva Ugrasena, sage Bhrigu, Yaksha, Aapuran, elf Anubhlocha, snake Shankhpaal and the demon Vyaghra as his assistants.\n In the month of Ashwin, the Sun is known as Pusha with Gandharva Vasuruchi, demon Vaat, sage Gautam, snake Dhananjay, Yaksha Sushen and the elf Ghritaachi as his assistants.\n In the month of Kartik, the Sun is known as Parjanya and is assisted by the Gandharva Vishwabasu, sage Bharadwaj, snake Airavat, elf Vishwashree, Yaksha Senjit and the demon Aap.\n In the month of Maargsheersh, the Sun is known as Ansh and is assisted by sage Kashyap, Yaksha Tarkshya, snake Mahapadma, elf Urvashi, Gandharva Chitrasen and the demon Vidyut.\n In the month of Paush, the Sun is known as Bhaga and is assisted by sage Kratu, Gandharva Urnaayu, demon Sfurja, snake Karkotak, Yaksha Arishtnemi and elf Purvachitti.\n In the month of Maagh, the Sun is known as Twasta with sage Jamadagni, snake Cambal, elf Tilottama, demon Brahmopet, Yaksha Ritaajit and Gandharva Dhritarashtra.\n In the month of Phagun, the Sun is known as Vishnu and is assisted by snake Ashwatar, elf Rambha, Gandharva Suryavacha, Yaksha Shatajit, sage Vishwamitra and the demon Yagyopet.\n Thus having some parts of Lord Vishnu’s radiance, these seven ganas stay in the sphere of the Sun for one month alternatively.\n They are also the cause of seasons like summer, winter and rain. ", "next": "3.2.10", "prev": "3.2.8", "title": "Twelve Names of the Sun"}