{"index": "3.2.3", "image": "resized_images/Division of Bharat and Other Landmasses.png", "text": [" The landmass that is present between Himalayas and the ocean is known as Bharat.", " It has an expansion of 9,000 Yojans.", " It is populated by the descendants of Bharat.", " It has seven native mountains- Mahendra, Malay, Sahaya, Shuktimaan, Riksha, Vindhya and Paariyaatra.", " Bharatvarsha has nine divisions named Indradweep, Kaseru, Taamraparn, Gamastimaan, Naagdweep, Soumya, Gandharva, Vaarun and Yahadweep which is surrounded by the sea and has an expansion of 1000 Yojans.", " In the eastern part of Bharat, live Kiraat whereas in the western part live Yavans.", " In the mid part of Bharat, live population of Brahmins, Kshatriyas, Vaishyas and Shudras who pass their lives engage in works ascribed to their respective class.", " Rivers in India- From the Himalayas rise Shatudri (Sutlej) and Chandrabhaaga rivers.", " From Paariyaatra Mountain rise Veda and Smriti rivers.", " Narmada and Surasa rivers rise from Vindyachal.", " Taapi, Payoshani and Nirvindhya rivers rise from Riksha Mountain.", " Godavari, Bheemrati and Krishnaveli rivers rise from Sahaya Mountains.", " Kritmaala and Tamraparni rivers rise from Malayaachal.", " Trisaama and Aryakulyaa rivers rise from Mahendragiri.", " Rishikulya and Kumaari rivers rise from Shuktimaan Mountain.", " All these rivers have scores of other branches and tributaries.", " Four Yugas namely Satayug, Tretayug, Dwaparyug and Kaliyug descend on Bharatvarsha.", " In Bharatvarsha, sages observe penance to attain better life in another world, people organise Yagyas and offer donations to the Brahmins respectfully.", " In Jambudweep, Lord Vishnu is worshipped in Yagyas.", " Bharatvarsha is the land par excellence in Jambudweep for it is a land of action.", " Soul passes through millions of births, only then it finds a chance to take birth in Bharatvarsha when its pious deeds accumulate to a certain extent.", " Even the gods envy those people who take birth in Bharatvarsha.", " People in Bharatvarsha act without a desire to get fruits from their action.", " They dedicate their whole action to Lord Vishnu and ultimately mingle with Him. "], "next": "3.2.4", "prev": "3.2.2", "title": "Division of Bharat and Other Landmasses"}