{"index": "3.2.2", "image": "resized_images/Geographical Description.png", "text": " The earth has seven great islands- Jambu, Plaksha, Shaalmali, Kusha, Kronch, Shaakh and Pushkar.\n These are surrounded by oceans having saline water, sugarcane juice, wine, ghee, curd, milk and sweet water respectively.\n Jambudweep is situated at the centre.\n Situated at the centre of Jambudweep is golden Sumeru Mountain (Himalayas), which is eighty-four thousand Yojans high.\n Towards the south of Sumeru are Himavaan, Hemkut and Nishad Mountains.\n Towards its north are Neel and Shringi Mountains.\n All these mountains are two thousand Yojans high with similar expansion.\n Towards the south of Sumeru Mountain, Bharatvarsha is the first landmass followed by Kimpurushvarsha and Harivarsha.\n In the north of Sumeru Mountain, Ramyak is the first landmass followed by Hiranyamay and Uttarkuruvarsha.\n All these landmasses have expansion of nine thousand Yojans.\n At the centre of these landmasses is Ilaavritvarsha that bears Sumeru Mountain.\n On the four sides of Sumeru Mountain are four smaller mountains that seem to support the massive Sumeru.\n Among these four mountains, Mandrachal Mountain is in the east and in the south is Gandhmaadan.\n Vipul is in the west and Supaarsh is in the north.\n All these four mountains are ten thousand Yojans high and have lofty trees of Cadamba, Jambu, Pipal and Banyan.\n Because of abundance of Jambu trees, this island came to be known as Jambudweep.\n It bears big fruits, which scatter all around upon falling on the earth.\n Their juice gives rise to the river Jambu.\n It is said that its water is capable of keeping demerits like sweat, foul smell, old age and loss of senses away from the drinker.\n When the juice of this fruit dries, it leaves the soil golden in colour.\n Towards the east of Sumeru Mountain is Bhadrashvavarsha and towards the west is Ketumaalvarsha.\n Midway between the two is Ilaavritvarsha.\n On the eastern side of Meru Mountain is the forest of Chaitrarath.\n In the south is Gandhmaadan and in the west is Vaibhraaj and towards the north is the forest named Nandan.\n Mount Sumeru also holds four holy lakes named Arunodaya, Mahabhadra, Asitoda and Maanas.\n Shitambh, Kumund, Kukri, Maalyavaan, Vaikank are some of the peaks situated towards the eastern side of Sumeru.\n Towards the southern side are the peaks of Trikut, Shishir, Patang, Ruchak and Nishaad.\n In the west are situated peaks of Shikhivaasa, Vaidurya, Kapil, Gandhmaadan and Jaarudhi and in the north are situated the peaks of Shankhkoot, Rishabh, Hans, Naag and Kaalanj.\n Above the mount Meru is situated Brahmapuri of Brahma which has an expansion of 14,000 Yojans.\n The Ganges that rises from the feet of Lord Vishnu circles the lunar sphere before falling in Brahmapuri.\n Thence it divides into four rivers- Sita, Chakshu, Alaknanda and Bhadra that flow into four directions.\n The landmasses of Bharat, Ketumaal, Bhadraashva and Kuru appear like lotus leaf in shape.\n Among all the peaks that surround Mount Meru are present beautiful caves.\n There also exist beautiful towns and gardens.\n In these towns are situated beautiful temples of Lakshmi, Vishnu, Agni and Surya.\n Ravines of these mountains are populated by Gandharvas, Rakshasa, Yaksha and Daanavas.\n Besides them, scores of religious people also live there.\n Lord Vishnu stays as Hayagreev (human figure with horse head) form in Bhadrashvavarsha.\n In Ketumaalvarsha, He is in boar form and in Bharatvarsha;\n He stays in turtle form.\n In Kuruvarsha, Lord Vishnu stays as fish.\n Thus Lord Vishnu is present everywhere.\n People of these eight landmasses are free from all kinds of sorrow, pain, emotions, hunger etc.\n and lead a healthy and rich life that extends up to ten or twelve thousand years.\n All these landmasses have seven indigenous mountains each from which hundreds of rivers rise. ", "next": "3.2.3", "prev": "3.2.1", "title": "Geographical Description"}