{"index": "3.3.10", "image": "resized_images/Customs and Consecrations.png", "text": " At the time of childbirth, it is the father’s responsibility to carry out certain customs and consecrations for the child. First of all, Jatakarma Sanskara is carried out by which the newly born baby is included in the family. During this custom, a Brahmin couple is fed. It is also necessary for the couple that they should sit facing east while feeding. Thereafter, the parents should offer oblations to appease the gods and dead ancestors. Lumps made of barley flour, curd and berries should be offered as oblations. Similar consecrations are carried out at the time of children’s marriage. On the tenth day after the birth, the naming ceremony is carried out. Different castes and religion have different traditions regarding naming the newly born child. It is commonly seen that most of the children are named after the deities and gods. Still one should see that the name should not be meaningless, abusive or inauspicious. Practice of selecting exceptionally long and difficult to pronounce names should also be avoided. The second stage in a child’s life is when he or she begins education. In ancient times, thread ceremony used to be carried out and the children were sent to their teacher’s hermitage for education. In modern age, thread ceremony is followed more or less in similar way as it used to be in the past. But children are not sent to Gurukul for education any more. After completing education, a person should get married and run his own life. In the past, there had been elaborate rituals for the selection of suitable bride. Elders of the house used to select a proper match for the boy. Their choice in most cases depended on many attributes and bodily features of the girl. But in modern age, with increased interaction among the people, it is not possible to follow each and every custom related to selection of bride. Still one should take care not to marry in his mother’s lineage for up to fifth generation and in his father’s lineage up to seventh generation. ", "next": "3.3.11", "prev": "3.3.9", "title": "Customs and Consecrations"}