{"index": "3.3.6", "image": "resized_images/The Branches of the Sama Veda and the 18 Puranas.png", "text": " Sage Jaimini, a disciple of Vedavyasa, effected branches of Samaveda.\n Sage Jaimini had a son, Sumantu.\n Sumantu in turn had a son, Sukarma.\n Both of them studied a branch of Samaveda each.\n Sukarma divided his branch of Samaveda into sub-branches and taught them to his two disciples- Kaushalya Hiranyanaabh and Paushpinji.\n Hiranyanaabh had five hundred disciples.\n Upon receiving the knowledge of Samaveda branch from Hiranyanaabh, these disciples came to be known as Prachya Saamaag.\n Disciples of Paushpinji also effected divisions in Samaveda that they received from their teacher.\n One more disciple of Hiranyanaabh named Kriti taught twenty-four Samhitas of Samaveda to his disciples.\n Sage Sumant taught Atharvaveda to his disciple Kabandh.\n Kabandh divided it into two parts and taught them to Devdarsh and Pathya respectively.\n A disciple of Pathya named Shaunak divided his Samhita into two parts and gave one of them to his disciple Vabhru and another to Saindhav.\n Saindhav’s disciple Munjikesh divided his Samhita into three parts.\n Presently, five Samhitas of Atharvaveda namely Nakshatrakalpa, Vedakalpa, Samhitakalpa, Aangiraskalpa and Shantikalpa are considered authentic.\n Still unsatisfied by his achievement, sage Vedavyasa created Puraan Samhita and taught them to his famous disciple Romaharshan Suta.\n The Samhita that was created by Romaharshan was the base of three Samhitas- Akritvrana, Saavarni and Shaanspaayan created by Kashyapgotriya Brahmins.\n Vishnu Puraan is in a way a summation of these four Samhitas.\n There are in all eighteen Puraans.\n In chronological order, these are as follows- Brahma Puraan, Padma Puraan, Vaishnav Puraan, Shaiv Puraan, Bhaagwat Puraan.\n Naarad Puraan, Markandeya Puraan, Agneya Puraan, Bhavishya Puraan, Brahmavaivart Puraan, Linga Puraan, Varaha Puraan, Skand Puraan, Vaaman Puraan, Kaurma Puraan, Matsya Puraan, Garud Puraan and Brahmaand Puraan. ", "next": "3.3.7", "prev": "3.3.5", "title": "The Branches of the Sama Veda and the 18 Puranas"}