{"index": "3.3.9", "image": "resized_images/Description of Different Ashrams.png", "text": " Since birth till death, human life passes through different stages. For the purpose of simplicity in following these stages, our sages have made provisions for four stages or Ashrams in life namely Brahmacharya, Grihastha, Vanprastha and Sanyaas. Upanayana Sanskara (thread ceremony) marks the beginning of education for the children born in Brahmin, Kshatriya and Vaishya classes. For this purpose, a disciple must stay in his teacher’s hermitage and observe celibacy strictly. There, he must serve his teacher and worship Surya and Agni. The disciple is expected never to disobey his teacher. Activities should be according to the teacher’s guidelines. He should also make arrangements for the daily worship of his teacher in the way of collecting different materials like Havan saamagri, water, Kusha, flowers etc. After the completion of education and paying all the dues, the disciple is ready to start second stage of his life that is Grihasthashram. For this he should first find a suitable girl from his class and make merry. During this stage, he should earn his livelihood by occupations ascribed for his class. He should please the gods by Yagyas, his ancestors by oblations, Prajapatis by producing children, spectres by offering sacrifices of cereals and society by love. Even the ascetic and celibates depend on married people for their daily bread. Hence married life or Grihasthashram is stated to be excellent among all the Ashrams. A Grihastha must welcome and warmly treat the guests who arrive unexpectedly. Such a household from where a guest returns desperately never succeeds in religious matters. All the worship and Yagyas offered in such a household go futile. Hence it is not proper for the householder to show ego and abuse a guest otherwise he will have to expiate for it later. A person must always be on alert to recognise the time when it is apt to take Vanprastha. When the children grow and begin to hold the responsibility of the household, one enters the third stage i.e. Vanprasthashram. So, leaving his wife in the shelter of his children or taking her with him, one should migrate to the forest and live a simple life sustaining on whatever little is available from the nature. This stage must be passed observing severe penance and restraining one’s senses. Sanyaasashram is the fourth stage of life. One should give up all activities related to Dharma, Artha and Kama in this stage. He should keep an impartial view for all and cultivate a feeling of love for all the creatures. He should not hurt anybody by his words, actions or even thoughts. He should not stay in a village or town for more than five days. He should sustain his life on alms. ", "next": "3.3.10", "prev": "3.3.8", "title": "Description of Different Ashrams"}