{"index": "3.3.2", "image": "resized_images/Birth of Savarni Manu and Description of the Next Manvataras.png", "text": " Maitreya says- \"O sage, now kindly narrate about the Manvantaras that are to come in future.\" Parashar says- Vishwakarma’s daughter Sangya was the wife of Surya. They had three children, Manu, Yama and Yamani. Sangya once felt unable to bear the radiance of Surya. So, appointing Chhaya (her shadow) in the service of Surya, she herself migrated to the forest and began to observe a penance. Surya mistook Chhaya for Sangya and copulated with her. This resulted in the birth of three children- one more Manu, Shani and Tapati. One day, getting angry for some unknown reason, Chhaya who was in the guise of Sangya cursed Yama. Only then Surya and Yama came to know about her real identity. Through meditation, Surya saw that the real Sangya was observing penance as a mare in the forest. Surya also arrived in the forest and mated with Sangya in horse form. Their mating resulted in the birth of two Ashwini kumars, Retahstrav and Revant. Thereafter, Surya brought Sangya to his abode where Vishwakarma dulled his radiance. Chhaya’s son, Manu was a sibling of Manu; hence he came to be known as Saavarni. During the next Manvantara, Saavarni will rule as Manu. Sutap, Amitabh and Mukhya will be the categories of gods each with twenty deities. Ditimaan, Gaalav, Rama, Krip, Ashwatthama, Rishishring and my son, Vedavyasa will be among the Saptarishis. By the grace of Lord Vishnu, Virochan’s son Bali will occupy the throne of Indra. Daksha Saavarni will be the ninth Manu. During that Manvantara, Paar, Maarichgarv and Sudharma will be the three categories of the gods with twelve deities each. Adbhut will be Indra. Savan, Dyutimaan, Bhavya, Vasu, Meghatithi, Jyotishmaan and Sata will be among the Saptarishis. Brahma Saavarni will be the tenth Manu. During that Manvantara, Sudhaama and Vishuddh will be the two categories of gods with hundred deities each. Shanti will be Indra. Havishmaan, Sukrit, Satya, Tapomurti, Naabhaag, Apratimauja and Satyaketu will be among the Saptarishis. Dharmasaavarni will be the eleventh Manu. Vihangam, Kaamgam and Nirvaangati will be the categories of gods each with thirty deities. Indra’s name will be Vish. Nihsvar, Agniteja, Vayushmaan, Ghrini, Aaruni, Havishmaan and Anagh will be among the Saptarishis. Rudraputra Saavarni will be the twelfth Manu. Ritudhaama will be Indra and Harit, Rohit, Sumna, Sukarma and Suraag will be the five categories of the gods each with ten deities. Tapasvi, Sutapa, Tapomurti, Taporati, Tapoghriti, Tapodyuti and Tapodhan will be among the Saptarishis. Ruchi will be the thirteenth Manu. Sutrama, Sukarma and Sudharma will be the categories of the gods each with thirty-three deities. Devaspati will be Indra. Nirmoha, Tatvagarshi, Nishprakam, Nirutsuk, Ghritimaan, Avyay and Sutapa will be among the Saptarishis. Bhaum will be the fourteenth Manu. Suchi will be Indra. Chaakshush, Pavitra, Kanishth, Bhraajik and Vaachaavriddh will be the five categories of the gods. Agnibaahu, Suchi, Shukra, Maagadh, Agnidhra, Yukt and Jit will be among the Saptarishis. With the passing of these fourteen Manvantaras, a Kalpa that comprises of one thousand Yugas will come to an end. In Satayug, Lord Vishnu preaches about the metaphysical knowledge in Kapil’s incarnation. In Tretayug, He destroys the evil doers and protects the world. In Dwaparyug, He divides the Vedas into four divisions. At the end of Kaliyug, Lord takes Kali incarnation and inspires corrupt people to religious path. Thus, Lord Vishnu maintains order in all the four Yugas and causes the creation, sustenance and ultimately destruction of the universe. ", "next": "3.3.3", "prev": "3.3.1", "title": "Birth of Savarni Manu and Description of the Next Manvataras"}