{"index": "3.3.1", "image": "resized_images/Description of Manvataras.png", "text": " Maitreya says- \"O Gurudev! Now I wish to hear the description of all the Manvantaras and the Manus who ruled those Manvantaras.\n\" Parashar says- \"First Manu was self-begotten.\n After him five more Manus occurred namely Swarochish, Uttam, Taamas, Raivat and Chaakshush.\n All these Manus had occurred during the previous ages.\n The present Manu, Vaivasvat is the son of the Sun and this Manvantara is seventh.\n\" In the Swarochish Manvantara, Paaraavat and Tushitgana were the gods.\n Vipaschit was Indra.\n Urjja, Stambh, Praan, Vaat, Vrishabh, Nitya and Parivaan were the Saptarishis.\n Chaitra and Kimpurush etc.\n were the sons of Manu.\n Uttam was the Manu in Uttam Manvantara.\n Sushaanti was Indra with Sudhaam, Satya, Japa, Pratardan and Vashvarti were his Ganas.\n Seven sons of Vashishta were Saptarishis.\n In Taamas Manvantara, there were four categories of the gods namely Supaar, Hari, Satya and Sudhi.\n Each of them had twenty-seven gods each.\n King Shibi was Indra during that Manvantara.\n Jyotirdhama, Prithu, Kaatya, Chaitra, Agni, Vanak and Peevar were Saptarishis.\n During Raivat Manvantara, Vibhu was Indra.\n There were four categories of the gods namely Amitabh, Bhootrath, Vaikunth and Sumedha with fourteen gods each.\n Hiranyaroma, Vedshri, Urdhvabaahu, Vedbaahu, Sudama, Parjanya and Mahamuni were the Saptarishis.\n Four Manus Swarochish, Uttam, Taamas and Raivat are said to be the direct descendant of King Priyavrat.\n During Chaakshush Manvantara, Indra’s name was Manojav.\n Aapya, Prasoot, Bhavya, Prithuk and Lekh were the categories of gods each with eight deities.\n Sumedha, Viraja, Havishmaan, Uttam, Madhu, Atinaama and Sahishnu were the Saptarishis.\n During the present Manvantara, the Sun’s brilliant son Shraaddhdev is Manu.\n Aditya, Vasu and Rudra are the categories of the gods.\n Indra’s name is Purandar.\n Vashishta, Kashyap, Atri, Jamadagni, Gautam, Vishwamitra and Bharadwaj are the Saptarishis.\n Present Manu has nine sons Ikshvaaku, Nrig, Drisht, Sharayaati, Narishyant, Naabhaag, Arisht, Karush and Prishadhra. ", "next": "3.3.2", "prev": "3.3", "title": "Description of Manvataras"}