{"index": "3.3.17", "image": "resized_images/Dialogue of Mayamoha with Demons.png", "text": " Mayamoha was produced in a naked form. It reached the bank of Narmada and saw the demons observing penance there. The naked Mayamoha then approached them and said in a sweet voice- \" O demons! What is the purpose of your penance?\" The demons said- \"We are observing penance to achieve the metaphysical world.\" Mayamoha said- \"If you long for salvation, do as I suggest. Follow the religion which is like an open gate to salvation.\" With such sweet talk, Mayamoha began to illumine the demons’ mind. Mayamoha confused them further saying- \"O demons, if you long for salvation or a place in the heaven, give up sacrificing animals and attain enlightenment. It is wrong notion to say that violence is the religious path. Offering of oblations in fire is also childish. Even an animal which eats green grass is better than Indra who is obliged to eat wood despite attaining that position after hundreds of great Yagyas. If an animal which is sacrificed in Yagya attains heaven, performer of Yagya would have killed his own father.\" Thus with these witty talks, Mayamoha deviated the demons from the righteous path because of which they lost interest in Vedas. Once it was achieved, the gods attacked the demons with full preparations. Ultimately, many demons were killed whereas those who remained came to be known as naked because they no longer followed the teachings of Vedas. Thus, anybody who does not practice the teachings of Vedas in his life is known as naked. Those who do not take to Vanprastha or Sanyaas after the completion of Grihasthashram are naked. Tale of Shatadhanu- In the ancient times there was a king named Shatadhanu. His queen Shaivya was a righteous and religious woman. The king and the queen had worshipped Lord Vishnu observing severe penance. On the full moon day in the month of Kartik when the king and queen came out of the Ganges after taking bath, they happened to sight an imposter Brahmin who was coming from the opposite direction. The Brahmin was a friend of the king’s teacher. So, the king treated the Brahmin with respect. But his chaste wife did not show any respect for the imposter and kept silent all through the talk. She then had a sight of the Sun to expiate for the meeting with an imposter. On their return to the palace the king and the queen worshipped Lord Vishnu with proper rituals. In due course, the king died. The queen also committed Sati. Since the king had committed the sin of talking to an imposter during his penance the king had committed the sin of talking to an imposter during his penance, he took birth in a dog form whereas queen Shaivya took birth as the daughter of a Kashi king. She was extremely beautiful and knew everything about her previous birth. When her father decided to marry her off, she requestfully refused for she knew that her previous birth husband was roaming the streets and lanes of Vidisha in a dog form. The princess of Kashi then reached Vidisha and found out that dog was in fact King Shatadhanu. She fed the dog with delicious food eating which the dog began to wag its tail and show humility before the princess. The princess saluted the dog and narrated the whole thing to it that it was because of his sin of talking to an imposter during penance that he had to take birth as a dog. Thus, reminded by the princess, the dog contemplated for long on the events of his previous birth. He grew so sad that he gave up the dog form on the outskirts of the town. In his next birth however he was born as a jackal. Again the princess came to know that the jackal was King Shatadhanu and asked him whether he continued to talk to the imposter after their conversation in the previous birth? Only then, King Shatadhanu came to realise his mistake. He then observed fast till death. But in his next birth, he was born as a wolf. Again the princess reminded him of his previous birth. The king’s became a vulture in his next birth. After that, he took birth in crow form and then as a peacock. During that time, King Janak was organising an Ashwamedha Yagya. In the Yagya, the peacock was also given a ceremonial bath by the princess. During the bath, the princess reminded the peacock (King Shatadhanu) of his previous birth, the peacock too died and took next birth as the son of King Janak. It was only after the birth of King Janak’s son that the princess told her father to organise a Swayamvara for her. In the Swayamvara, the prince also arrived. The princess accepted him respectfully as her husband. ", "next": "3.4", "prev": "3.3.16", "title": "Dialogue of Mayamoha with Demons"}