{"index": "3.4.7", "image": "resized_images/Birth of Jamadagni and Vishwamitra.png", "text": [" Pururava had six sons- Aayu, Amavasu, Vishwavasu, Shrutaayu, Shataayu and Ayutayu.", " Amavasu had a son Bheema and Bheema in turn had a son Kanchan.", " Jahnu was the son of Kanchan’s son, Suhotra.", " At the time of Ganga’s descend on earth, when Jahnu saw his hermitage inundated, he drank all her water.", " He released the Ganges only when the Devrishis prayed him.", " Since then Ganges also came to be known as Jahnavi, the daughter of Jahnu.", " Lineage of Jahnu grew as follows- Jahnu- Sumant- Ajak- Balaakashva and Kusha.", " Kusha had four sons- Kushaamb, Kushnaam- Adhurtraja and Vasu.", " Kushaamb observed severe penance with a desire to have a son like Indra.", " Pleased by his penance, Indra himself took birth as his son.", " He came to be known as Kaushik.", " Kaushik had a daughter named Satyavati who got married to Richeek.", " Sage Richeek prepared kheer in two parts- one for his wife Satyavati and another for Satyavati’s mother.", " Instructing Satyavati, he went to the forest.", " When Satyavati and her mother were about to eat the kheer, her mother exchanged her part of kheer with that of her daughter saying that her son had to foster the world while the son of the sage had nothing to do with wealth and all that.", " Satyavati agreed to that and ate that part of kheer, which was reserved for her mother whereas her mother ate Satyavati’s part.", " When Richeek returned from the forest, he noticed formidable changes in the body of his wife.", " He understood that she had eaten her mother’s part of the kheer.", " Angrily the sage predicted that she would have a son who would be Kshatriya-like in virtues whereas her mother would have Brahmin-like son.", " Satyavati begged pardon and requested the sage to change his prediction saying that the crime was committed by mistake and that she would be happy to have a Kshatriya-like grandson but not a son.", " At her request the sage changed his prediction.", " As per the prediction, Satyavati gave birth to Jamadagni whereas her mother gave birth to Vishwamitra.", " After giving birth to Jamadagni turned into a river named Kaushiki.", " In later course, as a partial incarnation of Lord Vishnu, Parashuram took birth as the son of sage Jamadagni. "], "next": "3.4.8", "prev": "3.4.6", "title": "Birth of Jamadagni and Vishwamitra"}