{"index": "3.4.1", "image": "resized_images/Description of Vaivasvat Manu’s Lineage.png", "text": " Lineage of Vaivasvat Manu finds its origin at Brahma. Brahma was the first to appear from Lord Vishnu who is the primitive cause for the whole creation. From the right hand thumb of Brahma, Daksha Prajapati appeared. Daksha produced Aditi and Aditi produced Vivasvaan. Manu was the son of Vivasvaan. Ikshvaaku, Nrig, Grishth, Sharayaati, Narishyant, Pranshu, Naabhaag, Dishta, Karup and Prishadhra are the ten sons of Manu. With a desire for a son Manu organised a Yagya to please the deities Mitra and Varun. But during the Yagya because of a wrong resolution of oblator, a daughter named Ila was born to them. But by the grace of Mitra-Varun, she got masculine appearance and a name Sudyumna. In later course by the wrath of Lord Shiva, Sudyumna was converted into a woman. In woman form when Sudyumna was roaming near the hermitage of Buddha, the son of Chandrama, her beauty infatuated Buddha. As a result of their union, a son Pururava was born. Even after the birth of Pururava, Sudyumna could not give up his temptation to be a man again. Hence, learned sages organised a Yagya for Sudyumna and got him converted into a man again. In masculine form, Sudyumna produced three sons- Utkal, Gaya and Vinat. Manu had presented a town named Prathishtha to Sudyumna, which he later on presented to Pururava. Pururava’s progenies spread in all directions and acquired Kshatriya caste. Manu’s son, Prishadhra became a Shudra because of killing a cow of his teacher. Manu’s another son, Karush produced an exceptionally strong Kshatriya named Kaarush. Lineage of Dishta grew as follows- Naabhaag- Balbandhan- Kirtimaan- Vatsapreeti-Praanshu- Prajapati- Khanitra- Chaakshush- Vimbha- Vivimbhak- Khaninetra- Ativibhuti- Karandham- Avikshit- Marut. Marut had a son, Narishyant. Lineage of Narishyant grew as follows- Dama- Rajvardhan- Suvriddhi- Keval- Sughritti- Nara- Chandra- Keval- Bandhumaan- Veghvaan- Buddha- Trinvindu. Trinvindu had a daughter Ilavila and a son Vishal. Vishal in later course founded Vishaala. Lineage of Vishal grew as follows- Hemchandra- Chandra- Dhumraksh- Srinjay- Sahadev- Krishasva- Somadutta- Janmejaya- Sumati. Manu’ son Sharayaati had a daughter Sukanya who was married to sage Chyavan in peculiar circumstances. Aanart was the son of Sharayaati. Aanart had a son Raivat who founded his capital at Kushasthali and ruled his kingdom on earth. Raivat had one hundred sons, the eldest among whom was Kakudmi. He had a daughter Revati. Raivat took Revati with him and approached Brahma who asked about a suitable match for her. At that time, Gandharvas were singing near Brahma. Raivat listened to their songs intently and forgot about the passage of time. Many ages passed like that but Raivat felt as if only an hour had passed. When the Gandharvas stopped singing, Raivat once again asked Brahma about a suitable match for Revati. Brahma asked Raivat about his own choices first. Raivat counted the names of many deserving princes and kings all of whom belonged to earth. Brahma said smiling- \"No one even in the progeny of these people is alive on earth because here listening to the Gandharvas songs you have passed four ages. Presently even the age of eighteenth Manu is about to end on earth and Kaliyug is about to start.\" These words frightened Raivat who greeted Brahma and asked- \"O Lord! Now tell me whom should I marry Revati to?\" Brahma said- \"That unborn all pervasive Parmeshwar Lord Vishnu had taken an incarnation on earth. O king! Your capital at Kushasthali which was equal to Indra’s abode Amravati is now Dwarkapuri. In that Dwarkapuri, stays Baldev who is a part of Lord Vishnu. Marry this daughter to him because she is a jewel among the women folk and Baldev is praised all over the world by all. Hence only he deserves to be your son-in-law.\" Hearing the verdict of Brahma, Prajapati Raivat descended on the earth and saw that an amazing transformation had taken place in the appearance of people who were now smaller in stature, ugly, dull and devoid of strength. Even his capital Kushasthali had acquired a new appearance and was now known as Dwarkapuri. Raivat found out Baldev and married his granddaughter Revati to him. But Revati appeared quite large and taller in stature than Baldev because of age difference. Baldev pressed her slightly with anterior part of his plough and she assumed a stature equal to normal women. After marrying Revati to Baldev, Raivat migrated to the Himalayas to observe penance. ", "next": "3.4.2", "prev": "3.4", "title": "Description of Vaivasvat Manu’s Lineage"}