{"index": "3.4.2", "image": "resized_images/Description of Ikshvaku’s Lineage.png", "text": [" Ikshvaaku was born from the nostril of Manu as a result of sudden sneezing.", " Ikshvaaku had hundred sons among whom Vikukshi, Nimi and Danda were prominent.", " Once Ikshvaaku organised a Shraadh.", " For the purpose of feeding Brahmins, he ordered his son Vikukshi to bring fresh meat of wild animals.", " Taking his bow and arrows, Vikukshi set out for the forest and hunted many deer and rabbits.", " Towards noon, he felt tired and hungry and hence ate one rabbit from the stock.", " Then he reached the capital and handed over the remaining flesh to his father.", " But the sage Vashishta who was conducting the Shraadh revealed the truth to Manu.", " Thus Vikukshi got the name of Shashaad and was expelled by his father.", " Shashaad in later course had a son, Puranjay.", " In the past a fierce battle had taken place between the demons and the gods.", " The demons defeated the gods who approached Lord Vishnu for help.", " Lord Vishnu said-\"I am aware of your desire.", " I will appear in he body of Shashaad’s son Puranjay to kill the demons.", " But it is your responsibility to convince him for the battle.", "\" The gods approached Puranjay and requested-\"O great among the Kshatriyas! Kindly help us to defeat our enemies.", "\" Puranjay said-\"Shatkratu is Indra.", " If I fight the battle riding his shoulder, I will be able to kill the demons.", "\" The gods accepted his condition.", " Indra took the guise of the bull riding which Puranjay killed the demons because Lord Vishnu had partially arrived in his body.", " Since then Puranjay got the name Kakutsth.", " He had a son Aneyna.", " Lineage of Aneyna grew as follows- Aneyna- Prithu- Vishtrabhva- Chaandrayuvnashva- Shaavasta.", " Shaavasta founded the town of Shaavasti (modern Shraavasti).", " Lineage of Shaavasta continued as follows- Shaavasta- Vrihadashva- Kuvalayaashva- Dridaashva- Tandraashva- Kapilaashva.", " For a long time, Yuvanashva did not have a child.", " So, he organised a Putreshti Yagya in the auspices of learned sages.", " The Yagya lasted for a whole day.", " At mid-night when the Yagya ended, sages fell asleep because of tiredness keeping the urn of Yagya water near the altar.", " The water had been empowered with sacred mantras.", " Meanwhile the thirsty king came there and drank that water from the urn.", " When the sages awakened, they enquired about the water in the urn.", " Yuvanashva told them that he had himself drunk it.", " The sages told that as the water had been empowered with sacred mantras and was meant for the queen in order to make her conceive.", " Hence the king instead of the queen will conceive now.", " As a result Yuvanashva conceived and in due course gave birth to a child from his right armpit.", " But the child’s birth did not kill the king.", " The baby was Mandhaata.", " In due course Mandhaata ruled the entire earth, which was divided into seven islands.", " Mandhaata married Bindumati, the daughter of Shatabindu.", " They had three sons- Purukutsa, Ambareesh, and Muchukunda.", " They also had fifty daughters.", " When all the daughters grew young a sage Saubhari arrived in the palace and requested Mandhaata to marry one of his daughters to him.", " The sage appeared old and frail.", " So, Mandhaata hesitated and tried to send him off making many excuses.", " The sage assured him about his physical abilities.", " But still the king felt hesitant and said-“O sage, it is our tradition that we marry our daughter only to he whom our daughter chooses as her husband.", " Your request is beyond our desires.", "\" Hearing Mandhaata’s word sage considered for a moment and said-\"All right O king! Kindly instruct the eunuch who guards the quarters of your daughters to escort me there.", "\" Fearing a curse from the sage, Mandhaata instructed the eunuchs to escort him into the quarters of his daughters.", " While entering the quarters, the sage assumed the appearance of an extremely handsome Gandharva.", " So, when he arrived there, a row started among the girls as to who would choose him as her husband first.", " Each one of them claimed that she had first chosen him.", " Thus all the daughters of Mandhaata chose sage Saubhari as their husband.", " When the eunuchs informed the king about this development, he fell in deep thoughts how it could happen.", " But still he was bound by his promise so he had no choice but to marry all his daughters to sage Saubhari.", " Marrying all the fifty girls, sage Saubhari brought them to his hermitage.", " Calling Vishwakarma, he instructed him to build separate castles for each of his wives.", " In no time, Vishwakarma erected fifty beautiful palaces in a row.", " Each one of them had ample spacious and airy rooms, surrounded by beautiful gardens.", " Since then, all the girls occupied those palaces and began to live there.", " Every kind of luxury and food was available to them.", " One day, drawn by the love for his daughters, King Mandhaata decided to visit Saubhari’s Ashram.", " But in place of Ashram, he found a row of beautiful palaces.", " There, he met his daughters and enquired about their well being.", " The daughters informed him that they were happy to live with the sage and that their husband was capable enough to provide them with all the luxuries.", " But still they remembered their native place.", " Each of the girl also expressed one grief that her husband enjoyed intimacy with her at all times and did not share time with her other sisters.", " These words of the girls surprised the king.", " Ultimately he met Saubhari and worshipping him he said-\"O lord! It is the result of your severe penance that you are able to keep all the fifty girls happy.", "\" Staying there for a few days, the king returned.", " In due course, the daughters of Mandhaata gave birth to one hundred and fifty sons.", " Those sons grew up and produced their progeny.", " At that time sage Saubhari thought- ‘I have seen the birth of my sons.", " Now they have their own sons.", " If I stay there, I will long to see my great-grandchildren.", " Desires do not end till death.", " Acquiring a human body is in itself a great sorrow.", " I have received enough in life, enjoyed intimacy with fifty princesses.", " If I keep more desires, I will receive nothing but sorrow.", " Hence I should take to the penance of Lord Vishnu.", "’ Thinking that way, sage Saubhari migrated to the forest along with his fifty wives. There they conducted Yagyas and passed their time worshipping Lord Vishnu. "], "next": "3.4.3", "prev": "3.4.1", "title": "Description of Ikshvaku’s Lineage"}