{"index": "3.4.11", "image": "resized_images/Description of Yaduvansh and the Tale of SahastrArjuna.png", "text": [" Yayati’s eldest son Yadu had four sons- Sahastrajit, Kroshtu, Nala and Nahush.", " Sahastrajit had a son Shatajit who had three sons Haihaya, Hehaya and Venuhaya.", " Lineage of Haihaya grew as- Dharma- Dharmanetra- Kunti- Sahajit- Mahishmaan- Bhadrashrenya- Durdabh and Dhanak.", " Dhanak had four sons- Kritveerya, Kritaagni, Kritdharma and Kritauja.", " Kritveerya had a prowessive son Arjun.", " Arjun had worshipped Dattatreya and by his blessings acquired one thousand arms.", " Since then he came to be known as Sahastrarjun.", " Dattatreya had blessed him with many other boons like rule of entire earth, fostering of his subjects in religious ways and killing by some human being famous in all the three worlds.", " At that time, there was no other king equal to Sahastrarjun in virtues.", " He ruled the entire earth for eighty-five thousand years.", " Once Sahastrarjun was enjoying his past time on the waters of Narmada when he happened to have an encounter with Ravan, the king of Lanka.", " Sahastrarjun captured Ravan easily and imprisoned him at an isolated place in his kingdom.", " With time ego of Sahastrarjun had crossed all limits.", " He began to terrorise the sages and other religious people.", " When his atrocities increased beyond tolerance level, Lord Vishnu took a partial incarnation as Parashuram, the son of sage Jamadagni and Renuka.", " As per the prediction of sage Richeek, Parashuram grew with Kshatriya - like virtues.", " He had in fact taken incarnation to relieve the earth from the atrocities of egoist kings.", " Parashuram had received arms training from none other than Lord Shiva.", " He was very obedient to his father and had beheaded his own mother by the Parashu (axe) that he had received from Lord Shiva at the dictate of his father.", " In due course Parashuram not only got Ravan released from captivity but also killed Sahastrarjun.", " Sahastrarjun had one hundred sons among whom Shur, Shursena, Vrishasena, Madhu and Jayadhwaj were prominent.", " Jayadhwaj had a son Taaljunga.", " Taaljunga had one hundred sons among whom Vitihotra and Bharat were prominent.", " Bharat again had one hundred sons whereas Madhu also had hundred sons among whom Vrishni was prominent.", " After the name of their forefather Yadu, this clan came to be known as Yaduvansha. "], "next": "3.4.12", "prev": "3.4.10", "title": "Description of Yaduvansh and the Tale of SahastrArjuna"}