{"index": "3.4.3", "image": "resized_images/Progeny of Mandhatr, Ascend of Trishanku to Heaven and Birth of Sagar.png", "text": [" Once upon a time Gandharvas of collective name Mauneya defeated the Nagas and snatched all their wealth and powers.", " The Nagas prayed Lord Vishnu to rescue them.", " Lord Vishnu told them that he would appear in Mandhaata’s son Purukutsa and kill the Gandharvas.", " Afterwards Narmada brought Purukutsa to Rasaatal where Lord Vishnu appeared in his body.", " Thus having the strength of Lord Vishnu, Purukutsa defeated and killed the Gandharvas.", " Pleased by the action of Narmada, the Nagas blessed her with a boon that whoever remembered her would have no fear of snake venom and Purukutsa that he would have an immortal son.", " Purukutsa and Narmada had a son Trasadasyu.", " Lineage of Trasadasyu continued as follows- Trasadasyu- Anaranya- Vrihadashva- Haryashva- Hasta- Sumana- Tridhanva- Trayaruni and Satyavrat.", " Satyavrat became famous as Trishanku in later course.", " By the curse of a sage, Trishanku had become a Chandaal.", " Once a drought occurred for twelve long years.", " During that drought, to get rid from this condition of Chandaal and feed sage Vishwamitra, Trishanku used to tie a whole skinned deer to a Banyan tree on the bank of the river Ganges.", " Pleased by his selfless service, sage Vishwamitra sent Trishanku to the heaven with his ephemeral body.", " Lineage of Trishanku grew as follows- Trishanku- Harishchandra- Rohitashva- Harit- Chanchu- Vijay and Vasudev.", " Vijay had a son Ruruk.", " Ruruk’s son was Vrik who had a son Baahu.", " Baahu had two queens.", " After a long time of their marriage, Baahu’s queen consort conceived a son.", " But the circumstances took a strange turn.", " Baahu’s enemies together attacked his kingdom and defeated him.", " The defeated king migrated to the forest along with his queens and began to live at the hermitage of sage Aurv.", " Very soon, King Baahu died of old age.", " His queen consort also wanted to commit Sati but sage Aurv prevented her from doing so.", " After sometime getting envious of her fortune, the other queen deceitfully fed her with poison.", " But the poison could not harm the foetus, which stayed unborn for a period of seven years because of poison’s effect.", " Staying at the hermitage of sage Aurv, the queen consort gave birth to a son.", " Since the child was born with the effect of the poison, Sage Aurv named him as Sagar.", " Sagar began to grow in he hermitage in natural surrounding.", " One day he asked his mother about his father.", " The queen narrated the whole incident to him.", " Sagar then and there took an oath to exterminate the Kshatriyas who had been the cause of his father’s death.", " Acting as per his oath, Sagar destroyed Haihaya Kshatriyas whereas Shak Kshatriyas got their heads shaven out of fear.", " Since those Kshatriyas had given up their religion, hence Brahmins boycotted them.", " As a result they became Malechchha.", " Thereafter King Sagar returned to his capital and ruled the earth. "], "next": "3.4.4", "prev": "3.4.2", "title": "Progeny of Mandhatr, Ascend of Trishanku to Heaven and Birth of Sagar"}