{"index": "3.4.12", "image": "resized_images/Description of Kroshtuvansh.png", "text": " Lineage of Kroshtu grew as follows- Kroshtu- Dhwajnivan- Swati- Rushanku- Chitrarath- Rashibindu.\n Rashibindu had one lakh queens and ten lakh sons among whom Prithusharva, Prithukarma, Prithukirti, Prithuyasha, Prithujay and Prithushan were prominent.\n In their lineage later on occurred a king named Jyamadh.\n He was so dedicated to his wife Shaivya that despite being childless, he did not dare to marry other women because of her fear.\n Once, Jyamadh took part in a fierce battle in which he defeated all his enemies.\n While he was about to return, he heard pitiable cries of a woman.\n He saw a beautiful young lady who was crying for her protection.\n Jyamadh was so infatuated by her beauty that he took her to his kingdom.\n When they reached at the gate of the palace, the king saw that the queen Shaivya was waiting for him along with a big crowd.\n When Shaivya saw a beautiful young lady sitting beside the king on the chariot, she began to shout at him.\n The horrified king tried to explain that the young lady was his daughter-in-law.\n The queen shouted even louder that when they did not have a son, whence the daughter-in-law came.\n But the king explained that he had selected a wife for her would-be son.\n As the effect of their conversation queen Shaivya soon conceived and gave birth to a son inspite of her advancing age.\n They named the son as Vidarbh.\n In due course of time, Vidarbh got married to that lady whom his father had brought home earlier.\n They had three sons- Krath, Kaushik and Romapad.\n Romapad had received preaching from Narad.\n Lineage of Krath grew as follows- Krath- Kunti- Ghrishti- Nighriti- Dashaard- Vyoma- Jimoot- Vikriti- Bheemrath- Navrath- Dasharath- Shakuni- Karambhi- Devraat- Devakshatra- Madhu- Kumarvansh- Anu- Kurumitra- Anshu- Satvak.\n Satvak was the forefather of a clan that was named after him. ", "next": "3.5", "prev": "3.4.11", "title": "Description of Kroshtuvansh"}