{"index": "3.4.4", "image": "resized_images/Description of Suryavansh.png", "text": " King Sagar had two queens, Sumati, the daughter of Kashyap and Keshini, the daughter of Vidarbha’s king.\n Keshini had a son Asmanjas whereas Sumati had sixty thousand sons.\n Anshuman was the son of Asmanjas.\n Asmanjas was very whimsical since his childhood.\n Even in his youth, he did not change his behaviour.\n Hence King Sagar had abandoned Asmanjas.\n But the things did not improve for Sagar because even his sixty thousand sons followed the footsteps of Asmanjas.\n The gods one-day approached sage Kapil who was a partial incarnation of Lord Vishnu.\n Greeting him, they said- “If the sixty thousand sons of Sagar continued on their whimsical way, the earth would not remain suitable for living.\n” Sage Kapil assured the gods that the sixty thousand sons of Sagar would meet their fate very soon.\n By the instigation of sage Kapil, King Sagar organised an Ashwamedha Yagya.\n The sixty thousand princes also followed the horse guarding it.\n But somehow Indra managed to kidnap the horse and tethered it at the hermitage of sage Kapil.\n The sixty thousand princes searched for the horse and following the footprints, they also reached the hermitage.\n There they found the horse and also a sage in deep meditation.\n Thinking that the sage might have been responsible for abduction of the horse they began to abuse him.\n As soon as sage Kapil disturbed by the abuses opened his eyes, a flame appeared and incinerated all the sixty thousand princes.\n When King Sagar came to know about this incident, he sent Anshuman to bring back that horse.\n Anshuman also reached the hermitage and greeted sage Kapil with respect.\n Pleased by his politeness, sage Kapil blessed Anshuman and instructed him to take the horse away with him.\n He also asked him to seek a boon.\n As the boon, Anshuman only sought the salvation for his sixty thousand dead uncles.\n Sage Kapil assured Anshuman that his ancestors would certainly attain to the heaven but only after a long wait and that his grandson Bhagirath would bring the Ganges onto the earth and that the Ganges’ waters would wash the ashes of his ancestors to the ocean and cause their salvation.\n Thus blessed by the sae Kapil, Anshuman returned to the capital with the horse in order to help his grand father finish the Yagya.\n Anshuman had a son Dileep.\n Dileep’s son was Bhagirath who observed severe penance and pleased Ganga to descend on the earth.\n Since the Ganges had descended on earth because of Bhagirath’s penance, she also got a name Bhagirathi.\n The lineage of Bhagirath grew as follows- Bhagirath- Suhotra- Shruti- Naabhaag- Ambareesh- Sindhudweep- Ayutayu- Rituparn- Sarvakaam- Sudas and Saudas.\n One day, King Saudas went hunting in the forests.\n There he spotted a pair of the tigers.\n They were actually a tiger and a tigress in mating.\n Saudas killed one of them by his arrow, while the other turned into a demon and threatening of an avenge disappeared from the scene.\n In due course, King Saudas organised a Yagya in the auspices of sage Vashishta.\n Towards the end of Yagya, sage Vashishta went away to take bath.\n Meanwhile the same demon arrived there in the guise of Vashishta and expressed his desire to eat non-vegetarian food.\n Then the demon arrived before the king in the guise of the cook.\n The king ordered him to cook meat for the sage.\n The cook cooked human flesh and served it before the sage.\n Sage Vashishta knew that the food contained human flesh.\n He cursed the king in anger to be a demon.\n Within three days, King Saudas became a demon and began to roam in the forests.\n Since then he ate the humans only.\n One day, Saudas in demon form saw Muni who was in the process of mating his wife.\n The demon caught and ate the Muni neglecting all the cries and wailing of his wife.\n The Brahmani angrily cursed the demon that as her husband had been killed while he was about to sate his carnal lust similarly he would also die right in the same process.\n King Saudas remained in the demon’s form for twelve more years.\n After that he recovered from the curse and began to rule like a pious king.\n One day, King Saudas saw the queen in an amorous condition and an impulse of carnal pleasure ran within his body.\n He made advances to satisfy his lust but the queen who knew everything about the curse stopped him reminding him of the curse.\n Since then the king stuck to celibacy.\n Since the king had no son, he allowed his queen Madayanti to conceive a child with the help of sage Vashishta.\n The queen did conceive but the foetus remained unborn for seven years at length.\n At last the irritated queen hit her foetus with a stone.\n This resulted in the birth of child at once.\n The child was named Ashmak.\n The lineage of Ashmak grew as follows:\n Ashmak- Moolak- Dasharath- Ilivil- Vishvasah and Khatwang.\n Khatwang had killed many formidable demons fighting by the side of the gods.\n Pleased by his gallantry, the gods wanted to grant him a boon.\n Khatwang wanted to know how long would live more.\n The gods told him that he would live for one Muhurta more.\n Hearing this, Khatwang came back on earth and prayed Lord Vishnu to take him in His refuge.\n At last he did annihilated with Lord Vishnu.\n Lineage of Khatwang grew as follows-Khatwang- Deerghbahu- Raghu- Aja and Dasharath.\n King Dasharath had three queens who gave birth to four sons-Rama, Lakshmana, Bharat and Shatrughana.\n Rama was an incarnation of Lord Vishnu.\n His life too had lot of ups and downs.\n After being trained in archery, He and Lakshmana spent most of their boyhood time in the hermitage of sage Vishwamitra guarding his Yagyas from the demons.\n After that when Vishwamitra was taking them to Mithila Lord Rama salved Ahilya who had been converted into a stone by the curse of her husband sage Gautam.\n In Mithila, Lord Rama broke the bow of Lord Shiva and won Sita as His wife.\n When they returned to Ayodhya, King Dasharath decided to crown Rama as the new king.\n But misguided by Manthara, queen Kaikeyee stubbornly sought that her son Bharat should be crowned as the new king whereas Rama should be sent on an exile for fourteen years.\n Bounded by his promises that he had made to Kaikeyee earlier, King Dasharath had no choice but to accept her demands.\n Thus to keep His father’s words, Lord Rama accepted the exile.\n Sita and Lakshmana also followed His steps.\n In the forests, the demon king Ravan deceitfully abducted Sita.\n It was followed by meeting of Rama with Hanumana and Sugreev, killing of Baali- Sugreev’s brother, finding of Sita by Hanumana in Lanka, bridging of the sea that separated Lanka, fierce battle with the demons and ultimately killing of Ravan by Lord Rama.\n After the completion of exile period Lord Rama returned to Ayodhya and ruled there for twelve years.\n Lord Rama had two sons- Lava and Kusha.\n Lineage of Kusha grew as follows- Kusha- Atithi- Nishadh- Anal- Nabh- Pundareek- Kshemdhanwa- Devaneek- Ahinaka- Ruru- Pariyatrak- Deval- Vanchal- Ulka- Vajranabha- Shankhan- Yushhitashva- Vishvasaha- Hiranyanaam- Pushya- Dhruvsandhi- Sudarshan- Agnivarn- Shighrag- Maru- Prasushrut- Susandhi- Amarsh- Sahaswan and Vishvabhav.\n Vishvabhav had a son Brihdal who was killed by Abhimanyu in the battle of Mahabharat. ", "next": "3.4.5", "prev": "3.4.3", "title": "Description of Suryavansh"}