{"index": "3.5.3", "image": "resized_images/Incarnation of Lord Krshna.png", "text": " Vasudev, the son of Shoorsen was married to Devaki, the daughter of Devak. On that occasion of their marriage, Devaki’s cousin Kansa was driving their chariot. At that time, a celestial voice declared that the eighth son of Devaki would kill Kansa. Kansa in the excitement was ready to kill Devaki ten and there but Vasudev convinced him saying that he would himself hand over all his children to him. Thus assured by Vasudev, Kansa dropped the idea of killing Devaki. When the marriage of Vasudev and Devaki was taking place, Prithvi approached Brahma in the guise of a cow. She complained to Brahma that population of mean-minded people was increasing and that she was not more able to bear the burden of their anti-religious deeds. Prithvi said- \"O Lord! The same demon Kaalnemi whom Lord Vishnu had killed in his previous birth has taken incarnation of Kansa, the son of Ugrasena. Many other fearsome demons Arishth, Dhenuk, Keshi, Pralamb, Sunda, Banasura and many more have taken over the rule and tormenting the religious people in many ways. They keep million strong forces. I am unable to bear their burden. So kindly do something to get me rid of this burden.\" Hearing the words of Prithvi, Brahma said to the gods- \"Prithvi speaks the truth. Indeed she is carrying too much burden. Let us all go to the shore of Ksheersagar and pray Lord Vishnu and intimate Him about all this matter.\" Then accompanied by the gods, Brahma arrived at the coast of Ksheersagar and prayed Lord Vishnu. Pleased by their prayer, Lord Vishnu appeared before them in His universal form and said- \"Brahmaji! Believe my words and be assured that whatever you and these gods desire shall realise.\" Thus assured by the Lord all the gods and Brahma prayed once again. Pleased by their prayer, Lord Vishnu plucked a black and a white hair from his head and said-\"Both these hair of mine shall take incarnation on earth and remove the miseries that the people face there. All of you take partial incarnation on earth to attenuate the strength of the demons. This black hair of mine shall take birth as the eighth son of Devaki and kill Kansa who is an re-incarnation of Kaalnemi.\" While this conversation was on, Devarshi Narad appeared before Kansa and informed him that Lord Vishnu would take birth as the eighth son of Devaki. Hearing the words of Narad, Kansa angrily put Vasudev and Devaki behind the bars. There in his abode, Lord Vishnu instructed Mahamaaya (personified illusion) to implant the six foetuses who were in Pataal in the womb of Devaki, one by one. He knew that all of them would be killed by Kansa. Then he instructing Mahamaaya to implant his part Shesha who would appear as the seventh issue of Devaki, in the womb of Rohini, the second wife of Vasudev so that he could appear as her son instead of Devaki’s. Lord instructed Mahamaaya to appear in the womb of Yashoda in Gokul while He Himself would appear as the eighth issue of Devaki. He also told Mahamaaya that He would take birth on the eighth day of the darker phase in the month of Bhaadrapad while she would take birth on the ninth day and that immediately after His birth, Vasudev would himself carry Him to Gokul and leaving me beside Yashoda, he would carry her back to Mathura. ", "next": "3.5.4", "prev": "3.5.2", "title": "Incarnation of Lord Krshna"}