{"index": "3.5.4", "image": "resized_images/Appearance of Lord in Devaki’s Womb.png", "text": [" As per the dictate of Lord Vishnu, Yogamaaya implanted six foetuses in the womb of Devaki.", " All the six children were killed by Kansa immediately after their birth.", " Yogamaaya transplanted the seventh issue of Devaki into the womb of Rohini who was residing at that time in Gokul.", " Then Lord Himself appeared as the eighth issue of Devaki.", " Since the time of His arrival, radiance of Devaki increased manifold.", " At the same time, Yogamaaya also appeared as an issue of Yashoda in Gokul.", " Seeing the arrival of Lord Himself as the eighth issue of Devaki, the gods prayed Him with devotion.", " Then on the eighth day in the darker phase of Bhaadrapad, Lord took birth.", " At the time of His birth, the wind suspended its motion.", " The reverse attained extremely purified state whereas dense clouds gathered in the sky and caused drizzling.", " Seeing the child born with auspicious Swastik mark on his chest, Vasudev recognised Him and prayed Him.", " At the same time, he and Devaki also feared that Kansa would kill their eighth son also.", " So, they prayed the Lord to hide His divine appearance.", " Lord assured them that their ordeals would end soon.", " Then Vasudev put the child in a winnower and started his journey on foot to Gokul carrying the winnower on his head.", " Because of the influence of Yogamaaya, all the guards fell asleep while the gates of the prison opened automatically.", " It was raining heavily at that time.", " So when Vasudev reached in the open, Sheshnag spread its hood over him to shade the Lord from rain.", " In Gokul, Nand’s wife Yashoda too gave birth to a girl child but because of Yogamaaya’s influence she did not know anything about the birth.", " Vasudev arrived there and putting Lord beside the sleeping Yashoda, he took her baby and returned to his prison in Mathura.", " As soon as the baby reached in the prison, she began to cry loudly.", " Her cries awakened the guards who ran to inform Kansa about the child’s birth.", " Kansa at once arrived there and snatching the baby from Devaki’s lap, he dashed her on the wall.", " But before he could throw the baby, she slipped from his grip and taking eight armed Jagdamba’s appearance, established in the air.", " Laughing loudly then, mother Jagdamba said- \"O Kansa! You cannot kill me.", " Your killer has taken birth.", " Lord Hari had been your death in your previous births.", " In this birth also He will kill you.", " So from now on, make efforts for your benefit only.", " Saying this Jagdamba vanished.", " Worried by the words of Yogamaaya, Kansa called a meeting of his prominent demons and said -\"These evil gods have hatched a conspiracy to kill me.", " But being a brave man, I do not take these gods into account.", " You have yourself witnessed how Indra fled before the shower of my arrows.", " You would also remember how the clouds rained heavily in my kingdom when Indra had forbidden them from raining on a kingdom and I had pierced them with my arrows.", " All the things on earth except my father-in-law Jarasandh bow before me in fear.", " I don’t care for the gods.", " Even their efforts to kill me make me laugh.", " But still I must not take the word of Jagdamba lightly that my killer had taken birth.", " We should therefore kill all the children who have taken birth within the past few days.", "\" Instructing the demons Kansa approached Vasudev and Devaki in the prison and released them apologising his cruel action in the way of killing their innocent children. "], "next": "3.5.5", "prev": "3.5.3", "title": "Appearance of Lord in Devaki’s Womb"}