{"index": "3.5.6", "image": "resized_images/The Sages Curse Yaduvanshis.png", "text": " Parashar said: \"As the time passed, Yaduvanshis grew stronger and more influential. Now no longer did they like the welcoming and treating of the great sages by the Lord. Lord Krishna knew about their disliking, but secretly He was pleased by this change in Yaduvanshi's behaviour, for He knew that by disregarding the saints and the scriptures, they would meet their end sooner. Once the Yaduvanshis clothed Jambvati's son Samb in a woman's attire and, showing him to the sages asked mockingly: \"Maharaja, this is our sister-in-law. She is an expecting mother. She feels shy to ask but tell us what will be born to her? Through their unfailing vision, the Sages knew the reality and said: \"Fools, a pestle shall be born to her and that pestle shall exterminate the entire Yaduvansha. Now all the Yaduvanshis were perplexed by sages' prediction, and approached their king Ugrasen. But, even the king was helpless now because he could not change the words the pious sages. In due course, a pestle was born to Samb. Frightened of an imminent fate, Yaduvanshis crushed the pestle into a fine powder and threw it into the sea. Only a nail remained, that also was thrown into the sea where a fish swallowed it. A fisher caught the fish and cut it open and found the nail. He gave it to a hunter. The hunter fixed the nail in the head of his arrow. On the other hand, the sea waves washed the powder of the pestle ashore where it germinated and grew as luxuriant grasses. Later on, once all the Yaduvanshis assembled at the seashore for a picnic where they drank wine and began to fight with one another under intoxication. Soon their quarrel grew so high that they pulled out the grasses, which were growing there, to use as the arms. With the grasses the Yaduvanshis beat one another to death. NARAD PREACHES VASUDEV ABOUT BHAGAWAT Once Narad arrived in Dwarka. Vasudev prayed him and requested to provide him with pious company of Bhagwat Dharma. Narad said: \"O king, once upon a time, nine great sages arrived in the court of the king Janak. King Janak had put the same curiosity before them also. I will narrate the conversation that followed there between the sages and the king.\" First of all, the first Yogishwar Kavi said: \"O king Janak, dedication is the first duty (Dharma) of a Vaishnav. He should devote everything - his actions, fruits of actions and even himself, at the feet of Lord. He ought to hear about Lord's virtues. Such a devotee shall be indifferent to the worldly affairs and shall laugh, dance or sing occasionally and sanctified all the three worlds.\" The king then asked about the characteristics of the Lord's devotees. Another Yogeshwara Hari said: \"A true devotee of the Lord remains unaffected by feelings like hunger, thirst, life, death, labour, pain, fear and desire. Such a devotee is the excellent kind of Bhagwat. Even the wealth of all the three worlds cannot shake the faith of such a devotee, because Lord Shri Hari himself stays in his heart.\" \"What is illusion?\" A Yogeshwara Antariksh replied: \"King, an illusion is also God's play. Having a possessive feeling about mundane is illusion. Thinking in terms of 'I', 'Me', 'Mine', 'My', 'You', 'Your' is also illusion. If one can have such an affection for God as he has for worldly things, one can easily surmount the illusion.\" King Janak then asked about the method of worshipping Lord. A Yogeshwara, Karbhajan said: \" O king, the Lord had a fair complexion in Satayug. People used to receive Him through methods like meditation, reconciliation, etc. In Tretayug, the Lord had reddish complexion and Yagyas were the main means to achieve Him. In Dwaparyug, the Lord had yellowish complexion and He could be pleased through worships. In the present Kaliyuga, Lord has dark complexion and one can receive Him through means like recitation, narration and hearing of His name and plays. Thus, Narad preached Vasudev about Bhagwat Dharma. Now the heart and mind of Vasudev were thoroughly clean and pure. LORD DEPARTS TO HIS ABODE AND DESTRUCTION OF YADUVANSHIS To remind the Lord about the moment of His departure, Brahma arrived in Dwarka accompanied by all the gods. He prayed to Him: \"O Lord, you have completed your duty of what we had once requested you. Now, You please return to your abode. Lord said: \"On the seventh day from now, Dwarka shall submerge in the sea and Yadavas shall fight among themselves to death. I too shall depart then. The arrow of a hunter shall be the cause of my departure.\" When Uddhav learned that Lord was about to wind up His plays, he approached Him and said: \"I understand, O Lord, that this all is happening by your wish. But I cannot part for a moment from your feet. Hence, take me also with you to your abode.\" Lord said: \"Uddhav, I will not go anywhere. My entire brilliance will be present in Shrimad Bhagwat. You stay here preaching Bhagwat Dharma.\" Saying thus, lord preached Uddhav about the Geeta Gyana through the tale of Avadhoot. Lord narrated thus: \"Uddhav, Once, our ancestor Yadu happened to see Lord Dattatreya in a forest. Lord was indulged in the supreme joy in the guise of Avadhoot. Yadu asked him about the reasons for his whimsical state.\" Avadhoot had said: \"O king, making the various animals, birds, insects etc as my teacher, I have learned about spirituality from them. That is why I am free from mourning and attachment. Earth, air, sky, water, fire, the moon the sun, pigeon, python, sea, grasshopper, bumblebee, honey bee, elephant, extractor of honey, deer, fish, prostitute, osprey, boy, girls, arrow-maker, snake, spider and wasp are all my teachers. I took refuge at these twenty-four teachers and learned from their behaviour. I learned forgiveness from earth, purity from the sky, holiness and cleanliness from the water, innocence and renunciation from the fire; indifferentness from the air, to remain unaffected by circumstances from moon, abdication from the Sun, incoherence from the pigeon, dependence upon fate and remain effortless from the python, to remain always happy and serious from the sea, to be under the control of sense organs and hence meet total destruction from the grasshopper, acquiring of virtues from bumblebee, fault in cumulating from honey bee, to abstain sensuous talks from the Deer, to eliminate greed from the fish, sorrow in hope and happiness in desperation from the prostitute, to feel happy in uncertainty from osprey, dispute among many from the girls, concentration from the arrow-maker, to roam alone and detachment from a particular place from the snake, virtues of the creator Lord from the spider, and I learned similarity from the wasp.\" In the guise of Avadhoot, Lord Dattatreya says: \"O king, I learned wisdom and apathy from my body also, because life, death, life and death again are inseparably intertwined with it. Hence the net result of loving this body is nothing but sorrow. Thus our own body also helps us to learn about metaphysical knowledge. Lord Krishna also explained Uddhav regarding futility of physical and heavenly luxuries. This human body is like a tree, on which two birds - Jeevatma and Paramatma (microcosm and supreme soul) - have taken shelter. Two fruits - happiness and sorrow - appear on it. Jeevatma (microcosm) eats these fruits while Paramatma (supreme soul) stays as an indifferent onlooker. There are three kinds of Jeev - Baddh (Bound), Bhakt (devotee) and Mukt (liberated). Baddh Jeevas (bound souls) are those who indulge in sensual pleasures and those who dislike pious company. Mukt Jeev (liberated souls) are those who are free from attachment and bindings. Bhakt (devotees) are those who meditate on me and dedicate their everything in my feet and have love for my virtues. My devotee is kind, free from flaws, tolerant, has feeling of fraternity for all and controls his desires. BHIKSHU GEET Lord said: \"Uddhav, in the world, there is indeed a dearth of such tolerant people who can tolerate bitter remarks of evil ones. In this context there is a tale of a greedy Brahmin who lived in Ujjain. That Brahmin had been badly tormented by the evil people after he had lost his wealth. But still the Brahmin did not lose his patience and regarding his present state as a result of his previous birth's deeds, he expressed his feelings thus: These people are not the cause of my miseries; neither the gods, nor body, even planets and time, can be blamed for my miseries. Scriptures and learned ones held the mind itself guilty of one's miseries. It is the mind that runs the cycle of the world and makes every kind of efforts. In the absence of mind, even the soul is rendered motionless. When one accepts the dictates of the mind and indulges in sensual pleasures, soul too comes to be bound with them. The ultimate outcome of all the spiritual efforts like celibacy, study of Vedas etc. and abidance to pious actions is the concentration of mind. Concentration of mind and is abstaintation from sensual pleasures are the primary conditions for attainment of Paramyoga (supreme meditation). Thus Lord preached Uddhav about Gyana Geeta. Uddhav too took Bhagwat (which is a form of the Lord) with honour and departed for Badrikashrama. ", "next": "3.6", "prev": "3.5.5", "title": "The Sages Curse Yaduvanshis"}