{"index": "3.5.2", "image": "resized_images/Description of Kuruvansh.png", "text": " In the lineage of Kuru, there occurred a King Prateep.\n He had three sons- Devapi, Shantanu and Vaahlik.\n Devapi had taken an abode in the forest in his childhood.\n Hence Shantanu came to become a king after their father Prateep.\n Once in the kingdom of King Shantanu, there was no rainfall for twelve years at length.\n Perplexed by the continuous drought-like situation, Shantanu consulted learned Brahmins.\n Brahmins informed him that he had no genuine right on the kingdom, which in fact belonged to his brother Devapi.\n They also told him that as long as Devapi was not fallen from his supreme position, the drought would continue.\n Alternatively, handing over the kingdom to Devapi might also result in the end of the drought.\n Then Shantanu’s minister Ashmasari appointed certain Brahmins who always spoke in anti-Vedas ways.\n Their continuous preaching disinclined Devapi’s mind from Vedas.\n On the other hand one day, King Shantanu proceeded towards the forest along with Brahmins and his courtiers to hand over the kingdom to Devapi.\n There the Brahmins tried to convince Devapi to accept the onus of the kingdom.\n They were sighting anecdotes from the Vedas to corroborate their argument.\n But Devapi criticised Vedas and spoke in anti-religious ways.\n At that Brahmins instructed the king to return to the kingdom, as there was no use to convince Devapi.\n They also assured Shantanu that since Devapi had been disinclined from Vedas, he had lost his right to the kingdom and the famine would also come to an end.\n Shantanu’s younger brother Vaahlik had a son Somadutta.\n Bhuri, Bhurishrava and Shalya were the sons of Somadutta.\n In later course Shantanu got married to Ganga and had a son Bheeshma.\n From his second wife Satyavati, Shantanu had two sons- Chitrangad and Vichitraveerya.\n Chitrangad was killed by a Gandharva whereas younger Vichitraveerya was married to the princesses of Kashi, Ambika and Ambalika.\n He was so busy in carnal pleasures with his two wives that soon he contracted tuberculosis and died because of it.\n Despite their indulgence in carnal pleasures, Ambika and Ambalika could not bear a child from Vichitraveerya.\n Hence in order to continue their lineage, Satyavati inspired Ambika and Ambalika to appear naked before Vedavyasa and beget a child.\n Since Ambika closed her eyes while she appeared naked before Vedavyasa, she begot a blind son, Dhritarashtra.\n Similarly, Ambalika grew pale when she appeared naked before Vedavyasa.\n Hence she begot a son Pandu who was congenitally afflicted with jaundice.\n Not satisfied by the outcome, Satyavati once again persuaded Ambika and Ambalika to appear naked before Vedavyasa.\n But the queens sent a maidservant Vinita before Vedavyasa.\n Vinita appeared naked before Vedavyasa without any fear or shyness.\n Hence she begot an extremely wise son Vidur.\n In later course Dhritarashtra got married to Gandhaari, the princess of Kandahar whereas Pandu received two wives Kunti, the daughter of Shoorsen and Madri, the princess of Madra.\n Dhritarashtra had one hundred sons and a daughter Dushala.\n Duryodhan was the eldest among the one hundred sons of Dhritarashtra.\n Pandu on the other hand had five sons among whom Yudhishthir was the eldest.\n All the five sons of Pandu were born with the help of five gods- Dharma, Vaayu, Indra and Ashwini kumars because Pandu was carrying a curse that he would die if he ever tried to copulate.\n Pandu’s five sons- Yudhishthir, Bheema, Arjun, Nakul and Sahadev came to be known as Pandavas.\n Five Pandavas were married to Draupadi, the daughter of Panchal King Drupad.\n From Draupadi each of the Pandavas had a son.\n Their names were Prativindya from Yudhishthir, Shrutsen from Bheema, Shrutkirti from Arjun, Shrutaneek from Nakul and Shrutkarma from Sahadev.\n Besides them Yudhishthir had a son Devak from Yaudheyi.\n From Hidimba, Bheema had a son Ghatotkachch and from Kashi a son Sarvak.\n From Vijaya, Sahadev had a son Suhotra whereas from Renumati, Nakul had a son Nirmitra.\n Arjun was the most prowessive among the Pandavas.\n Apart from Draupadi he had three more wives- Ulupi who belonged to the Nagas, Chitrangada, the princess of Manipur and Subhadra, the sister of Lord Krishna.\n From these three wives Arjun had three sons-Iravaan from Ulupi, Vabhruvaahan from Chitrangada and Abhimanyu from Subhadra.\n In the battle of Mahabharat all these sons of the Pandavas fought valiantly and sacrificed their lives.\n It was Abhimanyu’s son Parikshit who continued the lineage of Pandavas and ruled the earth till right now. ", "next": "3.5.3", "prev": "3.5.1", "title": "Description of Kuruvansh"}