{"index": "3.5.1", "image": "resized_images/Puruvansh.png", "text": [" The lineage of Puru grew as Puru- Janmejaya- Prachinvaan- Praveer- Manasyu- Abhayad- Sudayu- Bahugat- Sanyati- Ahamyaati- Raudraashva.", " Raudraashva had ten sons among whom Riteshu was the most prominent.", " Riteshu had three sons among whom Apratirath was most prominent.", " Lineage of Apratirath is as follows- Apratirath- Aileen- Dushyant and Bharat.", " King Dushyant had fallen in love with Shakuntala, the daughter of sage Vishwamitra and elf Menaka.", " They got married secretly in the forest and after a few days, King Dushyant returned to his kingdom promising Shakuntala that he would call her as soon as he reached his palace.", " He had given Shakuntala his ring as a memento.", " But while Shakuntala was crossing the river on her way to the palace, the ring slipped from her finger and was swallowed by a fish.", " In the absence of the ring, King Dushyant refused to identify Shakuntala.", " So, she returned to the hermitage of sage Vishwamitra and gave birth to a child who later on became famous as Bharat.", " Bharat had been very prowessive since his childhood.", " His first meeting with King Dushyant was also very dramatical.", " It is said that once King Dushyant was hunting in the forest and he saw a boy who was counting the teeth of a lion.", " Impressed by the bravery of the boy, the king enquired about his parentage and reached the hermitage where sage Vishwamitra narrated him the whole story.", " Meanwhile a fisherman had also recovered the ring from the fish and handed it to the king who had thus recalled the whole story.", " In the hermitage, King Dushyant came to see Shakuntala and he candidly accepted her and his son Bharat.", " Bharat had three queens and nine children.", " Since none of the children resembled him in features, he expressed his doubts about their paternity.", " Fearing the wrath of Bharat, his queens killed all the children.", " Then with a desire to have a son, Bharat organised a Marutsoma Yagya.", " As a result he got Bharadwaj as his son.", " Bharadwaj’s second name was Vitath.", " His lineage grew as follows- Vitath- Manyu.", " Manyu had many sons like Brihatkshatra, Mahaveer, Nara, Garg etc.", " Their lineage grew as follows Nara- Sanskriti- Gurupreeti and Rantidev.", " Garg had a son Shini who became famous as Gaargya and Shainya also.", " Mahaveer lineage is as follows- Durukshay- Trayyaruni- Pushkarinya and Kapi.", " In the lineage of Brihatkshatra occurred a king Hasti who founded the city of Hastinapur.", " Hasti had three sons- Ajmirh- Dwijmirh and Purumirh.", " Among the sons of Ajmirh were included Panchals and a daughter Ahilya.", " Ahilya was married to sage Gautam.", " They had a son Shatanand.", " Satyaghriti was the son of Shatanand.", " Once Satyaghriti happened to sight the extremely amorous and beautiful elf Urvashi.", " Her mere sight was enough to cause the ejaculation of his semen, which fell on a reed and divided into two parts.", " From these two parts were born a boy Krip and a girl Kripi.", " King Shantanu discovered Krip and Kripi in the forest and brought them to his palace.", " In later course, Kripi was married to Dronacharya, the teacher of Kauravas and Pandavas.", " Ashwatthama was the son of Dronacharya.", " One of the king named Kuru in the lineage of Ajmirh established the sacred region of Kurukshetra. "], "next": "3.5.2", "prev": "3.5", "title": "Puruvansh"}