{"index": "3.6.1", "image": "resized_images/Descriptions of Dynasties in Kali-Yuga.png", "text": [" Parashar describes about the dynasties that would occur in Kaliyug.", " Ripunjay or Puranjay would be the last king of Brihdrath dynasty.", " The kings of Nand dynasty would succeed this dynasty.", " Then a diplomat Brahmin, named Chanakya, would exterminate this dynasty and enthrone Chandragupta Maurya.", " In Maurya dynasty, a great king would occur by the name of Ashokvardhan.", " After him, Yavans would rule then for six hundred and forty years.", " Their rule would be succeeded by the governance of the fair-complexioned foreigners, who would rule for one hundred and sixty years.", " Thereafter, there would be no king and no subjects because people from all the classes would come forward to rule.", " The ruler would be selected by the majority votes.", " There would be no any thing like holiness.", " Cows would grow thin like nannies.", " People would not marry, as per their castes.", " Greed, selfishness and sex would be the base of marriage life.", " In adverse conditions, spouses would desert each other.", " There would be nothing like duty, responsibility and conduct.", " Hair would be the main item of adornment for the women.", " People would not have the knowledge of religious scriptures in Kaliyug.", " Talkativeness would be identified with knowledge.", " Only those would be regarded as clever, who could pick others' pockets.", " Children would not regard or pay due respect to their parents.", " Children would maintain relations with parents till their marriage only, not after that.", " Boys would not touch the feet of their own parents, but would pay full respect to their father and mother-in-law, Brother-in- law would be dearer to them than their own brother.", " Parashar says:", " Kaliyug is the mine of faults, but it has only one great virtue - that the people will acquire divine position only by reciting Lord's name.", " Recitation of Lord's name, regardless of intention and motivation-- whether it is love, derision, laziness or maliceness- would destroy one's sins.", " But the sinister people would do even the most difficult tasks in Kaliyug, but they would not recite Lord's name.", " They would not have an interest in the Lord.", " Their interests would be more in sensuous things like sound, touch, beauty, scent etc.", " The Paramgati (supreme salvation) that people could receive by ten thousand years of meditation in Satayug;", " by performing Yagya for hundred years in Tretayug and by worshipping Lord’s idol for ten years in Dwapar, that supreme salvation is easily available for people in Kaliyug simply by reciting Lord's name for one day and one night continuously.", " But still, in Kaliyug people would not have faith in Lord's name. It is their misfortune. "], "next": "4", "prev": "3.6", "title": "Descriptions of Dynasties in Kali-Yuga"}