{"index": "3", "image": "resized_images/VISHNU PURANA.png", "text": " This Purana has 6 Chapters (6 Parts) as follows:\n Part 1:\n Describes the creation of the universe, birth of the gods and the demons, Pralaya, churning of the sea, tales of the devotee Dhruva;\n killing of Hiranyakashipu etc.\n Part 2:\n Contains the description of Priyavrata’s sons and Bharat dynasty.\n It also has a geographical description of Jambu dweep, Bharat varsh, Shatdweep, Patal (the hades), the sun and the planets, chariot of the sun, origin of the Ganges etc.\n Part 3:\n Contains a detailed description of Manavantaras, Kalpa, Veda Vyasa, religion and the caste system etc.\n It also has a description of the origin of Buddhism.\n Part 4:\n Origin of Brahmanand Daksha etc.\n Birth of Pururava, marriage of Balarama with Revati.\n Birth of Ikshavaku.\n Kukutstha dynasty.\n Tale of Yuvanashva and Saubhari.\n Sarpvinasha mantra.\n A Narayana dynasty, Birth of Sagar.\n Ashwamedha by Sagar.\n Descendence of the Ganges through the penance of Bhagirath.\n Birth of Lord Rama.\n Yagya of Vishwamitra, birth of Sita, tales of Chandra dynasty.\n Abduction of Tara, Origin of Agnitrayo, birth of Dhanvantri and his clan.\n Wars with the demons, clan of Nahush, tale of Yayati, Yadu dynasty.\n Birth of Kartveerya Arjun.\n Tales of Krishna’s birth, marriage of Krishna with Jambvanti and Satyabhama.\n Salvation of Shishupaal.\n Over population of Yaduvanshis.\n Birth of Karna and his find him by Adhirath.\n Janamejaya dynasty and origin of Bharat.\n Clans of Jahnu and Pandu.\n Clan of Parikshit and royal dynasties of the future.\n Future generation of Ikshvaku dynasty.\n Future generation of Brihad dynasty.\n Future generations of Pradyot dynasty.\n Kingdom of Nand.\n Advent of Kali Yuga and description of royal dynasties of Kali Yuga.\n Part 5:\n Marriage of Vasudev and Devaki.\n Incarnation of Lord Vishnu to kill Kansa.\n Arrival of Yagmaya in Yashoda womb and of the Lord in Devaki’s womb.\n Birth of Lord Krishna, carrying of Krishna to Gokul, Dialogue of Mahamaya with Kansa, acquiring of defensive stance by Kansa.\n Releasing of Vasudeva and Devaki.\n Killing of Putana.\n Killing of Shakat.\n Naming of Krishna and Balarama.\n Humiliation of Kaliya.\n Killing of Dhenukasura, killing of Pralamb, description of festival devoted to Indra, worshipping of Govardhana, arrival of Indra, killing of Arishtakasura.\n Arrival of Narad in Kansa’s court.\n Killing of Keshi, Arrival of Akrur in Vrindavana.\n Arrival of Lord Krishna in Mathura.\n Lord Krishna’s mercy on Kubja.\n Arrival of Lord Krishna in amphi-theatre and killing of Kansa.\n Coronation of Ugrasena, bringing of Sudharma in Mathura, defeat of Jarasandha, birth of Kalayavan, killing of Kalayavan.\n Vrindavan tour by Balarama, getting of Varuni by Balarama.\n Abduction of Rukmani, abduction of Pradyumna, getting of Pradyumna by Mayavati, killing of Shambar by Pradyumna, killing of Rukmi by Balarama, getting of sixteen thousand queens by Lord Krishna.\n Abduction of Parijat.\n Fight with Indra.\n Begging for pardon by Indra.\n Migration to Dwarka, bow battle.\n Telling of dream by Usha, abduction of Aniruddha, fight with Lord Shiva, amputation of Bana by Lord Krishna, killing of Kashiraj Paundraka.\n Putting of Varanasi on flames.\n Abduction of Lakshmana.\n Presentation of Samb before the sages as an expecting mother.\n Origin of pestle.\n Destruction of Yadu vansha.\n Ascendence of Lord Krishna to heaven, beginning of Kali Yuga, preaching of Arjun by Vyasa.\n Coronation of Parikshit.\n Part 6:\n Description of religion in Kali Yuga.\n Description of the importance of Kali Yuga, Shudra and women folk by Vyasa.\n Description of Kalpa.\n Description of a day of Brahma.\n Position of Brahma in Pralaya.\n Natural disasters.\n Different kinds of sorrows.\n Torturing in hell.\n Awakening of Brahma, Preaching of Yoga.\n Tale of Keshidhwaja.\n Killing of the religion and the cow.\n Holding of counsel by Khandikya.\n Self knoweldge.\n Ridicules of body-spiritualism.\n Querries of Yoga.\n Brahmagyana (Vedas).\n Concepts of tangible-intangible appearances of God.\n Salvation of Khandikya and Keshidhwaja.\n Excellence of Vishnu Purana. Virtues of Lord Vishnu’s names. Results of hearing Lord’s name. ", "next": "3.1", "prev": "2.5.23", "title": "VISHNU PURANA"}