{"index": "4.1.7", "image": "resized_images/Shiva tests Parvati’s Devotion.png", "text": " After reaching there, Lord Shiva found Parvati engrossed in her penance.\n Parvati was surrounded by her few trusted companions.\nLord Shiva decided to test Parvati's devotion towards him.\n So he disguised himself as a hermit and asked her companions about the reason why Parvati was doing such a severe Penance.\n Jaya, one of Parvati's companions informed him that her friend was doing penance in order to get Lord Shiva as her husband.\n Jaya also informed Lord Shiva that her friend Girija was the daughter of Himalaya.\n Lord Shiva, who was in the guise of a hermit said---'Why is this tender girl so eager to marry Shiva who is an embodiment of inauspiciousness--who carries a skull in his hand and who lives in a crematorium.\n How can your friend think of marrying one who has been expelled by Daksha from the yagya ceremony?\n Does your friend know that Shiva wears a snake around his neck and is surrounded by numerous spirits and ghosts?\n' Parvati, who had been listening to all those nonsensical utterances, told Jaya--- 'This fellow seems to abhor Shiva.\n We should not talk to this evil person.\n Tell him to leave at once.\n'Lord Shiva was extremely pleased by Parvati's unwavering devotion towards him.\n He appeared in his original form and said--'You can ask for anything you wish.\n' But Parvati replied--- 'O Supreme Lord! I am the same Sati for the sake of whom you had destroyed Daksha's yagya.\n Don't you recognize me?\n There is a great purpose behind my reincarnation.\n A son born to us would kill Tarakasur.\n So go to my father and request for my hand in marriage.\n'But Lord Shiva refused to make a request to Himalaya considering it as an undignified act.\n He then returned to the place where he had been meditating.\nAfter a while, Himalaya and Mena arrived there and asked Parvati how her penance had been progressing.\n Parvati narrated the whole incident how Lord Shiva had finally given his conscent to marry her.\nHimalaya and Mena were extremely pleased by this good news. ", "next": "4.1.8", "prev": "4.1.6", "title": "Shiva tests Parvati’s Devotion"}