{"index": "4.1.18", "image": "resized_images/Execution of Shumbh, Nishumbh and Mahishasur.png", "text": " The demons named Shumbh and Nishumbh had received boons from Brahma according to which no deity, demon or Man could kill him.\n Shumbh and Nishumbh became excessively arrogant and started tormenting the deities.\n All the deities including Lord Vishnu went to Lord Shiva and requested for his help.\n Lord Shiva assured them that both the demons would be killed at the opportune time.\n The deities were satisfied and returned back to their respective abodes.\nParvati was of dark complexion.\n She thought that Shiva would be more affectionate towards her if she somehow discarded her dark skin.\n She eventually discarded her dark skin at a place and it instantly got transformed into 'Kali Kaushiki'.\n She then did an austere penance at Vindhyachal mountain.\n At that time, Shumbh and Nishumbh lived there.\n When both the demons saw goddess Kali Kaushiki her divine beauty infatuated them.\n But Goddess Kali Kaushiki ultimately killed both of them.\n Having accomplished her mission, Kali Kaushiki did a tremendous penance at 'Gauri-peak' and regained her fair complexion.\n In course of time she became the mother of Ganesh and Kartikeya.\n Once, goddess Parvati went to Arunachal mountain where Sage Gautam was doing penance.\n She was so enchanted by the scenery over there that she decided to do penance.\n She instructed goddess Durga to stand guard till she accomplished her penance.\n She also ordered the two goddesses Subhaga and Dhundhukumari to keep a watch in all directions.\n Mahishasur--the demon sent a female messenger to convince Parvati into marrying him.\n The female messenger disguised herself as a female hermit and tried to impress all the three goddess who were keeping surveillance by praising the glory of Mahishasur-- 'O beautiful ladies! Why is your mistress living in such a secluded place?\n She is worthy of living in a royal palace.\n There is nobody among the deities who is fit enough to marry her.\n But, Mahishasur--the lord of all the three worlds is certainly fit to become her husband.\n'But all the three goddesses drove the female messenger away.\n Ultimately, Mahishasur came accompanied by a large army to forcibly abduct goddess Parvati.\n The commotion caused by the demons disturbed Parvati's meditation.\n She instructed Durga to kill all the demons.\nGoddess Durga transformed her appearance.\n Now she looked ferocious in her new appearance.\n She was well equipped with all sort of lethal weapons and was mounted on a lion.\n She thundered loudly and challenged Mahishasur.\n Countless 'yoginis' manifested from her body.\n These yoginis attacked Mahishasur's army and killed many demons.\n The whole battlefield was splashed with blood.\n Goddess Chamunda (Durga) severed the heads of 'Chand' and 'Mund' with her chakra.\n Mahishasur was enraged and he attacked goddess Durga.\n Some other demons like Prachanda, Chamar, Mahamauli, Mahahanu, Ugravaktra, Vikataksha and Dahan also came forward to help him but each one of them was killed by goddess Durga.\nNow, Mahishasur's anger crossed all limits and he menacingly ran towards goddess Durga.\n A severe battle was fought between both of them.\n When Mahishasur realized that the goddess was dominating the battle, he started changing his guises frequently.\n He tried to dodge goddess Durga by transforming his appearance into that of a boar.\n But, goddess Durga kept on chasing him.\n Then, Mahishasur became a lion.\n This way he kept on changing his appearances frequently to avoid getting killed by goddess Durga.\n Once he transformed himself into a buffalo but goddess Durga attacked him.\n This way, Mahishasur was forced to change his appearance frequently on account of relentless attack by goddess Durga.\n Ultimately Durga killed him.\n Goddess Durga picked up his severed head and danced in joy.\n The deities were relieved at the death of Mahishasur. ", "next": "4.1.19", "prev": "4.1.17", "title": "Execution of Shumbh, Nishumbh and Mahishasur"}