{"index": "4.1.9", "image": "resized_images/Birth of Kartikeya.png", "text": [" Lord Shiva and Parvati lived happily at Gandhamadan Mountain enjoying every bit of their conjugal life.", " Once it so happened that a small quantity of Shiva's sperm fell on the ground while he was enjoying intimate moments with Parvati.", " As a result, tremendous amount of heat was generated and the whole world started burning.", "Lord Brahma and Lord Vishnu instructed Agni to employ some means so that the destruction caused by Shiva's over flowing sperms could come to an end.", "Agni went to Gandhamadan mountain in the guise of a hermit.", " He requested Parvati by saying---'O Mother! Please give me something as alms.", " I have nothing but my hands as a begging bowl' Parvati kept Shiva's sperms on his palm, which was eaten up by Agni.", " Parvati was enraged to see this and cursed Agni--\"You have shown disrespect to me.", " From today onwards you would become omnivorous.", " The sperms which you have devoured would cause unbearable inflammation in your body.", "\" As the result of Parvati's curse, Agni really started experiencing unbearable inflammation in his body.", " He requested Lord Shiva to reveal the means by which his pain would come to an end.", " Lord Shiva instructed Agni to implant those sperms in any woman's womb to get rid of the unbearable inflammation.", "Thus, Agni, who was suffering from extreme heat that generated in his body, sat at a lonely place waiting eagerly for a woman to arrive there.", "He did not have to wait for too long, as six Kritikas, shivering with cold arrived there to warm themselves.", " The sperms of Shiva entered into their bodies through the pores.", " These six Kritikas became pregnant.", " When their respective husbands learnt about their pregnancy they cursed them.", " As a result they got transformed into 'Nakshatras' and established themselves in the sky.", " But, they aborted their respective foetus at Himalaya mountain before getting transformed into six constellations.", " The holy Ganges carried that foetus to a secluded place, which was covered with dense bushes of reeds.", "In course of time, Lord Kartikeya manifested from those reed bushes.", " He had six heads.", " The deities were delighted at the birth of Kartikeya.", " Lord Shiva along with Parvati went to the place where Kartikeya had incarnated.", " Parvati took young Kartikeya in her embrace. "], "next": "4.1.10", "prev": "4.1.8", "title": "Birth of Kartikeya"}