{"index": "4.1.4", "image": "resized_images/Churning of the Ocean.png", "text": " Sage Lomesh narrated the tale, which described how Indra lost heaven after he showed disrespect to Vrihaspati-- Once, Indra was enjoying the songs sung by Gandharvas when sage Vashishth arrived.\n But, Indra was so engrossed in music, that he forgot to welcome his distinguished guest.\n Sage Vashishth was enraged by his behaviour and went away fuming with anger.\nWhen the demon King Bali--the lord of Patalloka, learnt about this incident he attacked Indraloka with a large army.\n A fierce battle took place in which all the deities were defeated.\n Bali and his army brought all the wealth to Patalloka.\n But the demons were not destined to be the owner of this plundered wealth for too long as the whole wealth got submerged into the ocean.\n Bali was surprised and asked Shukracharya about the reason.\n Sage Shukracharya revealed to Bali that he could not enjoy the splendours of deities' wealth because he had not performed 100 Ashwamedha yagyas.\n The deities, after being defeated went to seek Lord Vishnu's help.\n Lord Brahma was also present with them.\n After giving a deep thought to the whole issue, Lord Vishnu advised them to patch up with the demons so that all the wealth could be retrieved from the ocean bed.\nThe deities went to Patal-loka and convinced the demons to participate in the churning of the ocean.\n When the process of churning of the ocean began, Mandarachal mountain was used as a churner and the serpent -Vasuki as the rope.\nBoth the parties immersed the Mandarachal mountain into the ocean but it sank down, as there was no base upon which it could be placed.\n So, Lord Vishnu took the form of a tortoise and held the mountain on his back.\n Churning of the ocean resulted into the emergence of many things like Chandrama, Surabhi (cow), Kalpa tree, Kaustubh, Uchchaihshrava (Horse), Eravat (elephant), goddess Laxmi, poison, ambrosia, intoxication etc.\nWhen poison emerged from the sea bed, neither the deities nor the demons made any claim for it.\n The poison was so venomous that the whole world started getting inflamed by it.\n Lord Shiva then drank the Halahal poison and thus the world was saved.\nLord Vishnu accepted goddess Laxmi as his consort. ", "next": "4.1.5", "prev": "4.1.3", "title": "Churning of the Ocean"}