{"index": "4.1.14", "image": "resized_images/Kaalbhiti’s Austere Penance.png", "text": [" There is an amazing tale related with the birth of Kaalbhiti.", " During ancient times there lived a sonless brahmin named Manti in Kashi.", " He did an austere penance to get a son.", " At last, lord Shiva became pleased by his devotion and appeared.", " Lord Shiva said--'You will be blessed with an enlightened son who would liberate your whole clan.", "' In course of time Manti's wife became pregnant but amazingly did not deliver a baby even after a long time.", " Four years passed like this but Manti's wife did not deliver the child.", " Manti was perplexed by this unusual event so he asked the baby, who was still in his mother's womb as to why he was hesitant to come out.", "The child replied that he feared 'Kaal' and this was the reason why he was not taking birth.", " The child said--'If you can assure me of protection from 'Kaal' then I shall certainly take birth.", "' How could have Manti given such an assurance.", " So he took refuge in Lord Shiva.", "Lord Shiva ordered four of his ganas to go and convince the baby.", " The names of these five ganas were Dharma, Gyan, Vairagya Aishwarya and Adharma.", " They assured the baby by saying--'Get rid of your fear.", " We assure you that each four of us (Dharma, Gyan, Vairagya and Aishwarya) will never abandon you.", "\" The fifth gana named Adharma on the contrary promised not to caste his evil Shadow on the baby.", " These assurances were enough for the baby to come out from the womb.", " But, even after taking birth the child was trembling and wailing in fear.", "The ganas said--Manti! Your child is still fearful of the Kaal.", " He is trembling and crying inspite of the best of our efforts to drive away is fears.", " So he will become famous as Kaalbhiti (one who is fearful of Kaal).", " Kaalbhiti grew up to be a virtuous person.", " He used to engage himself in various kinds of austerities.", " He was a great devotee of Lord Shiva.", "One day, as Kaalbhiti was meditating under a 'bael' tree (wood apple), he went into his trance.", " The joy experienced during trance period was something, which he had never experienced before.", " He decided to regularly meditate under that tree.", " He did penance for one hundred years standing on his toe.", "Lord Shiva became pleased by his devotion and appeared in the guise of a human being.", " Lord Shiva said--'O Great soul Please discontinue with your penance.", " I have brought some water for you! Please quench your thirst!' But Kaalbhiti refused to take water from an unknown person.", " He requested Lord Shiva to reveal his identity.", " Kaalbhiti also inquired Lord Shiva about his religion and conduct.", " Lord Shiva told him that he was beyond any religion or conduct.", "When Kaalbhiti refused to have water, Lord Shiva dug up a large pit and emptied the pot into it.", " After that he disappeared.", "Kaalbheeti stood fixed at that place, being stunned by the disappearance of Lord Shiva.", " Suddenly, an effulgent Shivalinga appeared under that bael (wood apple) tree.", " Kaalbheeti worshipped that shiva-linga which was radiating light in all directions.", "Now, lord Shiva appeared and blessed Kaalbheeti to become free from the fear of Kaal(Death).", " From that day onwards the Shivalinga situated there became famous as Mahakaal.", " Before disappearing once again, Lord Shiva instructed Kaalbheeti to preach Sage Karandham who was expected to visit him shortly.", " Kaalbheeti himself became renowned as Mahakaal because he had been successful in conquering death. "], "next": "4.1.15", "prev": "4.1.13", "title": "Kaalbhiti’s Austere Penance"}