{"index": "4.1.2", "image": "resized_images/Sati jumps into the Sacrificial Fire.png", "text": [" When Sati reached her father's place, she saw a grand yagya being performed.", " A large number of people had been invited--the deities, the sages and the hermits.", " Sati became sad because Daksha had invited everybody except her husband.", " She knew quite well that it was a deliberate decision on part of her father, not to invite Lord Shiva.", " But, she got infuriated when she found that Daksha had not even kept Shiva's share in the yagya while the 'shares' of other deities had been kept.", " When Daksha saw Sati, he was enraged---How dare you come here?", " Your husband is an embodiment of inauspiciousness.", " He is the Lord of the spirits, ghosts and all types of mean powers.", " This was the reason why I did not invite him.", "' The insult heaped on her husband in front of everybody devastated Sati.", " She felt so humiliated that she decided to give up her life.", " Before any one could understand, she jumped into the sacrificial fire and was charred to death.", " All the deities present there were stunned by this sudden development.", " All the 'Rudraganas' mourned Sati's death with deep sorrow.", "Meanwhile, Lord Shiva got the sad news from Narad.", " He got mad with anger and uprooted some hair from his scalp.", " He then dashed the hair against a mountain.", " There was a thundering sound and Veerbhadra manifested within a split second.", " Lord Shiva ordered him to punish Daksha for his evil deed, which caused the death of Sati.", "Veerbhadra proceeded with a huge army of spirits, ghosts and marudganas to punish Daksha.", " When he reached the oblation site, Daksha and all the other deities became scarred.", " But, Sage Bhrigu came at the deities' rescue and told them not to worry.", " He then chanted few mantras, which helped the deities to win the first round of the battle.", " The defeat of his army enraged Veerbhadra to such an extent that he created havoc in the ranks of deities' army.", " He showered volleys of arrow on them, which forced the deities to make a hasty retreat from there.", " Veerbhadra dashed Sage Bhrigu against the ground and uprooted his beard.", " He then severed the head of Daksha and threw it in flames of sacrificial fire.", "Lord Brahma took the refuge of Lord Shiva and requested him to stop Veerbhadra from causing further death and destruction.", " Lord Shiva told Brahma--'Nobody else but Daksha himself was responsible for his death.", "But, Lord Brahma requested Lord Shiva to make Daksha alive once again.", " Lord Shiva then went to Daksha's place and fixed a goat's head on the trunk of Daksha's body.", " This way Daksha became alive once again albeit with a goats body.", " He was very ashamed of his behaviour and requested Lord Shiva to forgive him.", " Lord Shiva blessed him and said-- \"Salvation can not be attained merely by performing the rituals.", " If you are desirous of salvation then engage yourself in virtuous deeds with.\" "], "next": "4.1.3", "prev": "4.1.1", "title": "Sati jumps into the Sacrificial Fire"}