{"index": "4.1.10", "image": "resized_images/Kartikeya Kills Tarakasur.png", "text": " Lord Shiva assured the deities, who were also present there that Tarakasur's days were numbered.\n The deities's army then proceeded towards the battlefield.\nOn their way, the deities heard a heavenly voice--'You can defeat the demons only if you fight under the leadership of Kartikeya.\n' Now all the deities requested Kartikeya to become their leader.\n Menawhile, Devasena--the daughter of Mrityu arrived there and requested Kartikeya to become her husband.\n Kartikeya accepted Devasena as his wife.\n This is the reason why he is also known as Deva senapati.\nKaritkeya was leading the deities' army, mounted on an elephant.\n The army had all the deities in its rank- Indra, Varun, Vayu, Kuber, Dharma Raj, etc.\nBoth the rival armies met at an island situated between Ganga and Yamuna.\n Tarakasur had come with a large army, which boasted of many brave and mighty warriors.\n The battle commenced and the first phase was dominated by the demons.\n The deities could not stand up to the might of demons.\n Even Indra was severely wounded when Tarakasur attacked him with his deadly weapon- 'Shakti'.\n On seeing the level of destruction caused in the deities' army, King Muchkunda, who was on the side of the deities' attacked Tarakasur.\n In the ensuing battle Muchkunda got injured and fell down on the ground.\n He got up furiously and tried to kill Tarakasur with his Brahmashtra.\n Sage Narad told him that Brahmashtra would be of no use as Tarakasur had been blessed with invincibility against mortals.\n Narad said--'Only Kartikeya is capable of killing Tarakasur.\n So, you all need to have patience till Kartikeya accomplishes his mission.\n' Meanwhile Veerabhadra was fighting a dual bought against Tarakasur.\n He had already caused indescribable losses to the demons.\n While the fight was going on, Tarakasur realized that it was not easy to defeat him.\n So, he decided to use his illusionary powers, which helped him in acquiring ten thousand hands.\n The deities ran away from the battle field, when they saw ferocious Tarakasur approaching them.\nLord Vishnu instructed Kartikeya to kill Tarakasur before it was too late.\n Kartikeya chased Tarakasur with his deadly weapon- Shakti in his hand.\n A fierce fight took place between both of them.\n Kartikeya attacked Tarakasur with his Shakti.\n Tarakasur retaliated by hitting him with his own Shakti.\n The assault was so severe that Karikeya lost his consciousness for few moments.\n When Kartikeya regained his consciousness, he got up quickly to fight against Tarakasur.\n Once again a fierce battle commenced.\n Kartikeya remembered his parents in reverence and released his Shakti in the direction of Tarakasur.\nTarakasur died instantly.\n The deities were delighted at the death of their tormentor. ", "next": "4.1.11", "prev": "4.1.9", "title": "Kartikeya Kills Tarakasur"}