{"index": "4.1.11", "image": "resized_images/Virtues of Observing a Fast on Shiva-Ratri.png", "text": [" Sage Lomesh eulogizes the virtues of Shivaratri in the following words--'The fourteenth day of the dark half of a month is dedicated to the worship of Lord Shiva and is famously known as 'Shivaratri'.", " It destroys all the sins committed by a man.", "Sage Lomesh then narrated a tale, which emphasized the greatness of Shivaratri-- Once upon a time a brahmin widow developed an illicit relationship with a 'Chandal' (a low caste man).", " Later on she gave birth to a son who was named Dussah.", " Her son had all the bad qualities one can think of-- a gambler, a drunker, a thief, a murderer, etc.", " One day, Dussah went to a Shiva temple with the intention of committing robbery.", " It was the festive night of Shivaratri and people had thronged the temple in a large number.", " So, he did not get an opportunity to steal temple property.", " He remained awakened for the whole night waiting for an opportune moment but his wishes remained unfulfilled.", " He spent his time listening to the divine tales of Lord Shiva that was being narrated by the temple priest.", " Though he was a sinner yet he took his next birth in a royal family on account of his two virtuous deeds--he had remained awakened for the whole night of Shivaratri and he had listened to the tales of Shiva.", " In his next birth, he was born to a king named Chitrangad and he himself was named Vichitraveerya.", "Vichitraveerya was a great devotee of Lord Shiva.", " He ultimately united with lord Shiva and manifested as Veerabhadra at the time when Lord Shiva had shaken his head violently after hearing the sad news of Sati's demise.", "There are numerous instances of people attaining salvation by observing a fast on Shivaratri.", " The names of some great devotees to do so are King Bharat, Mandhata, Dhundhumar, Harishchandra etc. "], "next": "4.1.12", "prev": "4.1.10", "title": "Virtues of Observing a Fast on Shiva-Ratri"}