{"index": "4.1.15", "image": "resized_images/Karandham’s Queries.png", "text": " As predicted by Lord Shiva, king Karandham arrived at the place where Mahakaal (Kaalbheeti) was staying.\n First of all he worshipped Lord Mahakaal and subsequently went to meet sage Mahakaal (previously Kaalbheeti).\nKing Karandham had numerous doubts regarding the rituals of Shraddh so he asked Mahakaal--'How does the rituals related to 'tarpan' satisfy the dead ancestors?\n' Mahakaal replied--The souls of dead ancestors are capable of accepting whatever is offered to them.\n Time and distance does not matter to them.\n They accept only the essence of whatever is offered to them and not the gross materials as such.\nKarandham posed his second query--'I think a soul, after it has abandoned the mortal body is bound by its own karma.\n Then, how, can the dead ancestors be expected of giving us blessings and changing our fortunes.\n' Mahakaal replied---Not all Pitras (dead ancestors) are bound by their karma.\n Pitras belonging to different classes like deities, 'asuras' and 'yaksha' are unembodied and formless (amurta).\n Similarly, the dead ancestors of all the four castes are called 'murta Pitras' (with form).\n These seven types of Pitras are considered to be eternal and powerful.\n They also transcend the law of Karma.\n A total number of 31 ganas are subordinate to them.\n The rituals of Shraddh are performed for the pacification of these seven eternal Pitras.\n These seven Pitras are the ones who shower blessings on the performers of Shraddh rituals.\n'Karandham's next question was--'Some people are of the view that one can attain salvation only by taking refuge in Lord Vishnu.\n While some think that only Lord Brahma is capable of giving salvation.\n There are many people who consider Lord Shiva as the supreme liberator.\n What do you have to say on this?\n' Mahakaal replied--'God is one.\n The three deities you have named even they eulogize each other.\n It is nothing but foolishness to grade them as superior, average or inferior.\n The thing, which matters most in the path of salvation, is individual's unflinching faith and devotion.\n Any deity in whom he has total devotion is capable of giving salvation.\nKarandham then requested Mahakaal to describe the appropriate rituals related with the worship of Lord Shiva.\n Mahakaal replied---A devotee who puts on 'tripund' mark on his forehead, chest and both the shoulders while worshipping Lord Shiva is blessed to see the divine appearance of Lord Shiva.\n He should enter the temple premise with a pure heart.\n After entering the temple he should purify the Shiva linga by removing all the unnecessary articles which may be lying there.\n He should then fill up four 'Garuas' (drinking pot with a curved spout) with water.\n Articles like milk, curd clarified butter, honey and Sugarcane juice are kept to the left side of Shiva linga.\nThe devotee should then come out of the temple and worship the 'dwarpalas'.\n After that, deities like Kuldevta, Nandi, Mahakaal Dhata and Vidhata are worshipped.\n Once again he should enter the temple and sit in front of the Shivalinga and meditate on Lord Shiva.\n While performing 'ardhya' he should make offerings of articles like water, akshat, Kusha grass, sandalwood, flowers, mustard seeds, milk, curd and honey.\nHaving offered ardhya, a devotee should perform the ritual of ablution with water, milk, curd, honey, clarified butter, and sugarcane juice in the given order.\n While performing this ritual the devotee should also offer dhupa (incense) and chant 'OM HOOM VISHVAMURTAYE NAMAH'.\n Some other deities whom a devotee must worship along with the worship of Lord Shiva are Ishan, Tatpurush, Sadryojat etc.\n A devotee must also not forget to worship Shiva's trident.\n While doing this he should chant TRISHUL DHANUH KHADGA KAPAL KUTHAREBHYO NAMAH.\n A devotee should conclude his worship by begging for Lord Shiva's forgiveness for any mistake that he might have committed while performing the rituals. ", "next": "4.1.16", "prev": "4.1.14", "title": "Karandham’s Queries"}