{"index": "4.1.6", "image": "resized_images/Lord Brahma’s Boon to Tarakasur.png", "text": " After the death of Sati, Lord Shiva became aloof and engaged himself in an austere penance.\n His lack of interest in performing his duties resulted into the predominance of sin in the world.\nA demon named Tarakasur had received a boon of invincibility from lord Brahma.\n Only a child and nobody else could kill him.\n Tarakasur, being drunk with power started to torment the deities.\n All the deities eulogized Lord Brahma and they heard a heavenly voice saying--- 'Nobody can kill Tarakasur except Shiva's son.\n So you must put all your efforts to help Shiva get married.\n' The deities were aware that after the death of Sati, Shiva had lost all interest in life and was living like a recluse.\n Nevertheless, they wanted to give a try.\n So they went to Himalaya, who had no progeny at that time and requested him to beget a girl.\n Himalaya agreed, as he was aware of the misdeeds of Tarakasur.\nIn course of time, Himalaya's wife, Mena gave birth to a girl child who was in fact the reincarnation of Sati.\n The girl child was named Girija.\nGirija was brought up with great love and care.\n When she attained the age of eight, Himalaya once took her to the cave where Lord Shiva was doing penance.\n Initially, Shiva was little hesitant to meet Himalaya because Girija was accompanying her father and he had vowed never to put his glance on any woman after the death of Sati.\n But, Later on he relented and allowed both of them to meet him whenever they liked.\n Now, Girija made it her habit to visit Lord Shiva regularly.\n She used to look after all the needs of Shiva while he was engrossed in his penance.\n Even after the passage of a long time the deities' wishes did not look like getting fulfilled, as Shiva remained as nonchalant as ever.\n So, the deities requested Kamadeva's help in sowing the seeds of love and passion in Shiva's heart.\nKamadeva went to the place where Lord Shiva was doing his penance.\n He tried to sow seeds of compassion in Shiva's heart only to receive his wrath.\n Lord Shiva was infuriated by the efforts of Kamadeva.\n He opened his third eye as the result of which Kamadeva was charred to death.\nRati started wailing inconsolably at the death of her husband but Girija assured her that she would try to bring Kamadeva back to life.\nGirija commenced her penance to please Lord Shiva.\n There was a great turmoil in the world on account of her penance.\n Lord Vishnu led the deities to Shiva and requested him to marry Girija so that the world could be protected from the torments of Tarakasur.\n Finally, Shiva gave his conscent and went to the place where Girija was doing penance. ", "next": "4.1.7", "prev": "4.1.5", "title": "Lord Brahma’s Boon to Tarakasur"}