{"index": "4.2.4", "image": "resized_images/Padmavati becomes Lord Hari’s Consort.png", "text": [" Continuing with the tale, Lord Varah said-- One day, while Padmavati and her companions were playing in the garden, they saw an equestrian approaching them.", " He held a bow and arrows in both his hands.", "The stranger asked all the girls whether they had seen a wolf.", " Apparently the stranger was on his hunting spree.", " Padmavati angrily reminded the stranger that hunting was strictly prohibited in that area and hence he should go back home.", "The stranger was stunned by Padmavati's beauty and said--'I am Ananta from Venketachal mountain.", " People also call me Veerpati.", " Can I have this beautiful lady as my wife.", "' Padmavati's companions angrily rebuffed Anant who then galloped back on his horse.", " These unfortunate girls were unable to recognize Lord Vishnu who had come disguised as Anant.", "After reaching his palace, Anant found it very difficult to concentrate on his work.", " His mind was occupied by the thoughts of Padmavati.", " One day, while he was sitting in a thoughtful mood, Vakulmalika (a maid servant) arrived there and requested him to come down for lunch.", " But, Sri Hari (Anant) was lost in the thoughts of Padmavati.", " On being asked by Vakulmalika, Sri Hari narrated the following tale to her --- In treta yuga, when I had incarnated as Ram, Ravan had deceit- fully abducted my consort--Sita.", " But fortunately she was not Sita but Agni's consort Swaha.", " Before this incident could occur,Agni had already taken Sita to Patalloka and kept his own wife 'Swaha' in her place.", " Indra's act had special purpose behind it--to avenge Swaha's death,who was Vedavati in her previous birth and who had committed suicide after being touched by the same demon.", "Actually, Agni's consort 'Swaha' was 'Vedavati' in her previous birth.", " So, in reality Ravan had abducted Vedavati instead of Sita.", " Later on, I thanked Agni and promised him that I would make Vedavati my consort in Kaliyuga.", " The same vedavati has taken birth as Padmavati.", " You must go and convince Padmavati to become my consort.", "Vakulmalika went to Narayanpur and informed the king about Sri Hari's desire.", " Emperor Akash was extremely delighted at the prospect of having Sri Hari as his son-in-law.", " An auspicious day was chosen for the marriage and thus, Lord Sri Hari got Padmavati as his consort. "], "next": "4.2.5", "prev": "4.2.3", "title": "Padmavati becomes Lord Hari’s Consort"}