{"index": "4.2.21", "image": "resized_images/Some Prominent Places of Pilgrimage.png", "text": [" Once, sage Shaunak asked Sutji about the means, which enabled human beings to attain salvation in Kaliyuga.", " Sutji recounted a tale -- Once, Kartikeya had posed the same question to kartikeya.", " Emphasizing on the importance of pilgrimages, Lord Shiva had told him that in kaliyuga anybody could attain salvation by going on pilgrimage to holy places.", " Giving names of some prominent holy places and rivers, Lord Shiva had told Kartikeya that some of them were capable of fulfilling any wish of a man, while some gave salvation.", " The names of some prominent rivers Lord Shiva had given were Ganga, Godavari, Narmada, Tapti, Yamuna, Kshipra, Gautami, Kaushiki, Kaveri, Tamraparni, Chandrabhaga, Sindhu, Gandaki, Sarswati, etc.", " According to Shiva all these rivers were not only capable of fulfilling any wish of a man but also giving salvation.", " Naming some prominent holy places, Lord Shiva had told Kartikeya that Ayodhya, Dwarka, Kashi, Mathura, Avanti, Kurukshetra, Ramteerth, Kanchi, Purushottam kshetra, Pushkar kshetra, Varah kshetra and Badrikashram were capable of liberating a man from the sorrows of this world.", "' Lord Shiva had told Kartikeya-- 'Anybody who goes on a pilgrimage to Ayodhya becomes absolved of all his sins.", " Lord Hari dwells at Dwarka and does not abandon it even for a moment.", " A devotee, who takes a holy dip in river Gomti and then pays obeisance to lord Krishna, attains salvation even if he is ignorant.", " In the same manner, one who takes a bath in the holy Panchganga at Varanasi, becomes free from the cycles of birth and death.", " Anybody, who goes on a pilgrimage to Kashi and pays obeisance to lord Vishwanath, is freed from all the bondage of this world.", " Great importance has been attached to the performance of 'tarpan' at Vishramteerth and anybody who performs the rituals of tarpan with sesame seeds and water, his ancestors are freed from the tortures of the hell.", " Taking a holy dip in Kotiteerth at Avantipuri, in the hindu month of Vaishakh and worshipping lord Mahakaleshwar too absolves a man of all his sins.", " Donating gold either at Kurukshetra or Ramteerth, on a solar eclipse day, helps a man in attaining salvation.", " Going on a pilgrimage to Purushottam kshetra and worshipping lord Jagannath after taking a holy dip in Markandeya sarovar, bestows incomparable virtues.", " Badrinath, the dwelling place of lord Vishnu, is considered to be the supreme place of pilgrimage and even its remembrance is capable of giving salvation.", " Virtues attained by the performance of various deeds (tapa, yoga, samadhi), appear to be insignificant as compared to virtues attained by going on a pilgrimage to Badrikashram. "], "next": "4.2.22", "prev": "4.2.20", "title": "Some Prominent Places of Pilgrimage"}