{"index": "4.2.18", "image": "resized_images/Jaganath Idol is Carved Out.png", "text": [" After the rituals of final yagya ended, Narad advised Indradyumna to perform the rituals of 'Purnahuti' to mark the end of Yagya ceremony.", " Narad then went on to say--' A tree is considered to be the partial incarnation (Ansha avatar) of Lord Vishnu for each of his hair that falls on the earth gets transformed into a tree.", "' Narad, then pointing towards a tree told Indradyumna-- ' The almighty Lord has manifested himself in the form of this tree.", " Now, you should make preparations to get this tree installed on the great altar inside the temple.", "' The tree to which Narad had pointed was unique in the sense that it had only four branches on it.", " Indradyumna, following the instructions ordered his men to uproot the said tree and then install it on the 'Mahavedi' inside the temple.", " But, at the same time he was wondering as to who would carve out the four idols of Jagannath, Balbhadra, Subhadra and Sudarshan chakra.", " Suddenly, a heavenly voice was heard--' Lord Vishnu would manifest himself on the sacred altar on his own.", " An old carpenter, who is standing among you, should be sent inside the temple premise.", " The main door of the temple should then be shut and nobody should try to enter the temple till the idols are ready.", " One more thing to be kept in mind is that all of you should keep on beating drums so that nobody hears the sound emanating from the carving of the idols.", " Anybody, who hears this sound, is doomed to become deaf.", " Similarly, anybody who tries to see the act of idols being made shall loose his power of sight.", "' Indradyumna made elaborate arrangements as per the instructions given by the heavenly voice.", " The old carpenter was sent inside and the main door of the temple shut.", " On the fifteenth day, Lord Jagannath manifested himself along with Balbhadra, Subhadra and Sudarshan chakra.", " Once again heavenly voice was heard which said--' O king! Get all the four idols coloured on the basis of the complexion of the respective deities.", " The colour of Jagannath's idol should be dark blue similar to that of dark clouds.", " Similarly, the idol of Balbhadra should be coloured in white just like his fair complexion.", " The colour of goddess Subhadra's idol should be reddish just like the rising Sun.", " Sudarshan chakra should be painted deep red.", " Either the descendants of Vishvavasu or your royal priest are entitled to participate in the consecration ceremony of the idols in future events.", "' Indradyumna, once again following the instructions, got the idols coloured in the way specified by the heavenly voice.", " After that, all the four idols were adorned with beautiful apparels and ornaments.", " Now, they really looked divine in their new looks.", " Looking at the divine idols of Jagannath, Indradyumna went into trance.", " Seeing his condition, Narad advised not to waste time and seek any boon from lord Jagannath because the sole purpose for which Jagannath had manifested himself was to bless him and to fulfill his wish.", " Indradyumna immediately realized what Narad meant to say.", " He eulogized lord Jagannath in the following way--' O Jagannath! Help me out from the sorrows of this world.", " I don't aspire for anything else.", "' Subsequently, Narad and the whole entourage, which had come along with king Indradyumna worshipped lord Jagannath, Balbhadra, Subhadra and Sudarshan chakra.", " Lord Jagannath was worshipped amidst the chanting of dwadashakshar mantra while Jagannath was worshipped with Purush sukta.", " Similarly, Subhadra and Sudarshan chakra were worshipped amidst the chanting of Devisutra and vedic verses respectively.", " Finally, donations were made to the brahmins and everybody was sent off with respect. "], "next": "4.2.19", "prev": "4.2.17", "title": "Jaganath Idol is Carved Out"}