{"index": "4.2.11", "image": "resized_images/Holy Places in the vicinity of Purushottam-Kshetra.png", "text": [" Dwelling in length upon the majesty of Purushottam kshetra, goddess Laxmi said--Purushottam kshetra resembles a conch in shape and is graced by the presence of lord Shiva.", " Towards its north is situated a temple of lord Neelkanth.", " A famous shiva linga named Kapal mochan is also situated in the vicinity.", " One who makes a pilgrimage to Kapalmochan becomes liberated from gravest of sins.", " A temple of goddess Vimla devi is also situated nearby.", " Purushottam kshetra is considered to be supreme among all the places of pilgrimage and for this very reason it is aptly named 'Teerth Raj'.", " A divine pond called Rohin kund is also situated nearby.", " Anybody who takes a holy dip there is freed from the vicious cycles of birth and death.", " It is believed that the increased level of water at the time of deluge ultimately recedes and disappears into this pond.", " Goddess Laxmi said--' O Dhanraj! This holy place is beyond your jurisdiction because people living there never experience death.", " It is well protected by eight goddesses from all the eight directions.", " The names of these eight goddesses are Mangla, Lamba, Kaalratri, Marichika, Vimla, Sarvamangla, Ardhashini and Chandrupa.", " How can lord Rudra be absent when Rudrani has manifested herself in eight forms, so, he has manifested himself in eight different forms as well- Kapalmochan, Kshetrapal, Yameshwar, Markandeyeshwar, Ishan, Bilveshwar, Neelkanth, and Vateshwar.", "While describing the majesty of Purushottam kshetra, goddess Laxmi revealed to lord Brahma--' In the coming satya yuga there would be a king named Indradyumna and would be famous for his unflinching devotion in lord Vishnu.", " Being pleased by the king's devotion, lord Vishnu would ultimately manifest himself from a wooden structure to bless him.", " Vishwakarma would then carve out four idols (Jagannath, Balbhadra, Subhadra and Sudarshan chakra) from the wooden block all of which would be installed by none other than you (Brahma).", "' Once, while sage Jaimini was describing the greatness of Purushottam kshetra to the assembled sages, all of them curiously asked him-- ' Where is Purushottam kshetra situated ?", " Jaimini replied --' Utkal is situated at the eastern coast of Bharatvarsha.", " At the time of deluge, when everything gets submerged in water Utkal remains unaffected and it is the very place from where the knowledge of the Vedas spread in all directions.", " The residents of Utkal are not only learned but also very prosperous.", " There is not a single person in this land who is not a devotee of lord Vishnu.", " All the people belonging to the four prominent castes (Brahmin, Kshatriya, Vaishya and Shudra) diligently follow their respective dharma.", " This holy place never experiences natural calamities of any kind.", "' Sage Jaimini then went on to narrate the tale of king Indradyumna to all the assembled sages -- 'In satya yuga there lived a noble and virtuous king named Indradyumna, who ruled over the province of Malva.", " He was a great devotee of lord Vishnu.", " One day, while worshipping in a temple, he asked the priest-I have a wish, which still remains unfulfilled.", " I have a deep desire of seeing lord Jagannath with my mortal eyes.", " Is there any means with the help of which I can get my wish fulfilled?", " The royal priest had no answer to the king's query so he kept quiet.", "Suddenly, he saw a group of pilgrims coming towards the temple.", " He thought that perhaps one of them might be having an answer to the king's query.", " When the pilgrims arrived at the temple, the royal priest posed the same question to them.", " One of the pilgrims answered--' There is a place called Odhra, where is situated a grand temple of lord Jagannath.", " This sacrosanct place is also famously known as Purushottam kshetra and is situated at the foothills of the Neelachal mountain.", " There is a holy pond called Rohin situated nearby.", " At the eastern bank of this pond is situated a majestic temple of lord Vasudev.", " The idol of lord Vasudev is made of 'Indraneel' diamond.", " To the west of this temple lies 'Shabardeep' hermitage, from where starts a path leading to Jagannath temple.", "' Having said this, the pilgrim disappeared from everybody's sight.", " Not only Indradyumna but all the pilgrims were equally amazed by his sudden disappearance.", " Indradyumna was convinced that lord Jagannath had himself come there in the guise of a pilgrim.", " Now, his desire of visiting Purushottam kshetra became even more intense.", " Indradyumna instructed his priest to find out the exact location of Purushottam kshetra by sending somebody over there.", " Later on, the priest went home and sought the help of Vidyapati-his younger brother in this regard.", " Vidyapati readily agreed to help his brother and one fine day he proceeded on his journey with a select group of his trusted friends.", " After a long and arduous journey all of them reached 'Ekamravan' forest, situated at the foothills of Neelachal mountain.", " The thought of being so near their destination made everybody extremely excited.", " But, despite their best of efforts they could not find Shabardeep ashram.", " Being tired, all of them decided to take rest for a while and then recommence their efforts to find out the location of Shabardeep hermitage.", " Finding a huge tree, all of them took rest under the shade of that tree.", " Suddenly, they heard a heavenly voice, which appeared to be coming from the western direction.", " They followed the voice and reached Shabardeep ashram in a short time.", " There they saw a large gathering of devotees.", " One of the devotees, whose name was Vishvavasu, curiously asked Vidyapati--'It is not easy to reach this place.", " From where are you coming and where do you intend to go?", " You must be tired--wait, till I return with some refreshment for all of you.", "' Vidyapati was not in a mood to waste his time, as he was aware that Indradyumna was eagerly waiting for him to return.", " He told Vishvavasu-- I have a difficult mission to accomplish so, I am not in a position to waste my time.", " I am the younger brother of the royal priest of king Indradyumna.", " The king has vowed not to have a single morsel of food till he makes a pilgrimage to Purushottam kshetra.", " He has sent me with a specific purpose of finding the exact location of Purushottam kshetra and the easiest route leading to it.", " So, help me reach the temple of lord Jagannath as soon as possible.' "], "next": "4.2.12", "prev": "4.2.10", "title": "Holy Places in the vicinity of Purushottam-Kshetra"}