{"index": "4.2.5", "image": "resized_images/King Parikshit.png", "text": [" Once, Sutji narrated the tale of king Pareekshit to all the assembled sages--- Pareekshit ruled over Hastinapur.", " One day he went into a forest on a hunting spree.", " He saw a deer and managed to injure it with his arrow.", " But the injured deer disappeared from his sight.", " Pareekshit chased the injured deer in the direction it had disappeared.", "He reached a place where sage Shamik was engrossed in his meditation.", " Pareekshit enquired sage Shamik if he had seen that injured deer.", " Bur sage Shamik being in deep meditation did not respond to Pareekshit query.", " This made Pareekshit extremely angry and he wrapped a dead snake around Shamik's neck as a punishment for not having answered his question.", " But, it made no difference to Sage Shamik and he continued with his meditation.", " Pareekshit went back fuming in anger.", " Shringi was the son of Sage Shamik.", " When he saw a dead snake coiling around his father's neck, he cursed--'Whoever has tried to insult my father will not live to see the seventh day because a takshak nag would bite him to death.", "' When sage Shamik learnt about his son's curse, he reproached his son and sent a disciple named 'Daurmukh' to inform Pareekshit so that he (Pareekshit) could take some preventive measures.", " Daurmukh went and narrated the whole incident to king Pareekshit.", "Pareekshit became very scarred and he started living on a canopy that had been constructed in the middle of river Ganges on his instructions.", " Now he felt secured and safe.", "Meanwhile a poor brahmin named Kashyap came to know about the curse that poor Pareekshit had received.", " He knew how to cure a person bitten by snake.", " So he thought that it was an excellent opportunity for him to receive monetary awards from the king.", " So, he proceeded towards the place where Pareekshit was staying.", " On his way, Kashyap met a brahmin who in reality was takshak in disguise.", " Takshak was on his way to kill Pareekshit.", " He asked Kashyap about the reason he was going to meet Pareekshit.", " Kashyap revealed to Takshak that he could neutralize the influence of poison in any person bitten by a snake.", " Takshak wanted to examine the authenticity of Kashyap's statement, so he inserted his poisonous fangs into the trunk of a huge tree.", " A man was sitting on the branches of that tree.", " The tree as well as the man was charred to death within no time.", " Kashyap, really brought the tree and that man back to life.", " Takshak was stunned by this unbelievable act.", " He asked Kashyap how much he expected as reward from the king.", " Kashyap revealed the amount, which he expected from Pareekshit in lieu of giving him a fresh lease of life.", " Takshak gave lot of wealth to him as a bribe and Kashyap went back home satisfied.", "Takshak then summoned all his companions and instructed them to go to the place where Pareekshit lived, disguising themselves as hermits.", " All the serpents went to meet Pareekshit impersonating as hermits and offered fruits to him.", " According to his plan,Takshak had hidden himself within a plum fruit.", " He bit Pareekshit as soon as he got a chance.", " Pareekshit died instantly.", "Janmejaya was crowned as the next king.", " Meanwhile, people started criticizing the treacherous conduct of Kashyap, which had resulted in the death of king Pareekshit.", " He decided to make a pilgrimage to Venketachaleshwar so that he became liberated from his sin. "], "next": "4.2.6", "prev": "4.2.4", "title": "King Parikshit"}