{"index": "4.2.12", "image": "resized_images/Vidyapati Eulogizes Lord NeelMadhava.png", "text": " Vishvavasu told Vidyapati--' I have heard this prophesy of Indradyumna's possible arrival at Purushottam kshetra in the near future. Not only that, I have also heard that Indradyumna would become so impressed with Purushottam kshetra that he would settle down there for good after renouncing everything.' Vishvavasu then requested Vidyapati to follow him and started negotiating the steep heights of Neelachal mountain. Vidyapati followed him through the curvy and arduous paths of the mountain. Having walked for sometime, Vishvavasu pointed towards a pond and said--This pond is famously known as Rohin kund. The kalpa vat that you see towards the east of this pond is considered to be so sacrosanct that a sinner becomes liberated of all his sins once he comes under its shade. Lord Jagannath's temple is situated between Rohin kund and the kalpa vat. Go ahead and have a darshan of lord Jagannath for whom you have undertaken such an arduous travel. Vidyapati's joys knew no bounds as he had been waiting for this moment for a long time. First he purified himself by taking a holy dip in Rohin kund and then went inside the temple to worship lord Jagannath. He worshipped lord Jagannath by chanting the sacred pranav mantra.After the worship was over, Vishvavasu requested Vidyapatito visit his place which was nearby. Vidyapati agreed and accompanied Vishvavasu to his place. Vidyapati was given a royal treat by his host, which made him wonder as to how could Vishvavasu arrange all the luxurious things at such a remote place. He could not control himself and asked Vishvavasu-- Even a king would have found it difficult to treat his guest as lavishly like you! I am amazed how you could make arrangements for all these things at a remote and secluded place like this! How do you manage this? Vishvavasu replied-- It is not as difficult as you believe. Since Purushottam kshetra is a sacrosanct place and it is frequently visited by the deities who make divine offerings to lord Jagannath. I collect the residuals of whatever is offered to Jagannath from the temple and bring it home. So, I really don't have to make any special efforts to accumulate divine food stuffs. On account of eating these divine food stuffs, not only we have been blessed by eternal youth but also we are never troubled by old age.Vidyapati was very impressed and requested Vishvavasu to become his friend. He also reminded Vishvavasu that he wanted to return as soon as possible so that the king could go on a pilgrimage to Purushottam kshetra. But, Vishvavasu made a shocking disclosure to Vidyapati and said-- King Indradyumna will never be able to have a divine glimpse of lord Jagannath as the lord is soon going to disappear. But, don't disclose this fact to the king otherwise he would get disheartened and abandon his plan of making a pilgrimage to Purushottam kshetra. Finally, when the king in his utter frustration would try to end his life after not being able to have a divine glimpse of Neelmadhav, the most gracious lord will appear in his dream and instruct him to get constructed four wooden idols of Jagannath, Balbhadra, Subhadra and Sudarshan chakra. Having accomplished his mission, Vidyapati proceeded on his return journey and once again he visited Purushottam kshetra, which fell on the way. He picked up a garland, which had been offered to Neelmadhav by some deity.Finally, when he reached Malwa he found king Indradyumna eagerly waiting for him. After presenting the garland to the king, he narrated his experiences he had at Purushottam kshetra--' O king! Lord Jagannath's idol is made of Neelmani diamond and is very ancient. Even the deities have deep regards and undiluted reverence for lord Jagannath and are frequent visitors to Purushottam Kshetra. The garland, which I have given you, was in fact had been offered to Lord Jagannath by the deities- these flowers do not wither and have fragrance lasting for eternity. Purushottam kshetra remains untouched by old age, sorrow or disease and gives salvation to anybody, who goes on a pilgrimage over there.' ", "next": "4.2.13", "prev": "4.2.11", "title": "Vidyapati Eulogizes Lord NeelMadhava"}