{"index": "4.2.13", "image": "resized_images/Indrayumna Leaves for Purushottam-Kshetra.png", "text": [" Indradyumna had been waiting for this moment for a long time- the moment when he would get a chance to go on a pilgrimage to Purushottam kshetra.", " Revealing his great plan to Vidyapati, he said--' Now, the time has finally come for me to go on a pilgrimage to Purushottam kshetra.", " I also intend to develop that holy place as a prominent place of pilgrimage.", " I would shift my subject to that holy place and perform one hundred Ashwamedha yagyas once I reach there.", " I also intend to devote rest of my life in the worship of Lord Jagannath.", "' While the conversation was going on, the ever wandering sage-Narad, arrived there and informed Indradyumna how pleased were the deities after learning of his holy intention of developing Purushottam kshetra into a major place of pilgrimage.", " Narad also dwelt on length on the virtues of Jagannath's worship.", " Indradyumna, thinking that Narad might prove to be of great help during the course of pilgrimage because of his vast travelling experience, requested him to accompany him to Purushottam kshetra.", " Narad readily agreed to accompany the king and said--' O king! I shall reveal to you the importance of all the holy places that we come across in the course of our pilgrimage.", "' Finally, king Indradyumna left for Purushottam kshetra followed by a large procession, that consisted of his subject, all the ministers and army officers.", " The entourage touched the bank of river Mahanadi by evening.", " Deciding to take rest and spend the night there, king Indradyumna first took his bath and then worshipped Lord Jagannath.", " After the king had taken his bath, all the rest of the people also took their bath and then everybody sat down to have their dinner.", " After the meal was over, while Indradyumna was busy discussing with his ministers on the future course of action, somebody came with the news that the king of Utkal had arrived.", " Indradyumna ordered the messenger to bring the esteemed guest with all the honour and respect.", " The king of Utkal arrived and broke a disturbing news-- ' Indradyumna, I am afraid your intention of having a divine glimpse of Lord Jagannath is not going to fructify as lord Neelmadhav has presently concealed himself beneath a huge heap of sand caused by a ferocious sandstorm.", " The fallout of this inauspicious incident has been extremely adverse on my kingdom-- as my people are experiencing acute famine.", " Indradyumna was shocked, especially the thought of not getting a chance to have a divine glimpse of lord Neelmadhav made him dejected- he saw all his efforts going in vain.", " But, Narad consoled him by saying --' Don't worry! Lord Neelmadhav is extremely merciful and he will certainly give you an opportunity to have his divine glimpse.' "], "next": "4.2.14", "prev": "4.2.12", "title": "Indrayumna Leaves for Purushottam-Kshetra"}