{"index": "4.2.10", "image": "resized_images/Markandeya Eulogizes Vishnu.png", "text": " Lord Brahma soon after reaching Purushottam kshetra sat down and started meditating.\n He was so engrossed in his meditation that he remained in that state for a very long time.\n This resulted into total chaos as Yamaraj found that his power of causing death had no effect on people living in Purushottam kshetra.\n Worried as he was, Yamaraj rushed towards Neelachal mountain and sought Lord Vishnu's intervention in the matter.\n Lord Vishnu smiled and signaled goddess Laxmi to say something.\n Goddess Laxmi said--'O Suryanandan! Anybody residing at this holy place is freed from the vicious cycles of birth and death after becoming absolved of all his sins.\n This is the reason why you are experiencing this unusual problem.\n The whole world except this holy place will come into your jurisdiction.\n' Yamaraj was amazed by this revelation so he asked Laxmi--'I would like to know why such a privilege is being given to this place?\n' Laxmi replied--'O Ravinandan! At the time of deluge when the whole world was submerged in the water sage Markandeya was struggling to find a secure place for his survival.\n Although he was blessed with an unusually long life of seven kalpas but still he needed a place to live in.\n He started swimming and finally managed to reach Purushottam kshetra, which had remained unscathed by the turbulence of the deluge.\n There he saw a divine tree called 'Akshay Vat'.\n Markandeya continued to swim along the coast wondering how that place had managed to remain unaffected by deluge when the whole world had been submerged.\n Suddenly he heard a voice, which appeared to be coming from the direction of the Akshay Vat--'O Markandeya! Don't worry! Take my refuge and you shall be protected.\n' Markandeya was very surprised and looked all around.\n He kept on swimming and saw Lord Vishnu, who was engrossed in his yoga nidra in ksheer sagar.\n I (Laxmi) was also present there.\n Markandeya eulogized Vishnu in the following way--'Salutations to the supreme lord- the source of all creations! O Jagannath! Protect me from getting drowned.\n' Lord Vishnu opened his eyes and found Markandeya gasping for breath.\n On realizing the gravity of the situation he said--'Raise your head and look at the top of this Kalpa Vat.\n You would find an infant sleeping on a leaf of the Kalpa Vat.\n The infant is none other than Kaal himself.\n You should enter inside his (Kaal's) body through his opened mouth and live peacefully as there is no other place for you to live in.\n' Markandeya entered into Kaal's body as per the instructions given by Lord Vishnu and was amazed by the expanse of his belly, which appeared like a bottomless pit.\n He also saw all the fourteen Bhuvans existing within Kaal's belly including all the creatures-deities, sages, siddhas, gandharvas, etc.\n Markandeya wandered all over the place and after getting tired came out through Kaal's opened mouth.\n He found Lord Vishnu was still present there accompanied by his consort-Laxmi.\n Markandeya made salutations to both of them and narrated his experiences he had inside Kaal's belly.\nLord Vishnu blessed him and made a revelation--' The place you had visited few moments ago is beyond the limits of creation or deluge.\n The name of this holiest place is Purushottam kshetra and it is my permanent abode for I do not leave it even for a moment.\n'Markandeya was very impressed and requested Lord Vishnu to allow him to live there.\n Lord Vishnu replied--' O Brahmarishi! I shall remain at Purushottam-kshetra till the end of this kalpa.\n I shall also create a sacrosanct place, which would enable you to become immortal.\n' Sage Markandeya then dug up a reservoir with the help of Vishnu's chakra.\n He did an austere penance to please lord Maheshwar as the result of which he was indeed blessed with immortality.\n In course of time, this reservoir became famous as 'Markandeya kund'. ", "next": "4.2.11", "prev": "4.2.9", "title": "Markandeya Eulogizes Vishnu"}