{"index": "4.3.8", "image": "resized_images/Rituals Pertaining to Shodash Upachar.png", "text": " Once, on being asked by Narad about the proper methods of performing Shodash upachar rituals, lord Brahma said --'In normal circumstances, when lord Vishnu is worshipped by employing the rituals of Shodashopachar it is considered as 'Tapa'.\n But, when the same rituals of shodashopachar are employed to worship lord Vishnu during chaturmas, it is considered as 'Mahatapa'.\n In the same manner, all the austerities that are observed during Chaturmas attain greater importance.\n Lord Brahma then went on to elucidate the proper method of performing the rituals of 'Shodashopachar'--' \"A particular 'mahasukta' of Yajurveda consisting of sixteen ' richas are chanted while worshipping Lord Vishnu.\n Similarly richas like 'sahastra-sheersha purushah' and fifteen others are considered to be most appropriate for the worship of almighty Vishnu.\n First of all, a devotee should perform the ritual of 'nyas' by mentally associating all the sixteen richas with different organs of the body as per the instructions given in the smritis.\n The same rituals of 'nyas' are then performed on the idol of lord Vishnu or Shaligram.\n After that an invocation is made to Lord Vishnu by chanting the first richa of Purush sukta--'Sahashtra sheersha Purushah' with a slight modification i.\ne.\n by adding 'om' in the beginning of the mantra.\n Similarly, Lord Vishnu and other 'Parshads' should be installed at the place of worship by chanting the second richa- 'Purush evedam'.\n With the chanting of third richa, Lord Vishnu's lotus feet are washed after which 'ardhya' is offered with the holy water collected from all the seven seas and other holy rivers.\n Subsequently, the ritual of 'achaman' is performed amidst the chanting of fifth richa.\n The ritual of ablution is then performed in which the idol of Lord Vishnu is bathed amidst the chanting of the sixth richa.\n The idol is adorned with beautiful apparels amidst the chanting of seventh richa.\n Similarly, a sacred thread is offered to Lord Vishnu amidst the chanting of eighth richa while sandalwood paste is smeared on the idol amidst the chanting of ninth richa.\n Subsequently, amidst the chanting of tenth, eleventh, twelfth and thirteen richas, flowers, incense, lighted lamp and naivedya are offered to the deity respectively.\n Naivedya should consist of cereals.\n While performing 'aarti' the fourteenth richa should be chanted.\n A devotee should then circumambulate around the idol amidst the chanting of fifteenth richa.\n Imagining himself as an inseparable part of lord Vishnu, he should meditate amidst the chanting of the sixteenth richa.\" ", "next": "4.4", "prev": "4.3.7", "title": "Rituals Pertaining to Shodash Upachar"}