{"index": "4.3.4", "image": "resized_images/DharmaRanya Kshetra.png", "text": [" Once, sage Vyas went to meet Yudhisthira, who requested him to describe the significance of Dharmaranya kshetra.", " Sage Vyas replied-- ' O king! Once, Dharmaraj-Yudhisthira did an austere penance to please lord Shiva.", " As usual, Indra became scarred because he thought that Dharmaraj was doing penance with the intention of acquiring Indraloka.", " He and other deities went to seek the help of lord Brahma, who did not have any clue.", " So, all of them went to Kailash mountain to seek Lord Shiva's help.", " Since Shiva was aware of Dharma's motive, he explained to the deities that there was nothing to worry about.", " But, Indra was not satisfied and the thought of loosing his kingdom continued to torment him.", " Indra then instructed a beautiful Apsara named Vardhini to go to the place where Dharma was doing penance and disturb him by corrupting his thoughts.", " Vardhini went to the place where Dharma was engrossed in his penance and was successful in disturbing him.", " When Dharma opened his eyes he found a beautiful Apsara in front of him.", " Vardhini asked Dharma--' O Lord! What is the objective with which you are doing such an austere penance?", " Being an embodiment of virtuosity yourself, you prevail in the whole world.", " So, in a sense you already the lord of the world - what else do you need?", "' Dharma told Vardhini that he was doing penance with the objective of having a divine glimpse of lord Shiva.", " Vardhini informed him that Indra was scarred of losing his kingdom and hence had sent her to disturb his penance.", " Dharma was pleased by her truthfulness and wanted to reward her for that.", " Vardhini expressed her desire of having her abode in Indraloka for eternity and also of having a place of pilgrimage named on her.", " Dharma blessed her after which she returned to Indraloka.", " Dharma once again engrossed himself in penance.", " Ultimately, Lord Shiva became pleased and appeared before him.", " ' Ask for any boon and it shall be bestowed to you', said Lord Shiva.", " Dharmaraj replied -' O lord! I want this place to be named after me.", " I also request you to grace this place by your presence.", "' Lord Shiva blessed him and fulfilled both his wishes.", " This was how Dharmakshetra got its name.", " Subsequently, lord Shiva appeared in the form of Dharmeshwar linga in accordance with the second wish of Dharmaraj.", " After his penance was over, Dharma also had created a holy reservoir over there which is believed to absolve a man of all his sins. "], "next": "4.3.5", "prev": "4.3.3", "title": "DharmaRanya Kshetra"}