{"index": "4.3.2", "image": "resized_images/Setu Bandh.png", "text": " All the sages were curious to know about the holy places in the vicinity of Rameshwar. Sutji replied--Sri Ram replied went into exile accompanied by Sita, his consort and his younger brother, Laxman. Ravan, the demon king who ruled over Lanka deceitfully abducted Sita. Subsequently, Sri Ram befriended Sugreev and killed Bali, who harboured enemity against him. Sugreev sent monkeys in all directions to find out where Sita had been kept by Ravan. Later on Sri Ram reached Mahendra Parvat accompanied by Laxman, Hanuman, Sugreeva, Jambavan, Nal and may more brave warriors. They stayed for a brief period at Chakrateerth, where Vibhishan came to see Sri Ram. Eventually Vibhishan was nominated the king of all the demons by Sri Ram to the great displeasure of his brother Ravan. Sri Ram and his army faced an uphill task of reaching Lanka for they had to cross the ocean, which lay as a great barrier between them and their destination. Samudra (ocean) revealed to Sri Ram that Nala had divine powers and whatever he would throw in the Ocean would not sink down but keep on floating. Nala tried to check the authenticity of Samudra's statement by throwing a huge rock into the ocean, as he himself was not aware of his powers. To the sheer amazement of everybody present there the rock started floating on the surface of the ocean instead of sinking down. All the rest of the monkeys tried to emulate Nala's feat by throwing huge rocks into the ocean and to their own surprise found that the rocks did not sink. This was how a bridge was built and across the ocean which made it possible for Sri Ram and his army to cross the ocean. Then length of Setu Rameshwar Bandh is hundred yojan and it is ten yojan broad. There are many holy places situated on the bridge prominent among which are Chakra-teerth, Paap-vinashan teerth, Sita -sarovar, Mangal- teerth, Amrit-watika, Brahma-kund, Hanumat- kund, Agastya-teerth, Ram-teerth, Laxman-teerth, Jaya-teerth, Laxmi-teerth, Agni-teerth, Shiv-teerth, Shankh- teerth, Yamuna-teerth, Ganga-teerth, Koti-teerth, Manas-teerth and Dhanushkoti teerth. ", "next": "4.3.3", "prev": "4.3.1", "title": "Setu Bandh"}