{"index": "4.4.2", "image": "resized_images/Agastya orders the Vindhya Mountains to diminish their size.png", "text": " When Agastya learnt of the problem created by Vindhyachal, he agreed to help the deities despite fully aware of the fact that once he left Kashi it would not be possible for him to see his dearest Kashi once again at least in his present birth.\n Before leaving for Vindhyachal, he sought permission from Lord Bhairav.\n He then reached the place where Vindhyachal had obstructed the path of Surya.\n Lopamudra, his wife accompanied him.\n When Vindhyachal found Agastya starring angrily at him he became scarred and immediately minimized his size.\n Sage Agastya was pleased that his objective had been achieved without making any effort but he knew quite well that once he left the place Vindhyachal would regain his mammoth size.\n So he decided to do something so that Vindhyachal could not obstruct the path of Surya.\n He worked out a plan according to which he instructed Vindhyachal to wait for him until he returned after accomplishing his pilgrimage.\n Vindhyachal agreed assuming that Agastya would return in a short time.\n Vindhyachal thanked his good fortune of escaping Agastya's wrath, which could otherwise have threatened his very existence.\n Sage Agastya then went away never to return and Vindhyachal kept on waiting for his arrival.\n This way, the path being cleared, Surya was once again able to move freely on its orbit without any problem and as a result normalcy returned to the world.\n On the other hand, Agastya who was not at all happy leaving his dearest Kashi was desperate to get there back as soon as possible.\n But, he knew that his wish was going to remain unfulfilled.\n While wandering about, he reached Kolapur where he worshipped goddess Mahalaxmi.\n When goddess Mahalaxmi appeared, he asked her whether he would ever be able to reach Kashi in his present life.\n Goddess Mahalaxmi replied--' Your wishes will be fulfilled in the coming nineteenth dwapar, when you would incarnate as Vyas and would contribute a great deal in the propagation of the Vedas and Puranas.\n There is a sacrosanct place of Kartikeya not very far from here.\n Go there and pay your obeisance to Lord Kartikeya and he would unravel the mysterious aspects of Kashi to you.\n' Sage Agastya and his wife Lopamudra then went to the mountain called Sri Shail, where Kartikeya lived at that time. ", "next": "4.4.3", "prev": "4.4.1", "title": "Agastya orders the Vindhya Mountains to diminish their size"}