{"index": "4.4.1", "image": "resized_images/Vidhyachal Obstructs the Path of Surya.png", "text": " Once, sage Vyas narrated the following tale to all the assembled sages-- ' Once, while wandering about, sage Narad arrived at Vindhyachal mountain.\n He was received with great honour and respect by Vindhyachal mountain.\n But, when the time arrived for Narad to take his leave, he took a deep sigh, which made Vindhyachal extremely perplexed and he asked Narad if anything was wrong.\n Narad replied--' Your rival-Meru mountain is superior to you in every respect and this is the fact I am lamenting about.\n My deep sigh is just the indication of my worried state of mind.\n' Vindhyachal mountain was filled with inferiority complex and started waiting for an opportunity when he could prove his superiority to Meru mountain.\n He thought--' Perhaps Narad was right for even Lord Surya has great respect for Meru's might and this is the reason why he circumambulates my adversary.\n If I am able to beat Meru in height then may be Lord Surya would start circumambulating me and this way I shall prove my superiority to Meru.\n' Now, Vindhyachal started increasing his height and in a short time its peaks became invisible.\n The fallout of this amazing incident proved to be quite catastrophic for the world because even Lord Surya was left stranded at a particular point in the horizon.\n As a result, one part of the earth became too hot for any life to exist.\n Similarly, the other half of the earth became unbearably cold.\n The time became still and everything went haywire in the world.\n All the deities became extremely worried and went to Lord Brahma to seek his help.\n Lord Brahma advised them to go to Kashi and seek help from sage Agastya.\n Deities were pleased at their good fortune of getting a chance to visit Kashi.\n Deities, after reaching Kashi paid a visit to 'Manikarnika teerth' and took their bath.\n Subsequently, they went to Vishwanath temple and worshipped Lord Vishwanath.\n At last, they reached the hermitage of Agastya where he was busy worshipping a self made Shivalinga.\n The entire hermitage was crowded with young pupils of Agastya.\n After the pleasantries having been exchanged, sage Agastaya asked the deities about the purpose of their visit. ", "next": "4.4.2", "prev": "4.4", "title": "Vidhyachal Obstructs the Path of Surya"}