{"index": "4.4.5", "image": "resized_images/The Origin of Kashi.png", "text": [" Sage Agastya asked Lord Kartikeya how the sacrosanct place, Kashi came into being.", " He also asked how Kashi became famous as a place capable of giving salvation to a man.", " Lord Kartikeya revealed to Agastya that once Parvati had asked Lord Shiva the same question.", " Lord Shiva had told her--' At the time of deluge when every thing had submerged in the ocean and darkness prevailed everywhere, only BRAHM- the embodiment of truth existed at that time and nothing else.", " BRAHM, the absolute truth is indescribable and inexpressible.", " No name can be attributed to HIM.", " HE is the absolute truth, the ultimate knowledge, the infinite, the omnipresent and the eternal bliss.", " Though basically formless HE attained a form on account of HIS own wish.", " That form is none other than me.", " Later on I created Prakriti from my body.", " All three of us (Shiva, Parvati and Kashi) manifested simultaneously by the grace of 'Aadi purush' (The Almighty God).", "' Continuing with the tale of Kashi's greatness, Kartikeya told Agastya-' There is no holy place as dear to Lord Shiva as Kashi, which is not abandoned by him as well as his consort-Parvati even at the time of deluge.", " Lord Shiva named this holy place- Ananda van, because it gave immense joy to him.", " Subsequently, Lord Shiva and goddess Jagdamba put a glance on the left portion of their respective bodies as the result of which a divine entity manifested himself who was none other than Lord Vishnu and who was named Purushottam by Lord Shiva.", " Lord Shiva after blessing Purushottam went away.", " Later on, Lord Vishnu created a divine reservoir with his sudarshan chakra and filled it up with his sweat.", " He then engaged himself in an austere penance.", " Lord Shiva once again appeared along with Parvati and blessed Vishnu by saying-' This holy place will become famously known as Manikarnika because this is the very place where I had once lost my diamond ear-ring.", "' Lord Vishnu made a request to Shiva --' May this place fulfill the wishes of those who seek salvation.", " Since it is blessed with your eternal presence hence its another name would be Kashi.", "' Lord Shiva assured Vishnu by saying- ' This sacrosanct place is very dear to me and no event takes place here against my wish.", " Even if a person living here happens to be a sinner he has nothing to fear because I protect him.", " One who lives far from Kashi but remembers it with reverence becomes absolved of all his sins.", "' There is a magnificent Shiva-linga at Kashi famously known as Kashi Vishwanath.", " Here is situated one of the twelve Jyotirlingas.", " Just as the Sun is visible in the whole world despite its presence at a particular point in the horizon, in the same manner Kashi has its influence throughout the length and breadth of the world. "], "next": "4.5", "prev": "4.4.4", "title": "The Origin of Kashi"}