{"index": "4.5.3", "image": "resized_images/Various Names of Ujjainipuri.png", "text": " Once, sage Vyas requested Sanatkumar to reveal why Ujjainipuri was known by various names like Kanakshringa, Kushasthali Avanti and Padmavati. Sanatkumar replied-' Once, Lord Brahma and Lord Shiva arrived at Ujjainipuri in search of Lord Vishnu, who had disappeared from his abode. To their pleasant surprise they found Lord Vishnu staying there. Both of them requested Vishnu to allow them to stay at Ujjainipuri and said-' O Lord! When did you create such a magnificent place with golden mountain peaks? Allow us to live in this beautiful city for we can not live in your separation.' Lord Vishnu requested Brahma to make his abode in the northern part of the city while Shiva was told to make southern part as his abode. Lord Vishnu then told them-' Since you have referred to this place as a city of golden mountain peaks therefore from now onwards it would become famous as 'Kanchan Shringa' (golden peaks)'. Sanat kumar then went on to explain why Ujjainipuri was also called Kusha sthali-' Having created the world, Lord Brahma requested Lord Vishnu to nurture it. Lord Vishnu agreed on the condition that Lord Brahma provided him a pious place on the earth from where he could perform his duty. Brahma then picked up a handful of kusha grass and threw down on the earth. This way Lord Vishnu performed his duty as the nurturer of the world sitting on the seat of Kusha grass. This is the reason why this place came to be known as Kusha sthali.' Sanat kumar then described how Ujjainipuri also came to be known as Avanti puri-' Once, after being defeated by the demons, deities fled to Meru mountain. Later on they went to Lord Brahma and sought his help. Lord Brahma took all the deities to Lord Vishnu. Hardly had they reached the abode of Vishnu and offered their obeisance, then they heard a heavenly voice- 'There is a sacrosanct place called Kushasthali in the forest of Mahakal van. This holy place is graced by the presence of Lord Mahadeva. Go there and engage yourself in austerities and you will certainly become the master of the heaven once again.' Subsequently, all the deities went to a place called Paishachmochan situated in Kushasthali and engaged themselves in various austerities. As prophesized by Vishnu, the deities indeed defeated the demons and became the ruler of heaven. The term 'Avan' means 'the protector' and since it had protected the deities hence it became famous as Avanti. Sanat kumar also described how Kushasthali also came to be known as Ujjaini-' Once, a demon named Tripur did an austere penance to please Lord Brahma. When Brahma appeared he expressed his wish of becoming immortal. Lord Brahma fulfilled his wish as the result of which Tripur became arrogant and started tormenting the deities. The deities sought the help of Lord Shiva, who assured them that he would kill the demon. Subsequently, Lord Shiva did kill Tripur with his most lethal weapon 'pashupat ashtra' after a fierce battle. The place where this incident took place became famous as Ujjaini because of the fierce battle fought between Shiva and Tripur. Continuing with the tale which described the reason why Ujjainipuri also came to be known as Padmavati, Sanatkumar told Vyas-' During the time of ocean churning ambrosia had also emerged from the ocean bed along with many other valuable things. The demons wanted to drink ambrosia so that they could become immortal but the deities were against this idea. Very soon, the arguments turned into a major dispute and both the sides started quarrelling. Narad requested Lord Vishnu to do something in this regard. Lord Vishnu disguised himself as a beautiful lady and was successful in infatuating the demons. Finally, he started giving ambrosia to the deities who after drinking it became immortal. A demon named Rahu was sitting in the rows of the deities after changing his guise. Lord Vishnu was unable to recognize Rahu and gave some ambrosia to him mistaking him to be a deity. But, hardly had Rahu gulped down Ambrosia and before it could reach down his throat, Vishnu severed his head. Rahu's head became immortal as the result of ambrosia's influence. This incident had taken place at Mahakal forest. Later on all the deities distributed the whole wealth, which had emerged from the ocean among themselves. This is the reason why Ujjainipuri came to be known as Padmavati because Padma is another name of Goddess Laxmi. ", "next": "4.5.4", "prev": "4.5.2", "title": "Various Names of Ujjainipuri"}