{"index": "4.5.9", "image": "resized_images/Description of Hell.png", "text": " Yudhishthira requested Markandeya to describe what a sinner had to go through in Yamaloka and also that what kind of a person should be considered as the most ghastly sinner.\n Markandeya replied- ' Donating food to needy people is an extremely virtuous deed and there is no virtuous deed greater than this.\n A person who donates cereals can be aptly called 'Annadata'- one who provides food.\n One who has never donated cereals in his lifetime is definite to go to hell and has to tread an arduous path leading to it that is ridden with prickly thorns, pointed nails and other sharp objects.\n The entire path leading to hell is extremely dark and covered with large pits.\n The path is also covered with unbearably hot sand spilled all over the place.\n The sinner is forcibly taken by the Yamdoots despite their reluctance.\n The sinners repent for the sins they have committed but it is of no use to them, as they will have to reap the fruits of their evil deeds.\n They have to undergo all sorts of painful experience- they are forced to pass through fire and pits full of filth.\n Those sinners who have atoned for their sins are not treated so harshly by the Yamdoots.\n After they appear before Yamraj, Chitragupta reminds them of all the sins they had committed.\n Thereafter, Yamraj orders his attendants to purify the sinners by putting them into the ocean of the Hell.\n There are Twenty-eight types of hells- Atighora, Raudra, Ghortama, Dukhjanani, Ghorrupa, Tarantara, Bhayanaka, Kaalratri, Ghatotkata, Chanda, Mahachanda, Chndakolahala, Prachanda, Varagnika, Jaghanya, Avaraloma, Bhishni, Nayika, Karala, Vikarala, Vajravinshti, Asta, Panchkona, Sudirgha, Parivartula, Saptabhauma, Ashtabhauma and Deerghamaya.\n Each of the latter hell is more horrific than the former.\nSinners have to undergo unbearable pain and sufferings in the hell.\n They are tied up by very hot iron chains and hanged down from trees.\n Yamdoots attach hot and heavy iron balls to their feet and thrash them with hot iron rods.\n They are then put into wells of filth.\n The tongue of a liar is rooted out with brute force and a person, who shows disrespect to his elders and teachers, his mouth is filled with hot sands and boiling oil.\n Similarly immoral women, who do not fulfill their obligation towards their husbands, are thrown into a horrific hell named Lohakumbh.\n O Yudhishthir! A man's life is too short and uncertain.\n One is not sure when his final call would come.\n So, one should try to lead a virtuous life to the best of his ability.' ", "next": "4.6", "prev": "4.5.8", "title": "Description of Hell"}