{"index": "4.6.2", "image": "resized_images/Vishwamitra Commences New Creation.png", "text": " Vishwamitra then instructed Trishanku to make preparation for the Yagya.\n After everything was ready, Vishwamitra initiated Trishanku into the rituals of Yagya.\n Trishanku made offerings in the sacrificial fire at the instruction of Vishwamitra.\n The deities readily accepted all the offerings that were made to them.\n This way, the yagya continued for twelve long years but still there was no sign of Vishwamitra's desire of sending Trishanku to heaven getting fulfilled.\n Trishanku became dejected and told him about his decision to renounce everything and spend rest of his life doing penance as chances of attaining to heaven appeared impossible.\n He was also sure that Vashishth's sons would make fun of him if he went back to his kingdom without achieving his objective.\n But, Vishwamitra consoled him and said--' No power on earth can stop you from going to heaven with your physical form.\n You just need to have some patience and your desire will be certainly fulfilled.\n' Vishwamitra decided to please Lord Shiva as he was convinced that Shiva was the only deity who could help him achieve his goal.\n He eulogized Shiva by singing hymns of praise in his name.\n At last, Shiva appeared before him and expressed his desire of fulfilling any wish of Vishwamitra.\n Vishwamitra requested Shiva to bestow on him the power of creation just like Brahma had.\n Lord Shiva blessed him and disappeared.\nNow, Vishwamitra was eager to test his powers so he began creating different things.\n He created Sun, Moon, Stars, oceans, Rivers, so on and so forth.\n In a short time the whole world was filled by his creations resulting into chaos all over.\n As the result of his creations, every natural thing became double in number- one that had already been created by Brahma and the second created by Vishwamitra.\n Now there existed two suns, two moons, so on and so forth.\n Vishwamitra's amazing deeds had catastrophic fallout on the natural course of events.\n Deities were scarred and rushed to seek the help of lord Brahma.\n They told Brahma that if Vishwamitra was not stopped the whole world was doomed to destruction.\n Lord Brahma appeared before Vishwamitra and ordered to stop doing creations.\n Vishwamitra told him that he was ready to do that if Brahma helped Trishanku attain to heaven with his mortal body.\n Seeing no other option, Brahma accepted Vishwamitra's condition.\n This way, Vishwamitra was able to send Trishanku physically to heaven with the help of Lord Brahma. ", "next": "4.7", "prev": "4.6.1", "title": "Vishwamitra Commences New Creation"}