{"index": "4.6.1", "image": "resized_images/Trishanku cursed by Vashishth’s Sons.png", "text": " Sutji once narrated the following tale to the assembled sages- In ancient times there lived a mighty king named Trishanku.\n He belonged to Suryavanshi dynasty.\n One day, he asked sage Vashishth whether there was any such Yagya by performing which, he would be entitled to go to heaven with his physical form.\n Sage Vashishth laughed at his naive query and told him that there was no such Yagya by performing which a man could go to the heaven with his mortal body.\n But, Trishanku was not satisfied by Vashishth's answer and so he went to ask the same question to Vashishth's sons who were one hundred in number.\n But even they corroborated their father's statement.\n Trishanku got infuriated and threatened them that he would appoint somebody else as his royal priest to get the same yagya performed as they all lacked the required knowledge and competence.\n Vashishth's sons also got angry and cursed him to become a 'chandal' (a low caste person).\n The next moment Trishanku indeed became a 'chandal' and was so much ashamed of himself that he decided to go to the forest after relinquishing his throne.\n He called his son -Harishchandra and narrated the whole tale of his misery.\n Before going to the forest he appointed Harishchandra as his successor.\n One day, while wandering in the forest, Trishanku met sage Vishwamitra and narrated his miserable tale to him.\n Since Vishwamitra was a competitor of Vashishth, he took it as a golden opportunity to prove his superiority to his adversary.\n So, he assured Trishanku that he had the requisite power to send anybody to heaven and said- ' I shall help you perform a grand yagya, which would allow you to attain to the heaven with your mortal body.\n But before that you will have to go on a pilgrimage so that you become pure once again.\n' Both Vishwamitra and Trishanku set out on a pilgrimage and reached 'Arbudachal' where they met sage Markandeya.\n After the pleasantries were over, Markandeya asked Vishwamitra about Trishanku, who was standing quietly.\n Vishwamitra revealed everything to Markandeya and said - I had taken a vow not to take rest until Trishanku got absolved of the evil influence of the curse given by Vashishth's sons'.\n I have not achieved success in my objective till date, so I have decided to renounce the world.\n Seeing Vishwamitra in such desperation, Markandeya consoled him and instructed him to go to Haatkeshwar where taking a holy dip in Patal Ganga would purify Trishanku and solve all his problems.\nBoth Vishwamitra and Trishanku reached 'Haatkeshwar' and bathed in the holy Patal Ganga.\n To his pleasant surprise, Trishanku found that he had indeed become purified and all the lowly qualities had vanished within no time.\n Vishwamitra was delighted as the first condition for Trishanku's departure to Heaven had been met.\n He decided to go to Brahma loka to request Lord Brahma to be present at the Yagya which was to be performed for the success of Trishanku's departure to heaven.\n But before leaving, he instructed Trishanku to make all the necessary preparations before his return.\n After reaching Brahma loka, Vishwamitra narrated the whole story to Lord Brahma and requested him to grace the Yagya by his presence.\n Lord Brahma told him that it was just impossible for any mortal to attain to heaven in his physical form but he added that if Trishanku performed the rituals diligently then he would certainly attain to heaven after his death.\n Vishwamitra did not like Brahma's words and challenged him that no power on earth could stop him from sending Trishanku to Heaven. ", "next": "4.6.2", "prev": "4.6", "title": "Trishanku cursed by Vashishth’s Sons"}