{"index": "4.7.5", "image": "resized_images/Siddheshwar Linga and Siddha Linga.png", "text": " Describing the reason why this sacrosanct place was named Prabhas, Lord Shiva told Parvati- ' I dwell in the entire area stretching between the ocean in the south and river Kaureshwari.\n Being situated at the western coast, this entire area is radiated by Surya's light for a relatively longer period of time and hence it has been named 'Prabhas' meaning luster.\n This is the reason why there is situated a grand temple of Lord Surya in Prabhas Kshetra.\n Not far from this Surya temple is situated a magnificent temple of Lord Siddheshwar, which was famously known as Jaigishavyeshwar in ancient times.\n' Lord Shiva then went on to describe why Siddheshwar was called Jaigishavyeshwar during ancient times-' There lived a sage named Jaigishavya in previous kalpa.\n He used to daily worship a Shiva linga named Mahoday, which had manifested on its own.\n Keeping in view Shiva's fondness for ashes, he used to smear it on his body hoping to please his deity.\n Not only this he even slept on ashes.\n He thus led an extremely austere life.\n At last he was able to please Lord Mahoday by his devotion.\n When Lord Mahoday appeared before him and expressed his willingness to fulfill anything he wished but Jaigishavya wanted nothing but total devotion in his deity (Mahoday).\n Lord Mahoday blessed him with immortality and said-' There would be nobody as powerful as you.\n Your feats achieved in spiritual things will be unmatched and you would become famous as 'Yogacharya' or teacher of Yoga.\n One who regularly worships this particular Linga which you have been worshipping with such deep devotion till now is certain to get absolved of all his sins.\n' Having blessed Yaigishavya thus, Lord Mahoday disappeared from his sight.\n After this incident, Mahoday linga also came to be known as Yaigishavyeshwar.\n In course of time, when the Kaliyuga of that Kalpa arrived, some sages named 'Balkhilyas' had gone to the same place and worshipped Lord Mahoday.\n Similarly, many more sages went there and attained 'siddhi' or accomplishment.\n This is how this Linga came to be known as 'Siddheshwar' (the lord of all accomplishments).\n There are many holy places in the vicinity like Siddha linga, which was installed by lord Surya.\n Anybody who worships this linga on the auspicious day of trayodashi of the bright half of the hindu month Chaitra attains virtues similar to the accomplishment of 'Pundareek Yagya'. ", "next": "4.7.6", "prev": "4.7.4", "title": "Siddheshwar Linga and Siddha Linga"}