{"index": "4.7.2", "image": "resized_images/Prabhas Teertha.png", "text": " On being asked by the sages about the prominent places of pilgrimage, Sutji named many holy places but according to him Prabhas Teerth was the crown of all the places of pilgrimage and was incomparable. Recounting a tale when Parvati had once asked Lord Shiva the same question, Sutji said-' At that time Shiva had told Parvati that Prabhas Kshetra was supreme among all the holy places and capable of liberating a man from all his sins. He had also told her that due to prevalence of sins in Kaliyuga people would not attain virtues despite going on pilgrimages. Shiva had also told her that this was the reason why he had created numerous holy places and kept them secret so the holiness of these places remained intact. I have manifested myself in the form of a divine Shiva linga at Prabhas kshetra. The whole universe has originated from it and merges into it ultimately at the time of deluge. The Shiva linga is called Somanath and very few people are aware of it's existence. This Shivalinga continue to exist since it's manifestation in a particular kalpa named Bhairav long ago. Unfortunately, people of kaliyaga under the influence of all pervading ignorance would fail to recognize the importance of holy places. Such people would try to demean the value of holy places and make fun of those people who go on pilgrimages. Being blinded by their superficial intelligence they would try to find faults with rituals and religion. Such would be the condition of the mortals in kaliyuga that they would criticize everything that is religious and spiritual in nature. How can one expect from these unfortunate people of kaliyuga to understand the significance of Prabhas kshetra and which is revered even by me ?' Parvati, who had been listening to the tale with rapt attention, became even more curious to know about Prabhas kshetra. So she requested Lord Shiva to shed more light on the other important aspects of this sacrosanct place. Lord Shiva, continuing with his description of Prabhas kshetra, said- ' This sacrosanct place has temples of three deities on it's three sides. To its east is situated a grand temple of Surya Narayan while there is a magnificent temple of Madhav to it's west. In the same way there is a beautiful temple of goddess Bhavani to the north of Prabhas kshetra and towards it's south lies the ocean. This holy place is spread in the area of five yojans and is divided in three major areas- Maheshwar, Vaishnav and Brahma. There are about one crore temples related with different deities in Vaishnav and Brahma kshetras while Maheshwar kshetra contains one and half crore temples. As the name implies, each area has been named after one God forming the Trinity. Anybody who has the good fortune of living in the central part of Prabhas kshetra becomes absolved of all his sins even if he has committed most abhorrent sins. The significance of this holy place can be understood by the fact that a man born there does not take a second birth and attains salvation. One whom scholars of the Vedas call 'Kaalagni Rudra' is famously known as Bhairav in Prabhas kshetra. ", "next": "4.7.3", "prev": "4.7.1", "title": "Prabhas Teertha"}