{"index": "4.7.9", "image": "resized_images/Prabhas – The Abode of Trinity Goddesses.png", "text": " Lord Shiva revealed to goddesses Parvati that Prabhas kshetra boasted of possessing many more Shiva lingas apart from the famous Somnath Shiva linga.\n He also gave names of some of the prominent Shiva lingas situated over there and said- ' To the North-East of Somnath temple is situated a grand temple of lord Sarveshvar Deva, who is also famously known as Siddheshwar.\n The reason behind this is that Shiva linga over there had been installed by the 'siddhas' (accomplished ones) in ancient times.\n People who are desirous of acquiring siddhis throng this holy place and engage themselves in austere penance.\n To the east of Siddheshwar temple is situated one more temple called Kapileshwar.\n It has been named after sage Kapil, who had installed the Shiva linga over there.\n A Shiva linga named Gandharveshwar is also situated nearby.\n This particular Shiva linga had been installed by a gandharva named Dhanvahan.\n To the east of Gandharveshwar temple is situated Vimaleshwar temple.\n It is believed that anybody suffering from tuberculosis gets cured after he worships in that temple.\n Dhandeshwar linga was installed by Kuber, who was bestowed with the lordship of wealth on account of his austere penance.\n' Lord Shiva told Parvati that there were also temples of three goddesses in Prabhas Kshetra apart from Shiva temples.\n These three goddesses were Mangla, Vishalakshi and Chatwar representing the three types of power-will power, power of action and power of knowledge.\n Lord Shiva said-' The pilgrimage to Prabhas kshetra is believed to be incomplete until and unless these three goddesses have been worshipped.\n Goddess Mangla represents the power of lord Brahma (Brahma shakti) while goddess Vishalakshi that of lord Vishnu.\n Goddess Chatwar represents my power.\n Goddess Mangla holds the privilege of getting worshipped first.\n During ancient times Chandrama did an austere penance for thousand of years and all the deities including Lord Brahma had gone there to witness his amazing feat.\n At that time goddess Mangla had blessed them and this was how she got her name.\n' Lord Shiva then went on to describe how goddess Vishalakshi got her name-' A fierce battle had taken place between the deities and demons during Chakshus manvantar.\n Lord Vishnu fought along with the deities and helped them in defeating the demons.\n Demons fled towards the south but were chased by the deities.\n Realizing that it was not easy to annihilate the demons, Lord Vishnu remembered goddess Mahamaya and sought her help.\n Mahamaya appeared instantly and looked at Lord Vishnu with her large eyes.\n This is how she got her name.\n In the present kalpa she is also known as Lalitoma.\n To the south of Vishalakshi temple is situated the temple of goddess Chatwarpriya.\n Goddess Chatwarpriya is the saviour of people living in that area.\n Anybody who worships her on the auspicious day of Mahanavami with appropriate rituals is blessed. ", "next": "4.7.10", "prev": "4.7.8", "title": "Prabhas – The Abode of Trinity Goddesses"}