{"index": "4.7.11", "image": "resized_images/The Sanctity of Dvarkapuri.png", "text": " Prahlad, being an ardent devotee of Vishnu himself, understood quite well, the desperation with which a devotee seeks his Lord. So he told them-' By the grace of Almighty Vishnu, I am revealing to you the name of that sacred place which has remained a secret till now. Kushasthal Puri is a divine city situated on the western coast. Nearby is the place where river Gomti meets the ocean and at this convergent point is situated the sacrosanct city called Dwarawati Puri, where you can find Lord Vishnu in all his glory of sixteen kalas. Blessed be the Dwarka Puri, which The almighty Vishnu has chosen as his abode and where he dwells in his glorious Chaturbhuj form. This is the very place, which even liberates the most fallen sinner from all his sins. There is a famous temple of Lord Trivikram at the bank of river Gomti and not far from this temple is a divine pond. Anybody desirous of salvation must bathe in this pond for the fulfillment of his wish. It is believed that before leaving for heaven, Lord Krishna had transferred all his divine powers into the Trivikram idol. So, there is no place as holy as Dwarka and if you are desirous of having a divine glimpse of Lord Krishna then you must visit Dwarka.' All the sages thanked Prahlad for sharing his secrets with them because nobody else except Prahlad was aware of the fact that Lord Vishnu had given Dwarka the privilege of being his abode. These revelations made them more curious about Dwarka, so they requested Prahlad to disclose how the holy Gomti descended down to Dwarka. Prahlad began by describing the virtues of going on a pilgrimage to Dwarka-' The mere resolution of going on a pilgrimage to Dwarka is enough to liberate one's ancestors from the tortures of the hells. Each step that a devotee takes towards Dwarka gives virtues similar to what is attained by performing Ashwamedh Yagya. One who encourages others to go on a pilgrimage to Dwarka certainly goes to Vishnu Dhaam.' Prahlad then switched over to the second part of the sages' question and said-' There is an interesting tale describing how sage Vashishth had brought down Gomti from the heaven to earth. At the time of deluge when the whole world had submerged in water, a lotus flower manifested from Lord Vishnu's navel on which was seated Brahma. Lord Vishnu instructed him to perform his duty as a creator to which Brahma agreed. First of all Brahma created his ten manasputras (Sanak, Sanandan,etc.) and sought their help in increasing the population of the world by becoming householders. But, all of them were extremely virtuous and did not show any inclination towards getting married. Ultimately all of them went to the western coast and engaged themselves in austere penance. Their penance continued for a number of years after which 'Sudarshan chakra' appeared before them. As all of them looked up in bewilderment, they heard a heavenly voice -' O sons of Brahma! Very soon the almighty Vishnu is going to manifest himself. The 'Chakra' you are seeing is his. You all must perform the rituals of 'ardhya' in the name of Lord Vishnu to show your reverence towards him.' All the Manasputras eulogized Sudarshan-Chakra with deep devotion. All of them wished that there were a holy river, with whose water they could perform the rituals of ardhya. But to their utter dismay there was no such holy river nearby. They then remembered Lord Brahma, who immediately understood what they desired. Lord Brahma instructed Ganga by saying-' Ganga! Go to the earth, where you would be known as Gomti. Sage Vashishth will lead you to your destination. Just follow him like a daughter follows her father.' Finally, when sage Vashishth followed by Gomti reached their destination, all the Manasputras were delighted. They eulogized Ganga and expressed their gratitude to Vashishth for bringing Ganga on earth. All of them thanked Vashishth by saying-' Since you have brought Gomti on earth, you would be considered as her father.' They offered 'ardhya' to Gomti and subsequently eulogized Lord Vishnu. Lord Vishnu appeared after being pleased and blessed them-' Your unflinching devotion in me has pleased me no bound. Since you did this penance with the objective of Moksha (salvation), this place would become famous as Moksha Dayak (giver of salvation). This sacrosanct place would also be called Chakra teerth because of Sudarshan chakra, who informed you all of my manifestation at Dwarka Puri. I assure you that I won't abandon this sacrosanct place even for a moment.' This way, all the Manasputras were finally successful in their objective of offering ardhya to Lord Vishnu with the holy water of Gomti. At last, Gomti having fulfilled her mission for which she had descended down to Earth merged with the ocean. Lord Vishnu disappeared from there and Manasputras continued to live there. ", "next": "5", "prev": "4.7.10", "title": "The Sanctity of Dvarkapuri"}