{"index": "4.7.4", "image": "resized_images/Different Names of Somnath.png", "text": " Parvati curiously asked Lord Shiva about the reason why Somnath was known by so many different names.\n Lord Shiva said- ' Since the time this divine linga first manifested itself very few blessed souls had the knowledge of it's existence.\n Brahma has a life span of one kalpa at the end of which even he ceases to exist giving way to his successor- a new Brahma.\n In the same manner this divine Linga acquires a new name at the end of each kalpa.\n The present kalpa is seventh in order as six kalpas have already passed.\n The name of the present Brahma is Shatanand and this divine Linga is presently famous by the name of Somnath.\n Similarly it was famous as Mrityunjay during the time of Brahma named Virinchi.\n During second kalpa this Linga was famous as Kalagnirudra and the name of Brahma was Padmabhu.\n The third kalpa had Swayambhu as Brahma and the Linga was famous as Amritesh.\n The name of the fourth Brahma was Parmeshthi in fourth kalpa and the linga was famous as Annamay.\n In the same way the names of the fifth and sixth Brahma were Surajyeshtha and Hemagarbha respectively and the names of the Linga during their periods were Kritiwas and Bhairav Nath respectively.\n' Lord Shiva also revealed to Parvati that the next kalpa- eighth in order would have Chaturmukh as Brahma and the divine Linga would be known as Pran Nath.\nGoddess Parvati then asked Shiva about the exact location of the Linga in Prabhas Kshetra.\n Lord Shiva told her that the sacrosanct place of Prabhas Kshetra was situated between the plains of two rivers Vajrini and Nyankumati.\n He also told her that the eternal Linga was not very far from the sea coast.\n Dwelling at length about the good fortunes of those living in Prabhas kshetra, Lord Shiva told her-' Anybody who does not abandon this holy place despite his hardships and troubles is certain to attain to my abode.\n One who has the good fortune of dying at Prabhas kshetra attains salvation.\n There will be prevalence of sins in Kaliyuga.\n As a result of this people would experience all sorts of hurdles and problems in their lives.\n To minimize their sorrows and to lessen their miseries, I have personally instructed Ganesh not to abandon this place even for a moment.\n Of all the Lingas present on the earth, Somnath is specially dear to me.' ", "next": "4.7.5", "prev": "4.7.3", "title": "Different Names of Somnath"}