{"index": "4.7.1", "image": "resized_images/Description of Puranas and Up-puranas.png", "text": " Once, while describing the origin of puranas, Sutji told the sages who had assembled at Naimisharanya-' Lord Shiva had first revealed the contents of Skanda puran to Parvati at Kailash Mountain.\n Lord Brahma and few other deities were also present there at the time when Shiva was narrating the tale.\n Subsequently, Parvati narrated this tale to Skanda, Skanda to Nandi and Nandi to sages like Sanak, etc.\n and finally Sanak narrated it to Vyas.\n Now I am going to tell you the same tale which Vyas had narrated to me.\n' Sutji began by saying-' During ancient times, Lord Brahma once did a very austere penance resulting into the manifestation of all the four Vedas.\n Later on, all the eighteen Puranas too appeared from his mouth.\n These eighteen Puranas were- Brahma Puran, Vishnu Puran, Shiva Puran, Bhagawat Puran, Bhavishya Puran, Narad Puran, Markandeya Puran, Agni Puran, Brahma vaivarta Puran, Linga Puran, Padma Puran, Varah Puran, Skanda Puran, Vaman Puran, Kurma Puran, Matsya Puran, Garuda Puran and Vayu Puran.\nApart from these eighteen main Puranas, there are also similar number of secondary Puranas known as Up- Puranas.\n These Up- Puranas are - Sanat kumar, Narsimha, Skand, Shiva Dharma, Durvasa, Narad, Kapil, Manu, Ushana, Brahmand, Varun, Kalika, Maheshwar, Saamb, Saura, Parashar, Maarich and Bhargava.\n' Sutji then went on to describe the other features of each Purana-' Brahma Puran contains ten thousand shlokas in it whereas Padma Puran contains fifty- five thousand shlokas.\n Similarly, there are twenty-three thousand shlokas in Vishnu Puran.\n Vayu Puran contains the tales related with Lord Shiva and it contains twenty-four thousand shlokas in it.\n Similarly the remaining Puranas like Bhagawat, Narad, Markandeya, Agni, Bhavishya, Brhmavaivarta, Linga, Varah, Skanda, Vaman, Kurma, Matsya, Garuda and Brahmanda Puran contain 18,000, 25,000, 9,000, 16,000, 14,500, 18,000, 11,000, 24,000, 81,100, 10,000, 17,000, 14,000, 18,000 and 12,200 shlokas respectively.\n' Sutji told the sages that all the Up- Puranas owe their origin to the main Puranas which are eighteen in number.\n He also revealed to them that they could be categorized into three main types- Satvik, Rajas and Tamas.\n Satvik Puranas contain the tales of Lord Vishnu while Rajas Puranas contain the tales of Brahma and Tamas Purans contain the tales of Agni and Rudra.\n One of the chief characteristics of Puranas is that each of them is divided into five sections- 'Sarg' (Description of how creation began), 'Pratisarga', 'Vansh' (Description of prominent dynasties), 'Manvantar' and 'Vanshanucharit' (Tales related with the descendants of the famous sages). ", "next": "4.7.2", "prev": "4.7", "title": "Description of Puranas and Up-puranas"}