{"index": "4.7.10", "image": "resized_images/Dvarka Mahatmya – Sages Queries to Prahlad.png", "text": " Once, few sages asked Sutji about the means by which Lord Vishnu could be realized in kaliyuga- the era dominated by sin and decaying moral values. Sutji started by describing how Lord Vishnu on seeing the prevalence of sin in Dwapar yuga had to take incarnation as Krishna to liberate the world from the sinners. He also described in detail all the incidents culminating into the killings of many cruel demons -Kaaliya serpent, Chanur, Shishupaal and ogress like Putna. He gave in depth description of the events leading to the war of Mahabharat and how the infighting among the mighty Yadavas led to their destruction. He told them how a fowler mistook Krishna's feet to be a deer and killed him. Sutji also told the assembled sages how the magnificent city of Dwarka had been submerged in the ocean ultimately. He revealed to them that the passing away of Krishna marked the advent of Kaliyuga and the situation became even worse. On finding how difficult it was to realize lord Vishnu in the Kaliyuga- the era dominated by sin, some prominent sages decided to seek Lord Brahma's help in this regard. After reaching Brahma loka, they eulogized Brahma and received his blessings. Lord Brahma told them to go to Patal loka and meet Prahlad, the supreme devotee of Lord Vishnu who according to Lord Brahma was in a better position to help them. All the sages went to Patal loka as per the instructions given by Lord Brahma. There they not only found Prahlad but also the most charitable king-Bali. After the pleasantries were exchanged, they came to the real issue and said-' We are very much distressed by the prevailing situation where it appears that the evil forces have overshadowed the virtuous ones. The ways shown by the Vedas are no longer in practice and the Brahmins are being tormented by the Shudras, who have become the rulers. We have come with a request and a desire to know whether there was any possibility of realizing Lord Vishnu in this dark era of 'Kali'. If yes then where can we find Lord Vishnu?' ", "next": "4.7.11", "prev": "4.7.9", "title": "Dvarka Mahatmya – Sages Queries to Prahlad"}