{"index": "4.7.8", "image": "resized_images/The Emergence of Sarasvati in Prabhas Kshetra.png", "text": [" On being asked by Parvati about the emergence of river Saraswati at Prabhas Kshetra, Lord Shiva narrated the following tale to her-' The holy Sarswati flowing in Prabhas kshetra constitutes of five different streams- Harini, Vajrini, Nyanku, Kapila and Saraswati.", " Lord Vishnu once instructed Saraswati to carry 'Badwanal' (Submarine fire) and dump it in the ocean near Prabhas kshetra.", " After taking permission from Lord Brahma, her father Saraswati flew towards her destination.", " Ganga became sad at her departure so she asked her as to how could she have a glimpse of her now that she was going to such a distant place.", " Saraswati consoled Ganga by saying that she would be able to see her whenever she looked eastwards.", " The swift currents of Saraswati penetrated the earth and reached Patal Loka carrying Badwanal along with her.", "She continued to move beneath the ground towards her destination.", " As she reached Prabhas Kashetra, four learned sages, who were well versed in Vedas arrived there and invoked Saraswati to give them the privilege of separate bath by dividing herself in four different streams.", " The names of these sages were Hiranya, Vajra, Nyanku and Kapil.", " While Saraswati was about to comply with their request, suddenly Samudra arrived there and he too expressed the same wish.", " Thus Saraswati divided herself into five different streams- Harini, Vajrini, Nyanku, Kapila and Saraswati.", " Eventually, when Saraswati reached near the ocean, Badwanal whom she was carrying was surprised to see the high tides rising in the ocean.", " He thought that the Samudra was frightened of his fury so he asked Saraswati- Why is the ocean scarred of me?", " Saraswati inflated his ego by saying that who would not be scarred of him.", " Badwanal was pleased and wanted to grant her a boon.", " Saraswati remembered Lord Vishnu, who instantly gave his divine appearance in her heart.", " She narrated the whole story and sought his advise.", " Lord Vishnu advised her to ask Badwanal to make his appearance small like the eye of a needle.", " Saraswati, following the advise of Lord Vishnu asked Badwanal to become small like a needle and keep sucking the ocean.", " Subsequently, Saraswati summoned Samudra and told him to accept Badwanal to which he agreed.", " This way Samudra devoured Badwanal, who continues to suck the water of the ocean even today as per the instructions given by Saraswati.", " It is believed that tides are nothing but the manifestation of Badwanal's exhalations.", " This was how Saraswati emerged in Prabhas kshetra. "], "next": "4.7.9", "prev": "4.7.7", "title": "The Emergence of Sarasvati in Prabhas Kshetra"}