{"index": "5.1.1", "image": "resized_images/Sages Enquire.png", "text": " Viddyeshwar Samhita which is classified into twenty five chapters, has a narration in its first chapter which goes as follows- Once upon a time, the sages were performing a yagya at Prayag kshetra.\n Sage Sutji came to know about this and arrived there.\n All the sages were very pleased to see him.\n They requested:\n- \"Lord! Though we have heard many tales from you regarding the man's benediction, but today we want to listen to something special.\n Because in this present era of Kali, when all the castes have forgotten about their respective duties we want to know is there any way to prevent the deterioration in the human values?\n\" Sutji replied:\n- \"O Great men! Your enquiry has great relevance in this era of Kali.\n I will certainly tell you about the way by the help of which a man can achieve benediction.\n Shivmahapuran contains the essence of Vedantic philosophy, which gives worldly pleasures as well as Salvation.\n Mere remembrance of it destroys all the sins of a man.\n One who studies the Rudra-Samhita attentively, his gravest of sins are destroyed instantaneously.\n One who studies Rudra-Samhita' silently, sitting in front of Bhairav-idol, all of his aspirations are fulfilled.\n A man gets liberated from the sin of killing a brahmin, if he studies Rudra Samhita while circulbulating around a Banyan tree.\n\" \"Kailash Samhita is even Superior than Rudra Samhita, as it elaborates upon the meaning of Omkar.\n Shivmahapuran is created by lord Shiva Himself.\n It contains twelve Samhitas which are - Viddyeshwar, Rudra, Vinayak, Uma, Matri, Ekadash-rudra, Kailash, Shat-rudra, Koti-rudra, Sahastra Koti, Vayaviya and Dharma.\n\" \"Initially it contained one lac shlokas but it was precised to twenty-four thousand shlokas by sage Vyas.\n The present ShivPuran is the fourth one which consists of seven Samhitas.\n The earlier three Shivpuranas are unavailable.\n The scientific analysis of the Vedantic mysteries are the main subject of this divine Shivpuran.\n The study of Shivpuran helps a man to attain Dharma, Artha, Kaam and Moksha. ", "next": "5.1.2", "prev": "5.1", "title": "Sages Enquire"}