{"index": "5.1.6", "image": "resized_images/Anaal-Stambh (The Pillar of Fire).png", "text": [" \"Though Lord Shiva knew everything, but still feigning ignorance, he asked about the well beings of the world.", " The deities told him about the battle, fought between Brahmaji and Vishnuji.", "\" \"Lord Shiva then sent his one hundred Ganas to pacify both of them.", " He too went there accompanied by mother Parvati, boarded on a chariot.", " When Lord Shiva reached there, he saw that Brahmaji and Vishnuji were about to use their deadly weapons- Maheshwar and Pashupat respectively.", " Fearing the destruction, which these deadly weapons might have caused, Lord Shiva manifested himself in the form of 'Analstamba' (pillar of fire) between them.", " Brahmaji and Vishnuji had already released their weapons- Maheshwar and Pashupat.", " Both the weapons fell into that pillar of fire and got destroyed.", " \"Brahmaji and Vishnuji were very surprised to see the pillar of fire, which was so enormous in size that it reached the sky and penetrated down the earth.", " Vishnuji transformed himself into a boar and went to the 'Patal' (nether world) to find the base of that 'Pillar of fire'.", " But he was unsuccessful in his attempt and came back.", " Similarly Brahmaji transformed himself into a swan and flew up in the sky to find its limit.", " While going through the aerial route he met a withered 'Ketaki' flowers, which had still some freshness and fragrance left in it.", "\" \"Lord Shiva smiled at the futile attempts of Shri Brahmaji and Vishnuji.", " As a result of his smile the Ketaki flower fell down from the branch.", " Ketaki flower told Brahmaji that he had been present there since the beginning of the creation, but was unable to know about the origin of that 'Pillar of fine'.", " The flower also advised Brahmaji against making any effort in that direction, as it would be of no use.", "\" \"Brahmaji then sought the help of Ketaki flower to give a false witness before lord Vishnu, that he (Brahmaji) had been successful in seeing the limit of that pillar of fire.", " Ketaki flower agreed.", " Both of them went to Vishnuji and Brahmaji told him that he had seen the limit of that Pillar of fire.", " Ketaki flower gave a witness.", " Vishnuji accepted the superiority of Brahmaji.", "\" \"Lord Shiva became very angry with Brahmaji.", " He proceeded to punish Brahmaji for his falsehood.", " Lord Vishnu requested Lord Shiva to spare the life of Brahmaji.", " Lord Shiva became pleased with Vishnuji and accorded him the same status as Hat of his own.\" "], "next": "5.1.7", "prev": "5.1.5", "title": "Anaal-Stambh (The Pillar of Fire)"}