{"index": "5.2.101", "image": "resized_images/Shiva’s Departure.png", "text": [" Shiva remained at his in-laws house for many days.", " One day he sought the permission of Himalaya to go back.", " Everybody became sad at the prospect of Shiva's departure.", " Especially Maina who was very saddened by this news.", " At last it was time for Shiva to depart for Kailash, accompanied by Parvati.", " Lord Shiva and Parvati were blissfully enjoying their martial status, unaware of the eagerness with which the deities were awaiting the arrival of their progeny.", " Tarakasur - the demon continued tormenting the deities.", " When their miseries became unbearable they went to lord Brahma to seek their help.", " All of them then went to lord Vishnu.", " They told him that even after passing of such a long duration of time, Parvati and Shiva had not yet become parents.", " They requested lord Vishnu to remind Shiva about the purpose behind his marriage.", " Initially lord Vishnu showed his disinclination to disturb Shiva's martial bliss, but when the deities insisted he went to Shiva accompanied by all of them.", " All of them eulogised Shiva and Parvati.", " The deities then requested Shiva to make his contribution in the destruction of Tarakasur.", " Shiva understood everything.", " Some drops of his semen fell down on the ground.", " One being insisted by the deities.", " Agni transformed his appeared in the form of a pigeon and pecked up those drops of semen.", " Right then Parvati arrived there and became extremely furious on seeing the semen going waste.", " She cursed the deities that their respective wives would remain issue less as the consequences of their mindless acts.", " Agni was having inflammation in his stomach because of the Shiva's semen.", " Lord Shiva advised him to transfer it into the womb of any noble woman.", " Agni followed the instruction and injected the semen into the body of six women through the pores of the hair on their body.", " Those women could not bear the extreme luster of the Shiva's semen.", " They went to Himachal and evacuated it.", " Even Himachal could not bear its extreme effulgence and immersed it into the flowing Ganga.", " River Ganga carried it with her current and established it amidst bushes of reed (Sarkanda).", " Instantaneously a beautiful child manifested from it.", " His birth made all the deities extremely joyous including Shiva and Parvati.", " It was the sixth day (bright half of the lunar month) of the hindu month of Margashirsha. He was Kartikeya. "], "next": "5.2.102", "prev": "5.2.100", "title": "Shiva’s Departure"}