{"index": "5.2.21", "image": "resized_images/Gunanidhi’s Salvation.png", "text": " When Gunadhi came to know about his father's second marriage, he moved to another place, cursing his fate.\n He kept on walking till he became tired.\n He sat under a tree and started thinking about his further course of action.\n He heart was full of remorse and he repented for his past actions.\n As his mind was engrossed in such kind of thoughts.\n He saw somw villages going towards temple.\n They were carrying prasad in their hands.\n \"Since Gunanidhi was hungry, he followed them and after reaching the temple he sat at the main gate of the temple.\n IN the night, after the accomplishment of the Pujan, the devotees went to sleep.\n Gunanidhi entered the premise went to sleep.\n Gunanidhi entered the premise of the temple.\n The flame of the lamp was gradually becoming dim as the result of which he could not see properly.\n He tore some pieces of cloth, he was wearing and made a thick wick and put it in the lamp.\n Now the light was sufficient to enable him to see whatever had been offered to the deity.\n\" \"He carried as much fruits and other eatables as possible and tried to sneak out from the temple.\n Unfortunately, he dashed against a devotee woke up and chased him shouting thief-thief.\n\" \"Hearing his cries all the other devotees woke up and caught Gunanidhi.\n He was given such a nice thrashing that proved to be fatal and as a result Gunanidhi died.\n\" The Yamadut's arrived to take his soul to yamloka.\n But right then, the Shivaganas arrived and prevented the Yamadutas from carrying his soul.\n They informed the Yamdutas that Gunanidhi was entitled for Shivaloka as he had devoutly observed the Shivaratri fast, had listened to the tales of Shiva and lighted up the lamp which was about to go off.\n The Shivaganas also informed the Yamadutas that, in his next birth Gunamidhi would become the king of Kalinga.\n\" \"In this way Gunanidhi attained to Shivaloka.\n In his next birth he was born as a son of king Arindam- the king of Kalinga.\n He was named as Dama.\n\" \"When he was still young, his fatherArindam dies.\n So Dama succeeded him as the king of Kalinga.\n He renovated all the Shiva-temple, which came under his jurisdiction and passed a stricture which made the worship of lord Shiva compulsory for all the subjects.\n By the blessings of lord Shiva, he became the king of Alkapuri and was known as Kubera.\" ", "next": "5.2.22", "prev": "5.2.20", "title": "Gunanidhi’s Salvation"}