{"index": "5.2.23", "image": "resized_images/Shiva goes to Kailash.png", "text": " When Rudra - the Ansha of the Almighty brahma, heard about the tremendous penance, Kubera was doing he started to play his 'damaru' (drum), the sound of which reached all the three worlds. Rudra then reached the place where Kubera was doing penance.\" \"Hearing the sound of his damaru, all the deities including Brahma, Vishnu and Sadashia appeared before him.\" \"When Kubera saw lord Rudra before himself, he offered his seat to him and worshipped him. He also worshipped the other deities. Rudra was so pleased with Kubera that he decided to stay near him. He called Vishwakarma and ordered him to conduct his abode at Kailash mountain, so that he could live in could live in the vicinity of his great devotee-Kubera. Kubera constructed a beautiful city as per his instruction. An auspicious moment was chosen and Shiva went to live at Kailash mountain. He was coronated by the deities.\" Brahamaji in this way told Narada about Shiva's departure to Kailash mountain. SATI KHAND In the Sati Khand of Rudra-Samhita, Narada enquires lord Brahma about the reason, why lord Shiva married Sati, inspite of being a 'yogi'. He also requested Brahmaji to tell, how Sati became the daughter of Daksha Prajapati and in her next birth as Uma the daughter of Himalaya. How did Uma get lord Shiva as her husband?- asked Narada Lord Brahma narrated the following tale- \"A girl by the name of Sandhya manifested from my being. I was amazed by her heavenly beauty. Right then a divine entity appeared before me, whose beauty could not have been matched even by the deities. He was Kamadeva- the god of love. He influenced me to such an extent that I forgot that Snadhya was my daughter and got infatuated by her.\" \"When Rudra came to know about my lust for Sandhya, he admonished me and ridiculed about my character. I felt ashamed. But I also became jealous of Rudra. I decided to influence him with the power of infatuation, but I was unsuccessful in my attempts. I remembered lord Vishnu and he tried to make me understand about the futility of my attempts, as according to him (Vishnu), Rudra was beyond the reach of any human emotions.\" \"But I instructed my son - Daksha to help in the procreation of a girl child from the womb of Ashwinivirini. Thus Sati was born. Sati later on became famous of Uma and got Rudra as her husband on account of her tremendous penance.\" \"Though Rudra was free from all kinds of attachment, but still he became so influenced by the desire for procreation that he married with Sati. He enjoyed a blissful married life for a very long time.\" \"Rudra father in law, Daksha in his arrogance started condemning his son in law -Rudra. Once, Daksha organised a grand yagya ceremony. He gave invitation to everybody except Rudra and Uma. Despite of Rudra's disinclination to allow Sati to go to her father's yagya, She insisted and ultimately she was successful in convincing Rudra, to allow her to go.\" \"When Sati reached there, she was not given respect by her father-Daksha. Not only this, Daksha made fun of Rudra. Feeling dishonoured, Sati gave up her life by jumping into the sacrificial fire.\" \"When Rudra got the news of Sati's death he became extremely furious. To take revenge, he created Veerbhadra from his locks of hair. Veerbhadra went to Daksha place and destroyed his oblation site. He severed Daksha's head. All the deities became afraid and prayed to Rudra, to have mercy. Rudra then brought back Daksha to life and helped him the accomplished of the still incomplete Yagya. The site where Sati had died later on became famous as Jwalamukhi devi.\" \"The same Sati in her next birth was born as Parvati to Himalaya. By her tremendous penance she again got lord Shiva as her husband. After that lord Brahma told Narada about the manifestation of Kama - the god of love. ", "next": "5.2.24", "prev": "5.2.22", "title": "Shiva goes to Kailash"}