{"index": "5.2.19", "image": "resized_images/Creation.png", "text": [" Preaching Narad on the essence of Shivatattva, Brahmaji said- \"With the permission of Shiva, I created the five basic elements from which the matter is made and also all types of arts.", " I also created the time.", " Despite all these creations, I was not satisfied.", " I created sage Marichi from my eyes, Sage Bhrigu from my heart, Sage Angira from my head, Sage Pulaha from my Vyan Vayu, Sage Pulatsya from my Udan Vaya, Sage Vashishth from my Saman Vayu, Sage Kratu from my Apan Vayu, Sage Atri from my ear, Daksha Prajapati from my vital air You (Narad ) manifested from my lap.", " Sage Kardam and Dharma manifested from my Shadow.", " Then I divided my body into two parts, and from each of the two parts.", " Manu and Shatarupa manifested respectively.", " Both of them got married and in this way commenced the conjugal creation.", " Priyavrata and Uttanpad were the two sons born to them.", " Shatarupa also gave birth to three daughters whose names were Aakuti Devahuti and Prasuti.", " Sage Ruchi was married to Aakuti, Sage Kardam was married to Devahuti and Daksha Prajapati was married to Prasuti.", " Sage Yagya and Dakshina were born to sage Ruchi and Aakuti.", "\" \"Numerous daughters were born to sage Kardam and Devahuti.", " Similarly twenty-four daughters were born to Daksha and Prasuti.", " Daksha married thirteen of his dhauthers to Dharma.", " The rest of his daughters were married to sages like Pulastya etc.", " All the three worlds are inhabited by the progenies of these sages.", " The same Daksha Prajapati had sixty daughters in another Kalpa, who were married to sages like Kashyap.", " Etc.", " In this Kalpa, 'Sati was one of his daughters who was married to Lord Shiva.", " 'Sati' being distressed by the disrespect sown by her father-Daksha, to her husband-Shiva, had given up her life, by jumping into the sacrificial fire.", " In her next birth she was born as Parvati and was again married to Shiva.", " This way, I created this world with the permission of Shiva.\" "], "next": "5.2.20", "prev": "5.2.18", "title": "Creation"}