{"index": "5.2.145", "image": "resized_images/Battle Between Lord Shiva and Andhak.png", "text": " Andhak had become so arrogant that once, he even dared to dishonour his own mother-Parvati, who at that time was living at the Mandarachal mountain. Shiva became very furious with him. Andhak attacked Shiva with his huge army. Lord Shiva sent his numerous ganas to fight him, but all of them were killed by Andhak. When lord Shiva got the news of the arrival of Andhak with his army, he sent Lord Vishnu and his remaining ganas to fight him. He himself went to perform his austerity named 'Pashupat'. The deities fought with Andhak for one thousand years. Meanwhile Lord Shiva returned after completing his 'Pashupat Vrata' and joined them. Seeing Lord Shiva in front of him, Andhak became furious and attacked him ferociously. His companion, whose name was 'Vidhas', devoured all the deities. The demons who had been killed in the battle, were brought back to life by Shukracharya. Lord Shiva became very angry and swallowed Shukracharya. He also extracted the deities from the stomach of Vidhas who had been swallowed by him earlier. After that, lord Shiva attacked Andhak with his trident, which injured him. But from each drop of his blood which fell on the ground, manifested thousands of demons who resembled Andhak. Lord Shiva then instructed goddess 'Chandika' to drink the blood, while he killed all the demons. Goddess Chandika followed the instructions of Shiva and drank each drop of blood, which oozed out from the wounds of the demons and did not let single drop of blood to fall on the ground. After killing all the demons, lord Shiva lifted Andhak with his trident and hanged him between the earth and sky. Andhak remained there for a very long period of time, bearing the heat of the sun and the showers of rain. But he remained alive. Ultimately he had to take the refuge of Lord Shiva, to save his life. Lord Shiva became pleased by his eulogy and made him his 'Ganadhees' (leader of all the Ganas). ", "next": "5.2.146", "prev": "5.2.144", "title": "Battle Between Lord Shiva and Andhak"}