{"index": "5.2.113", "image": "resized_images/Ganesha’s Marriage.png", "text": [" Both Kartikeya and Ganesha grew up to become handsome youths in due course of time.", " Shiva and Parvati started to think about their marriage.", " When Ganesha and Kartikeya came to know about the plan of their marriage both of them started quarreling among themselves as to who should get married first.", " Lord Shiva and Parvati devised a plan to sort out this problem.", " They told them that whoever between them return after circumambulating the earth, will get married first of all.", " Kartikeya and Ganesha agreed.", " Kartikeya proceeded on his journey to circumambulate the earth.", " Ganesha was very intelligent.", " He requested his parents - Lord Shiva and Parvati;", " to sit at a place together and circumambulated them for seven times and said- \"According to Veda, Circumambulating one's parents give virtues equivalent to that of circumambulating the whole earth.", " So now you must get me married first.", "\" Lord Shiva and Parvati were very impressed by his intelligence.", " They decided to get him married with Siddhi and Riddhi-the daughter of Vishwaroop Prajapati.", " In due course of time two sons were born to them Kshem and Labh.", " While Kartikeya was returning after circumambulating the whole earth, he met sage Narad on the way.", " He told Kartikeya about Ganesha's marriage.", " Kartikeya became very sad and felt like having been cheated by their parents.", " When Kartikeya reached Kailash mountain he made salutations to lord Shiva and Parvati and without saying anything, went to Kraunch mountain to do his penance.", " Parvati was very sad.", " She went to Kraunch mountain to meet Kartikeya accompanied by Shiva.", " When Kartikeya saw them coming he moved to another place.", " Lord Shiva and Parvati followed him and ultimately met him.", " Both these places have religious significance.", " Having a darshan of Kartikeya on the full moon day of Kritika nakashatra is considered to bestows immense auspicious and destroyes all the sins of a man. "], "next": "5.2.114", "prev": "5.2.112", "title": "Ganesha’s Marriage"}