{"index": "5.2.22", "image": "resized_images/Shiva Blesses Gunanidhi.png", "text": " \"During the Padma kalpa, Sage Vishrawa was born to sage Pulastya- the manasputra of lord Brahma.\n Vishrawa's son - Vishrawan ruled over Alkapuri for a long time.\n This city was constructed by the deity Vishwakarma.\n Vishrawan was a great devotee of Lord Shiva.\n\" \"During the kalpa named Meghawahan, Gunanidhi did a tremendous penance for ten lac years.\n As a result of this penance his body was reduced to skelton.\n\" \"Lord Shiva became very pleased with him and appeared before him, accompanied by his consort Parvati.\n He told Gunanidhi to ask for any boon, which will be fulfilled.\n\" \"When Gunanidhi heard Shiva's Voice he opened his eyes, but his eyes were dazzled by the sheer radiance of lord Shiva.\n He requested Shiva to restore the power of sight in his eyes.\n Shiva blessed him, as a result of which he was now able to see the divine sight of lord Shiva.\n But he became jealous of Uma, who was present by the side of Shiva.\n He was wondering as to who was this lady, dearer to Shiva than him.\n He glanced cruelly towards her.\n As a result of this his left eye lost the power of sight.\n\" \"Parvati asked lord Shiva as to why was this sage (Gunanidhi) looking cruelly towards her.\n Shiva replied- \"He is none other than your son.\n He is looking at you in astonishment as he his bewildered at the feats achieved your penance.\n\" \"Lord Shiva then blessed Gunanidhi to become the king of the kings.\n He also assured him that he will always be present in the vicinity of Alkapuri.\n After being blessed by Shiva, Gunanidhi also made salutations to Parvati.\n Parvati said- \"Since you have looked at me angrily your hatred and enemity (Bair) towards me was clearly visible.\n For this reason you will be known as Kubers.\n\" After blessings, Gunanidhi both Shiva and Parvati to a place called Vaishveshwar.\n Kailash mountain was situated near AlkaNagri. ", "next": "5.2.23", "prev": "5.2.21", "title": "Shiva Blesses Gunanidhi"}