{"index": "5.2.122", "image": "resized_images/Battle Between Jalandhar & The Deities.png", "text": " One day Sage Bhrigu came to meet Jalandhar. After receiving him with due respect Jalandhar asked him as to who severed the head of Rahu. Sage Bhrigu then told him about Hiranyakashipu who was the maternal uncle of Rahu. Sage Bhrigu also told him about Virochana - the son of the extremely charitable king Bali. Then sage Bhrigu narrated the tale connected with the churning of ocean and how ambrosia emerged from the churning of the ocean. Sage Bhrigu told Jalandhar how Rahu's head was severed by lord Vishnu, while he was sitting among the deities and at the time when ambrosia was being distributed to all the deities. Jalandhar became very furious after hearing this story. He summoned one of his messengers whose name was Ghasmar and instructed him to go and ask Indra, as to why had he misappropriated all the wealth of his father (Sea) which emerged during the churning of Sea. He also instructed Ghasmar to warn Indra about the dire consequences unless he takes his (Indra's) refuge. But Indra sent back Ghasmar without any specific assurance. This action of Indra made Jalandhar more angry than before. He collected his army and attacked Indra. A fierce battle was fought between his army and the army of the deities. Many warriors got killed from both the sides. Shukracharya the guru of the deities brought back the dead warriors from the demon side back to life by his mritasanjivani vidya. Similarly Sage Vrihaspati brought back the dead warriors from the deities side back to life with the help of medicinal herbs. When Shukracharya saw that, sage Vrihaspati too was successfully making the dead deities alive, he instructed Jalandhar to submerge the Drongiri mountain into the sea, so that it becomes impossible for Vrihaspati to get the medicinal herbs by the help of which he made the dead deities alive. Jalandhar obeyed the command of Shukracharya and by lifting the Drongiri mountain submerged it into the sea. The deities became demoralized and fled from the battle field Jalandhar captured Indrapuri. ", "next": "5.2.123", "prev": "5.2.121", "title": "Battle Between Jalandhar & The Deities"}