{"index": "5.3.32", "image": "resized_images/The Twelve Jyotirlingas.png", "text": [" Describing about the twelve Jyotirlingas, Sutji told the sages:", "- \"There are twelve Jyotirlingas which are as Follows :", " 1) Somnath in Saurashtra, 2) Mallikarjuna in SriShail, 3) Mahakal in Ujjain, 4) Amareshwar in Omkar, 5) Kedar in the Himalaya, 6) Bheemashankar at the bank of Bheema river.", " 7) Vishwanath in Varanasi.", " 8) Trayambakeshwar ar the bank of Gautami river, 9) Baidyanath at Chitabhumi, 10) Nagesh which is situated between Darukvan dwarika and Bhet dwarika 11) Rameshwar at Betubandh and 12) Dhushmesh in Shivalaya.", " These above mentioned twelve Jyotirlingas are considered to the very sacred.", " A devotee who pays a visit to any of these places and worship, gets all of his wished fulfilled.", " Out of these twelve Jyotirlingas, Somnath Jyotirlinga is belived to destroy the sorrows of Moon.", " A devotee who worships this Jyotirlinga gets cured from incurable diseases like leprosy etc.", " enjoys all kinds of worldly pleasures and attains salvation.", " Similarly having a darshan of Mallikarjuna helps a devotee to fulfill all of his desires.", " Having a darshan of Mahakaal at Ujjain helps a devotee to fulfill all kinds of desire and achieve salvation.", " Similarly if a devotee merely touches the idol of Omkar linga then he achieves the desired fruits.", " Kedarlinga is situated in the Himalayas and is considered to be very sacred.", " Lord Shiva took his sixth incarnation as Bheema Shankar to kill the demon Bheema.", " This incarnation of Shiva tool place at a place called Kamarupa in Assam.", " The seventh incarnation of lord Shiva was as Vishwanath at Kashi.", " This Jyotirlinga is considered to be very sacred and fulfiller of all the desires of a man.", " Lord Shiva took his eighth incarnation at the bank of river Gautami at the request of sage Gautam.", " This Jyotirlinga too is considered to be very sacred and a fulfiller of all the desires of a man.", " The ninth incarnation of Shiva was as Baidyanath at Deoghar in Bihar.", " This Jyotirlinga was established by the demon King Ravana.", " A devotee who worships this Jyotirlinga gets all of his wishes fulfilled.", " Because of this, it ia also known as Kamanalinga.", " Devotees carry the holy water of the Ganges from Sultanganj and both the idol of Baidyanath in the months of Shravan and Bhadrapaksha according to the Hindu calendar.", " Lord Shiva took his tenth incarnation to kill the demon Daruk who used to live in Daruk forest.", " A devotee who worships Nagesh, never faces any calamity.", " The eleventh incarnation of lord Shiva was as Rameshwar linga, this linga was established by Sri Ram while the construction of a bridge over the sea was going on.", " Having a darshan of this Jyotirlinga bestowes both worldly pleasures and salvation.", " Lord Shiva took his twelfth incarnation as Dhumeshwar after being pleased by Dhushma - the wife of Sumedha.", " Having a darshan of this Jyotirlinga helps a devotee to fulfill all of his desires.", " All the above mentioned twelve Jyotirlingas are very sacred and give total accomplishment to the devotees. "], "next": "5.4", "prev": "5.3.31", "title": "The Twelve Jyotirlingas"}