{"index": "5.3.9", "image": "resized_images/Nandikeshwar.png", "text": " While describing about the incarnation of Nandikeshwar Sutji says- Sage Shilad did a tremendous penance to please lord Shiva with an aspiration to have a son.\n Lord Shiva appeared before him and asked him to demand any boon he wished.\n Sage Shilad expressed his desire of having a son who is not born from a physical body and who is proficient in all the sriptural knowledges.\n Lord Shiva blessed him by saying – 'So be it'.\n Sage Shilad then returned to his hermitage and performed a 'Yagya'.\n From the yagya-kunda appeared a child who possessed four arms and three eyes.\n Sage Shilad was very pleased to see that child.\n The birth of the child was celebrated with great fanfare.\n Lord Shiva and Parvati arrived to bless the child.\n The child was named Nandi as his birth had given immense joy (anand) to sage Shilad.\n Later on Nandi lived with his father like any other normal child and was brought up with great love and care.\n He became proficient in all the scriptures within seven years.\n Being inspired by lord Shiva, two brahmins came to sage Shilad and informed him that after one year Nandi would be no more.\n Sage Shilad became extremely sad.\n Seeing his father in his sorrowful mood, Nandi consoled him and later on went to do penance.\n His tremendous penance pleased Lord Shiva and Parvati and both of them appeared before him.\n Lord Shiva blessed him and said- “You are just like me, so you will never die”.\n Lord Shiva also gave one of his garlands to him.\n As soon as Nandi wore that garland he imbibed all the qualities of lord Shiva.\n After that Lord Shiva took out some water from his locks of hair and sprinkled on him, as a result of which five rivers came into existence.\n These five rivers were later on came to be known as Panchanad.\n Lord Shiva then made him the leader of all his ganas.\n Later on goddess Parvati took Nandi under her guidance and considered him just like her own son.\n Nandi was married to Suyasha- the daughter of Marut.\n Ultimately all of them accompanied lord Shiva to his abode. ", "next": "5.3.10", "prev": "5.3.8", "title": "Nandikeshwar"}