{"index": "5.3.25", "image": "resized_images/Shiva’s Incarnation as Krshna Darshan.png", "text": [" King Nabhag was born in the nineth geneology of Shraddhdeva who himself was a descendant of Ikshavaku.", " Nabhag was the grandfather of Ambareesh.", " During his childhood Nabhag left his home for 'gurukula to get education.", " In his absence his brothers got the wealth of the kingdom distributed among themselves.", " When Nabhag returned home after the completion of his education, he demanded his share of wealth from his brothers.", " His brothers told him that they had forgotten to fix his share as he was absent at the time when wealth was being distributed.", " They advised him to go and meet their father.", " Nabhag went to his father and made the same request.", " His father advised him to go to sage Angiras who was trying to accomplish a yagya, but was not being able to accomplish it because of his attachment.", " “Go and try to eliminate his attachment by your discourses.", " This way sage Angiras on being pleased with you would give all the wealth which remains after the completion of the yagya.", "” Said his father.", " Nabhag did the same.", " He went to the place where sage Angiras was performing his yagya.", " He preached sage Angiras on the virtues of Religiousness.", " As a result he became free from all sorts of attachments and the yagya was successfully accomplished.", " Sage Angiras was very pleased by Nabhag's knowledge of religion.", " He gave all the remaining wealth of the yagya to Nabhag.", " Just then lord Shiva arrived there in his incarnation of Krishna darshan and tried to prevent sage Angiras from donating the wealth to Nabhag, instead he staked his own claim.", " Nabhag told lord Shiva that, since the wealth was given to him by sage Angiras himself, it naturally belonged to him.", " Lord Shiva then sent Nabhag to his father- Shraddhdev to know about his opinion.", " Nabhag went to Shraddh deva who revealed to him that the person who was staking his claims on the wealth was none other then lord Shiva.", " He also told him that whatever remained after the accomplishment of the yagya belongs to lord Shiva only.", " Nabhag was now satisfied.", " He went back to lord Shiva and narrated everything what his father had said.", " He then eulogized and worshipped lord Shiva.", " Lord Shiva blessed him which helped Nabhag to attain salvation. "], "next": "5.3.26", "prev": "5.3.24", "title": "Shiva’s Incarnation as Krshna Darshan"}