{"index": "5.3.8", "image": "resized_images/Various Incarnations of Vyasa and Lord Shiva.png", "text": " During the 'Varah' Kalpa of the Seventh 'Manvantar' lord Vishnu illuminated all the three world by his divine presence. This seventh Manvantara consisted of four yugas which repeated themselves in a cyclic way for twelve times. The first dwapar of this seventh manvantar saw the manifestation of lord Shiva for the welfare of the brahmins. When Kaliyuga arrived Lord Shiva again manifested himself along with goddess Shakti and was known as Mahamuni Shweta. Lord Brahma had the priviledge of becoming his disciple. During the second dwapar, sage Vyas existed as Satya, Prajapati and Lord Shiva became famous as 'Sutar'. Lord Shiva in his incarnation of Sutra had many disciples among whom 'Dundubhi' was very famous. During the third dwapar sage Vyas took his incarnation as Bhargava and lord Shiva became famous as Daman. Lord Shiva in his incarnation as Daman had four disciples among whom Vishoka was very famous. When Kaliyuga arrived after this third dwapar. Lord Shiva along with his Disciples helped Sage Vyas. During the fourth Dwapar Sage Vyas took his incarnation as Angira and Lord Shiva as 'Suhotra'. Even in this incarnation Lord Shiva had four disciples among whom Sumukh was very famous. Lord Shiva along with his disciples helped Angira. During the fifth dwapar sage Vyas took incarnation as Savita and Lord Shiva as 'Kanka' who was very famous for his tremendous austerities. Kanka had four disciples among whom Sanak was very famous. During the sixth dwapar sage Vyas took incarnation as Mrityu and Lord Shiva as 'Lokakshi'. Lokakshi had four disciples among whom Sudhama was very prominent. During the seventh dwapar sage Vyas manifested himself as Indra and Lord Shiva as Jaigisatya. Jaigisatya had four disciples among whom Saraswat was very prominent. During the eighth dwapar sage Vyas took incarnation as Vashishth and Lord Shiva as Dadhivahan. Dadhivahan had four disciples among whom Kapil was very famous. During the nineth dwapar sage Vyas took incarnation as Saraswat and Lord Shiva as 'Rishabh'. Lord Shiva in his incarnation as Rishabhdeva had four disciples among whom Parashar was very famous. ", "next": "5.3.9", "prev": "5.3.7", "title": "Various Incarnations of Vyasa and Lord Shiva"}