{"index": "5.3.18", "image": "resized_images/Shiva’s Incarnation as Durvasa.png", "text": " Describing about the Lord Shiva's incarnation as Durvasa, Sutji told the deities:\n- “once Atri – the manasputra of lord Brahma went to do penance at the bank of the river Nivindhya which flew by the foothills of Trayakshakul mountain as per the instructions of Lord Brahma himself.\n He commenced doing a tremendous penance.\n The effects of his penance was such that devastating flames of fire manifested from his head.\n The fire spread in all the three world in no time.\n The deities were terrified by the death and destruction caused by the fire in all the three worlds.\n They went to lord Brahma to seek his help.\n Lord Brahma took them to lord Vishnu and revealed to him about the destruction caused by the fire.\n All of them went to lord Shiva and told him everything.\n Lord Brahma, Lord Vishnu and Lord Shiva went to Atri and blessed him.\n Atri recognized them.\n He eulogized them.\n Later on Atri's wife- Anusuya gave birth to three sons, who in fact were the incarnations of Lord Brahma, Lord Vishnu and Lord Shiva.\n Lord Brahma incarnation as the Moon, Lord Vishnu as Dutt and Shiva took incarnation as Durvasa.\n Durvasa had tested the religiousness and virtuosity of numerous people.\n He had also tested the religiousness of king Ambareesh, who ruled over 'Saptadweepa'.\n Once king Ambareesh had observed a fast on 'Ekadashi'.\n Next day, when he was about to break his fast sage Durvasa arrived accompanied by his large number of disciples.\n Durvasa was very furious with king Ambareesh.\n He said- “You had invited me for this particular, but you have also insulted me by breaking the fast by drinking water in my absence.\n” Sage Durvasa would have burnt king Ambareesh to ashes by his curse, had not Sudarshan-the weapon of Vishnu came to his rescue.\n Sudarshan then tried to burn sage Durvasa when suddenly a heavenly voice was heard from the sky which said- “Durvasa is no one but the incarnation of lord Shiva himself.\n” Hearing this Sudarshan's anger was pacified.\n King Ambareesh then begged his forgiveness from sage Durvasa. ", "next": "5.3.19", "prev": "5.3.17", "title": "Shiva’s Incarnation as Durvasa"}