{"index": "5.4.4", "image": "resized_images/The Brahmin Woman Attains to Heaven.png", "text": " Once upon a time, there lived a brahmin at a place called 'Karni' situated at the bank of river 'Reva'.\n When the brahmin became old, he went to Kashi after leaving behind his wife to live with his sons.\n After sometime the brahmin died.\n When the brahmins sons came to know about his death, they went to Kashi and performed his last rites.\n After some days the brahmins woman died too.\n The Brahmin's son - Suvas again went to Kashi carrying the ashes of their dead mother as per her own wish.\n On his way, Suvad became a guest of another brahmin.\n Suvad witnessed an amazing even in the night, in which he saw his host trying to milk the cow.\n At first he allowed the calf to drink the cow's milk for sometime.\n His host then moved away the calf from the cow.\n The calf was still hungry and was not willing to move away from the cow.\n The brahmins trashed the calf very badly.\n This made the cow very sad and vowed to teach that wicked brahmin a lesson.\n The calf tried his best to convince his mother against doing this as her action might make her commit the gravest of sins - the brahmahatya.\n But the cow was not worried, as she knew the method of nullifying that sin.\n Suvad was surprised that the cow knew the method of nullifying the sin of brahmahatya.\n Next morning, the brahmin entrusted the job of milking the cow, the brahmins' son gave a severe trashing to the calf who was unwilling to move away from his mother.\n The angry cow lifted the Brahmin's son with her horns and dashed him against the ground.\n The Brahmin's son died on the spot.\n When the brahmin returned to his home he became very furious on seeing his son dead.\n He drove both the cow and the calf out of his house, after beating them very badly.\n The colour of the cow had turned blue due to the trashing she got from her brahmin.\n The cow went to the temple of Nandikeshwar, situated at the bank of river Narmada.\n To neutralize the sin of Brahmahatya she took dip in the water of river Narmada for three times.\n As a result she regained her original colour.\n Suvad had followed the cow all along the way.\n He was amazed to see the cow regaining her original colour.\n He proceeded on his further journey towards Kashi.\n He met a beautiful lady on the way who enquired as to where was he going.\n Suvad told her that he was going to immense the ashes of her mother in the holy water of the river Ganges.\n The lady advised him to immerse the ashes in the water of Narmada itself, as the holy Ganga herself comes to meet Narmada on the seventh day of Vaishakh every year.\n \"Today is the same auspicious day when the holy Ganga will be coming to meet Narmada.\n\" Said the beautiful woman.\n She also told him that immersing the ashes in the waters of Narmada would help his mother to attain to the divine abode.\n This beautiful lady was none other than Ganga herself.\n After advising Suvad she disappeared.\n Suvad followed the instruction of that beautiful lady.\n He immersed the ashes in the waters of Narmada.\n He saw his mother attaining a divine body.\n His mother blessed Suvad and then attained to the abode of Lord Shiva. ", "next": "5.4.5", "prev": "5.4.3", "title": "The Brahmin Woman Attains to Heaven"}