{"index": "5.4.13", "image": "resized_images/The Origin of Bheema Shankar.png", "text": [" Bheema - the demon, was the son of Kumbhakarna and Karkati.", " After Kumbhakarna was killed by Sri Ram.", " Karkati and Bheema went to live at Sahya mountain.", " When Bheema grew up he asked Karkati about his father.", " Karkati told him that his father had been killed by Ram.", " Bheema swore to avenge his father's death.", " He did a tremendous penance to please lord Brahma.", " Brahma appeared before him and blessed him with insurmountable power and strength.", " Bheema then drove out the deities from heaven.", " He went to Kamarupa and defeated the king.", " He captured the king and put him in prison.", " The helpless king used to pass his time by chanting the mantra- Om Namah Shivay.", " His wife worshipped the Parthiva linga of Shiva for the release of the king.", " All the deities went at the bank of river Mahakeshi and worshipped the Parthiva linga of lord Shiva.", " Lord Shiva appeared before them and assured them that the end of Bheema was near.", " Lord Shiva went to the king who had been held captive by Bheema.", " His ganas too accompanied him.", " All of them waited for the opportune time to kill Bheema.", " Meanwhile somebody informed Bheema that the king was doing worship of Shiva in the prison, with the objective of getting Bheema killed.", " Bheema arrived at the spot in the prison where the king was worshipping the Parthiva linga of Lord Shiva.", " He made fun of Shiva and struck the Shiva linga with his sword.", " Right then, Lord Shiva appeared.", " A tremendous battle was fought between both of them.", " The battle continued for a long period.", " Sage Narad requested lord Shiva to kill Bheema as soon as it was possible.", " Lord Shiva produced fire by his loud roar.", " In a very short time the fire spread in the whole forest.", " All the demons including Bheema were burnt to death.", " The deities and the sages arrived there.", " They requested Lord Shiva to remain there.", " Lord Shiva accepted their request and established himself in the form of Bheema Shankar Jyotirlinga. "], "next": "5.4.14", "prev": "5.4.12", "title": "The Origin of Bheema Shankar"}