{"index": "5.4.28", "image": "resized_images/Different Stages of Liberation.png", "text": [" Regarding the different stages of liberation, Sutji told the sages that there were five stages of liberation capable of freeing a man from the sorrows of this world.", " 1) Sarupya (Similitude with the Almighty), 2) Salokya, 3) Sannidhya (living in the proximity of the almighty), 4) Sayujya (getting united with the almight), 5) Kalvalya (Devotion towards God) Only lord Shiva is capable of bestowing liberation.", " One can attain dharm (virtuosity), Artha (Wealth) and Kaam (desires and wishes) by the worship of other deities, but lord Shiva bestowes all the four of them.", " Lord Brahma is believed to be the master of the three elementary qualities i.", "e.", " Sat, Raja and Tama.", " Shiva is beyond these qualities and even the nature itself.", " He is formless.", " Lord Shiva is a mystery which remains unsolved even though many sages and even lord Brahma have tried to solve this mystery called Shiva.", " The fifth stage of liberation is called Kaivalya which is attained by having complete devotion towards lord Shiva.", " In the present era of Kali, where the attainment of self knowledge is very difficult, devotion is relatively an easier path.", " Even devotion has been categorised into two types:", " a) Sagun (With form) b) Nirguna (Formless) If man worships lord Shiva with total devotion he attains self knowledge.", " Each and every objects of this world is nothing but the manifestation of Shiva's power.", " The creation achieves expansion only when he desires.", " Shiva is omniscient but himself invisible.", " Just as the fire, which already exists in the wood but is visible only after it is rubbed, similarly only the 'Gyanis' can experience lord Shiva even though he is omnipresent.", " Just as there is no difference between cause and effect, but is appears so due to our ignorance, similarly an ignorant man can never experience the omnipresent Shiva by his sense organs.", " The living things possess ego but lord Shiva is egoless.", " A man can successfully subjugates his ego by becoming knowledgeable and attains liberation after uniting with lord Shiva.", " This knowledge was received by lord Vishnu from Shiva.", " Lord Vishnu later on revealed it to lord Brahma and Brahma in turn revealed it to his manasputra - Sanak, etc;", " The manasputra revealed this knowledge to Narad and Narad revealed it to Vyas. "], "next": "5.5", "prev": "5.4.27", "title": "Different Stages of Liberation"}