{"index": "5.4.15", "image": "resized_images/The Origin of Trayambakeshwar.png", "text": " During the ancient time there lived a famous sage named Gautami.\n The name of his wife was Ahilya.\n Once it did not rain for one hundred years as the result of which the whole area was affected by drought.\n Sage Gautami did a tremendous penance to please Varun appeared before Gautam, he was requested to cause rain.\n But Varun expressed his inability in causing rain.\n He told Gautam to please lord Shiva so that his wish could be fulfilled.\n Later on Varun instructed Gautam to dig a up a pit, which he (Varun) filled with water.\n Varun blessed Gautam by saying that this pond would never dry up.\n The sages who had abandoned that place returned there.\n Everybody became happy and satisfied.\n One day, sage Gautam instructed his disciples to fetch some water from that pond.\n When the disciples reached there, they found the wives of numerous sages present at the bank of the pond.\n The sages' wives did not allow them to take water and instead they rebuked them.\n The disciples returned back to the hermitage and narrated the whole story to sage Gautam.\n Ahilya pacified the angry disciples and went to the pond to fetch water.\n From that day onwards this became very daily routine.\n One day Ahilya met the wives of the sages.\n They tried to prevent her from fetching water.\n Not only that they went back to his respective hermitages and filled the ears of their husbands.\n All the sages became very angry.\n The sages worshipped lord Ganesha to please him.\n When Ganesha appeared, they requested him to drive Gautam out from that place.\n At first Ganesha was reluctant to accept their demand but when they kept a persisting he agreed at last.\n Ganesha entered the field of Gautam in which barley was being cultivated.\n Ganesha had disguised himself as a cow.\n He started grazing the barley crops.\n When Gautam saw the cow grazing crops, he tried to drive her out from the field by hitting a grass on her back.\n The artificial cow died instantly.\n Gautam was very sorry for his act.\n Meanwhile all the sages from the surrounding area arrived there.\n They forced Gautam to abandon that place at once.\n Gautam left that place and made his hermitage at a little distance from there.\n One day he came to the sages and asked them as to how could he atone for his sins.\n The sages told him that his sins could be atoned only when he circumambulates the whole earth thrice, all the while saying, 'I have killed a cow'.\n They also told him that after that he would have to perform austerities for one month.\n If this is not possible then you will have to help Ganga manifest herself and take bath in her water.\n Otherwise you will have to worship three crores Parthiva lingas.\n Only then, you can get liberated from the sin of killing a cow,\" said the sages.\n Gautam made the Parthiva lingas and started worshipping them.\n Lord Shiva became very pleased by his devotion and appeared before him.\n Sage Gautam requested lord Shiva to liberate him from the sins of killing a cow.\n He also requested lord Shiva to manifest the stream of river Ganga that place.\n Lord Shiva tried his best to make him understand that he was innocent and the real culprits that he was innocent and the real culprits were those wicked sages.\n But, Gautam was unconvinced.\n At last lord Shiva instructed Ganga to appear in the form of a woman.\n Gautam eulogized Ganga.\n By the blessings of lord Shiva Gautam was liberated from his sins of killing a cow.\n After that Ganga expressed her desire to go back but lord Shiva asked her to remain on the earth till the twenty-eighth nanvantar.\n Ganga accepted to do that, on the condition that Lord Shiva along with Parvati too would remain present on the earth.\n Lord Shiva established himself as Trayambakeshwar Jyotirlinga and Ganga became famous as Gautami Ganga. ", "next": "5.4.16", "prev": "5.4.14", "title": "The Origin of Trayambakeshwar"}