{"index": "5.4.17", "image": "resized_images/The Origin of Nageshwar Jyotirlinga.png", "text": " During ancient times, there lived a demon named Daruk. The name of his wife was Daruka. They used to torment the people living in that area. The residents of that area went to sage 'Aursh' and narrated about their miseries and requested him to end this menace. 'Aursh' assured them that very soon their hardships would come to an end. He then went to do his penance. The deities appeared before him after being pleased by his tremendous penance. Sage 'Aursh' requested the deities to kill the demons. The deities went to fight with the demons. The demons got scarred and started thinking about the means by which their lives could be saved. Daruka the wife of Daruk had received a boon from goddess Parvati due to which she had gained unparalleled power. She carried the whole forest and placed it in the middle of the sea. This way the demons again lived without being perturbed by the threat of the deities' attack. One day the demons saw many boats sailing in the sea, on which were many people on board. The demons made all the people captive. There was a man named Supriya who was great devotee of Lord Shiva. He used to worship lord Shiva daily, even though he saw held under captivity. Rest of the people too got influenced by his devotion and everybody started worshipping lord Shiva.This way, six months had passed. One day a demon saw Supriya worshipping the idol of lord Shiva. He went to Daruk and informed him. Daruk became extremely furious. He asked Supriya as to whom was he worshipping. Supriya still engrossed in his worship did not give any reply. This made Daruk even more angry. He tried to kill Supriya. Lord Shiva appeared and killed all the demons. Daruka's heart became full of grief at the news of her husband's death. She went to Parvati and told her how lord Shiva had killed Daruka. Parvati met lord Shiva and both of them decided to protect there respective devotees by establishing themselves at that place. Thus, Nageshwar jyotirlinga came into existence. ", "next": "5.4.18", "prev": "5.4.16", "title": "The Origin of Nageshwar Jyotirlinga"}