{"index": "5.4.27", "image": "resized_images/The Greatness of Shivaratri.png", "text": " There used to live a poor bheel named Gurudruha. He was very poor. One day finding no food available in his house, he went to the forest to hunt an animal. Unfortunately he did not find any animal which he could hunt. Being hungry, he sat down on the bank of a pond and pondered as to what would happen to his family members who were hungry too. He thought that if he waited there, then he might get a chance to kill a thirsty animal, which arrives there to drink water. Gurudruha climbed up a bael tree and waited for his prey. A Shivalinga was established just under that tree and co incidentally it was a Shivaratri day. When the first three hours of the night had passed, he saw a female deer arriving with her young ones. He got ready with his bow and arrow and aimed his arrow towards the female deer. By coincidence some leaves from that bael tree fell on the Shivalinga along with some drops of water from the vessel in which he was carrying water. Gurudruha had accomplished the worship of Shiva during the first 'Prahar' of the night unawaringly. After hearing the noise made by falling drops of water, the female deer looked up. She saw Gurudruha sitting with his bow and arrows. She asked him about his desire. Gurudruha told her that he wanted to kill her, so that he could feed his family members. The female deer requested him to allow her to go so that she could leave her young ones in the safe custody of her husband. She promised to come back. At first Gurudruha was reluctant but when the female deer started giving illustrations from the scriptures, he allowed her to go. Mean while the sister of female deer arrived there with her young ones. When Gurudruha sow her, he got ready to kill her. Suddenly his movements on the tree, made some leaves of bael and few drops of water to fall on the Shivalings. It was the second Prahara of the night and Gurudruha had again performed the worshiped of Shiva unawaringly. When the female deer (Second) heard the noise made by falling drop of water She looked up towards Gurudruha. She asked him about his desire. When Gurudruha told about his desire, she requested him to allow her to go so that she could hand over her young ones in the safe custody of her husband. Initially, Gurudruha was reluctant to allow her to go, but when she promised to return back, he allowed her to go. Gurudruha sat on the branches of the bael tree waiting for his prey. The second prahar of the night was coming to an end and the third prahar about to begin. The deer arrived there searching his wife and children. Gurudruha again made himself ready to kill that dear. Again some leaves and few drops of water fell on the Shivalinga. The worship of Shiva during the third Prahara had been accomplished by Gurudruha, though unawaringly. On hearing the noise made by the falling drops of water, the dear looked up and asked Gurudruha about his desire. Gurudruha told him about his desire. The deer requested Gurudruha to allow him to meet his wife and children for once. The deer promised to return back. After becoming satisfied by his intentions, Gurudruha allowed him to go to meet his family. Gurudruha sat on the bael tree waiting for the deers anxiously. The third prahar of the night was approaching its end and the fourth prahar was about to begin. Suddenly Gurudruha saw all the three deer's coming towards the pond. He became extremely pleased at the prospect of getting flesh of three animals. He got read with his bow and arrows. His movements on the bael tree again made some leaves and few drops of water to fall on the Shivaling. Gurudruha had successfully accomplished the worship of Shiva even during the fourth Prahar. Not only this he had also remained awake for the whole night of Shivaratri. The fast observed by Gurudruha on Shivaratri along with the worship of Shiva though unawaringly had made him on enlightened person. The thought of killing the deers remained no longer in his heart. He thanked all the deers for their help in his attainment of enlightenment. Lord Shiva became extremely pleased and appeared before him. He blessed Gurudruha that in his next birth he would get an opportunity to serve Sri Ram and would become famous as Nishad. Lord Shiva also told Gurudruha that by the blessings of Sri Ram he would attain salvation by the blessings of Sri Ram he would attain salvation. Sutji while describing about the virtues of observing fast on Shivaratri told the sages that if a fast observed unwaringly on Shivaratri gives such virtues then what could be said about a fast which is observed deliberately. According to Sutji such a fast would bestow both worldly pleasures and salvation. ", "next": "5.4.28", "prev": "5.4.26", "title": "The Greatness of Shivaratri"}