{"index": "5.4.19", "image": "resized_images/The Origin of Dhushmesh Jyotirlinga.png", "text": " There used to live a brahmin by the name of Sudharma, who belonged to the lineage of sage Bhardwaj.\n He was a great devotee of lord Shiva.\n Sudeha was his wife.\n Sudharma had no son.\n Sudeha desires for a son.\n She expressed her desire to Sudharma but he did not listen to her pleas.\n One day Sudeha had gone for an outing accompanied by her companions.\n Incidentally a quarrel ensured among them and her companions made fun of her issue less status.\n Sudeha became very sad.\n After returning to her hermitage, she narrated the whole incident to Sudharma.\n Sudharma meditated on the form of Shiva and threw two flowers, towards his wife.\n He thought that if Sudeha picks up the flower, which he had thrown with his right hand, then certainly a son would be born.\n But if she picks up the another flower then there is no chance of her giving birth to a son.\n Unfortunately Sudeha picked up the flower which Sudharma had thrown with his left hand.\n Sudharma told his wife that she was never going to become a mother.\n He advised her to dedicate her life in the devotion of lord Shiva.\n When Sudeha learnt that there was no chance of her becoming a mother, she insisted her husband to marry for a second time, so that he could become a father.\n But Sudharma refused to marry for the second.\n Sudeha brought her younger sister-Dhushma to the hermitage and married her with reluctant Sudharma.\n Dhushma proved to be a very faithful wife.\n She engaged herself in the service of Sudharma and Sudeha.\n She also used to worship the Parthiva-linga of Shiva daily.\n After her worship she used to immerse the Parthiva lingas in a pond.\n This way, when she had accomplished the worship of one lakh Parthiva lingas, lord Shiva blessed her with a son.\n Sudharma was extremely pleased but Sudeha became jealous of her own sister.\n When the child grew up, he was married to a beautiful brahmin girl.\n Dhushma instructed the bride to take a special care of Sudeha.\n So the bride engaged herself in the service of everybody.\n She took special care of looking into the needs of Sudeha.\n But still, Sudeha's jealousy did not diminish.\n One day engripped by excessive jealousy and anger, she killed Dhushma's son while he was asleep.\n She cut his body into many pieces and threw those pieces into the same pond, in which Dhushma used to immerse the Parthiva lingas.\n When the daughter in law noticed a piece of flesh on the bed she started crying.\n She went to Dhushma and narrated the whole story.\n Hearing the news of her son's killing, Dhushma too started crying Sudeha also wept artificially.\n Sudharma arrived there.\n Though he himself was very sad yet he instructed Dhushma to do the daily worship of Parthiva linga as usual.\n Dhushma obeyed the command of her husband, She worshipped the Parthiva lingas and went to the pond of immense.\n By the blessings of lord Shiva, her son was standing at the bank of the pond alive.\n He came towards his mother and said- \"Mother! I have become alive even after my death.\n\" Dhushma was still engrossed in her thoughts of lord Shiva, so she could not listen to her son.\n Lord Shiva appeared and blessed Dhushma.\n He also expressed his desire to punish her wicked sister - Sudeha for her evil deed, but Dhushma requested him to forgive her.\n She also requested lord Shiva to stay there forever.\n Lord Shiva accepted her demand and established himself in the form of Dhushmeshwar Jyotirlinga.\n Sudharma and Sudeha arrived at that place and worshipped Shiva. At last everybody returned home happily. ", "next": "5.4.20", "prev": "5.4.18", "title": "The Origin of Dhushmesh Jyotirlinga"}