{"index": "5.5.18", "image": "resized_images/Incarnation of Mahasarasvati.png", "text": " After being tormented by the demons Shumbha and Nishumbha, the deities went to goddess Parvati and requested her to protect them.\n Kaushiki manifested from the body of goddess Parvati.\n Goddess Kaushiki assured the deities and disappeared.\n By coincidence the attendants of the demons - Shumbha and Nishumbha, happened to see Kaushiki and became enchanted by her divine beauty.\n They went to Shumbha and Nishumbha and praised about her beauty.\n Both the demons sent a messenger to Summon her.\n Kaushiki asked the messenger to convey the message to the demons that only such a person can become her lord, who defeats her in a battle.\n The messenger returned and gave the message to Shumbha and Nishumbha.\n Both the demons were enraged.\n They sent a huge army to bring Kaushiki forcible, under the commandership of Dhumralochan.\n When Dhumralochan reached there, he told her about his master's command.\n Kaushiki gave the some reply that only such a person can become her master, who defeats her in a battle.\n Dhumralochan then tried to abduct her forcibly.\n Kaushiki gave a loud roar in her anger as a result of which Dhumralochan was burnt to death.\n The whole army was annihilated by her vehicle-lion.\n When Shumbha and Nishumbha learnt about the death of Dhumralochan and the destruction of his army, they sent many mighty demons like Chanda, Munda, Raktabeeja etc to fight her.\n But each of them got killed by goddess Kaushiki.\n Ultimately Shumbha and Nishumba themselves came forward to fight.\n Both of them attacked Kaushiki with volley of arrows.\n Kaushiki destroyed their whole army.\n The whole battle field became flooded with blood.\n After that Kaushiki killed Nishumbha with special types of arrows, which did not allow single drop of blood to fall on the ground.\n Angered by his brother's death, Shumbha attacked Kaushiks with his Various weapons, but she neutralized all of them.\n At last, she killed Shumbha with her trident. ", "next": "5.5.19", "prev": "5.5.17", "title": "Incarnation of Mahasarasvati"}