{"index": "5.6.6", "image": "resized_images/Last Rites of an Ascetic (Sanyasi).png", "text": " Kartikey told Sage Vamadev that an ascetic does not die but takes a Samadhi, therefore instead of being cremated he is buried.\n Therefore an ascetic must practice the art of Samadhi to perfection.\n If he has not yet perfected the art of Samadhi, then he should keep on practicing yoga till he attains mastery over the art of Samadhi.\n He should try to concentrate his mind on the Omkar mantra, which is eternal.\n If his body has become weak and feeble and incapable of doing physical exercises like Pranayama then he should indulge himself in Shiva remembrance.\n This way an ascetic can attain to heaven.\n After his death the rest of the ascetics should perform the rituals at his place of death for ten days.\n An alter should be constructed on the eleventh day.\n Five quadrangular mandals should be made facing towards the northern direction.\n In each of these mandas, deities like Deveshwari, Atiwahak etc.\n should be established first and then worshipped.\n The worship should be done as per the instruction of Guru by offering 'Prasada'.\n This Prasada should be, given to a virgin girl or cow, later on.\n The articles used in the process of worship should be immersed in the river or pond.\n In this way, the Parvan shraddh ceremony of the deceased ascetic is accomplished.\n It is worth nothing that 'Ekodishta' Shraddh is not performed after an ascetic death.\n After the completion of 'Parvan Shraddh' the ascetic should perform the Ekadashah Shraddh as per the instructions of their Guru.\n On the twelfth day, the ascetics should invite the brahmins, after getting up in the morning and taking their bath.\n These brahmins should be feeded.\n The ascetics should then take a vow to worship their Guru by holding a 'Kusha' grass in their hands.\n After that, they should wash the lotus feets of their Guru and worship him.\n Even the worship of Guru's teacher should be done.\n After the worship is over, the Guru should get up by saying 'Shubhamastu'- benediction to all.\n He should then sprinkle the purified rice by chanting mantras.\n At last donations should be made to the invited brahmins. ", "next": "5.7", "prev": "5.6.5", "title": "Last Rites of an Ascetic (Sanyasi)"}