{"index": "5.7.4", "image": "resized_images/Time – Calculation.png", "text": [" The smallest unit for measuring the time is called 'Nimesh'.", " The time taken to drop one's eyelid is called one Nimesh.", " A kala consists of fifteen Nimeshas and thirty Kalas make a 'Muhurta'.", " A day and a night consist of thirty 'Muhurtas'.", " A month consists of thirty days, divided into two fortnights.", " One fortnight is known as 'Krishna Paksha (dark lunar phase) and the other is known as Shukla Paksha (bright lunar phase).", " In Pitarloka the day consists of one fortnight and night of the same number of days.", " Shukla Paksha is the day of the Pitraloka and Krishna Paksha the night.", " One 'Ayana' consists of Six months.", " A year consists of two 'Ayanas'.", " One year of the earth is equivalent to a day and a night of the deities.", " The six months when Sun is in the southern hemisphere of the earth, is actually the time when the deities experience night.", " On the contrary, the six months when sun is in the northern hemisphere, is the day time of the deities.", " One year of the deities is equivalent to three hundred and sixty years of this world.", " The yugas are counted on the basis of the years of the deities.", " According to the scholars there are four yugas - Satyayuga, Tretayuga, Dwapar yuga and Kaliyuga.", " A satyayuga is equivalent to four thousand years of the deities.", " A Treta yuga is equivalent to three thousand years of the deities.", " Similarly a dwapar yuga is equivalent to two thousand years of the deities and a Kaliyuga to that of one Thousand years of the deities.", " This way all the four yugas collectively are equivalent to twelve thousand years of the deities.", " A Kalpa consists of one thousand Chaturyugas.", " A Manvantar consists of seventy one Chaturyugas.", " One Kalpa is inhibited by fourteen Manus one after another in succession.", " A Brahma's day is equivalent to one divine Kalpa.", " A Brahma's year is equivalent to one thousand Kalpas.", " A Brahma's yuga consists of eight thousand such years.", " A Brahma's ' Savan' consists of his one thousand yugas.", " Brahma's life span is complete after three thousand such Sawanas.", " Five lakh and forty thousand numbers of Indras succeed one after another during the whole life span of Brahma.", " A Vishnu day is equivalent to the whole life span of Brahma.", " The whole life span of Vishnu is equivalent to a day of 'Rudra'.", " The whole life span of Rudra is equivalent to a day of lord Shiva.", " In the whole life of lord Shiva five lakh and four thousand numbers of Rudras come and go.", " A Shiva's day commences with the creation and before the end of the night the whole creation gets annihilated. Sadashiva is eternal. "], "next": "5.7.5", "prev": "5.7.3", "title": "Time – Calculation"}