{"index": "5.7.22", "image": "resized_images/SanatKumar Receive Shiva-Gyan from Nandi.png", "text": " The sages thanked Vayudeva for giving the knowledge of Gyan-Yoga. The next day, they took bath in river Saraswati and performed their worship and rituals. After that they proceeded towards Kashi. At Kashi after taking their bath in river Ganga they had a darshan of lord Vishwanath. They saw very radiant effulgence appearing in the sky, in which they saw thousand sages who had accomplished Pashupat Vrata getting merged. The radiant effulgence vanished in no time. The sages were very curious to know about that radiant effulgence, so they went to lord Brahma and asked him about it. Lord Brahma told them that the radiant effulgence had actually instructed them to accomplish Pashupat Vrata and attain Salvation. Lord Brahma then instructed them to go to the Sumeru mountain where Nandi was supposed to come and teach the methods of doing Pashupat Vrata to Sanat Kumar. Once Sanat Kumar became very arrogant of his asceticism. One day lord Shiva arrived at his place but Sanat Kumar did not get up to greet him. At this Nandi became furious and cursed him to become a camel. Sanat Kumar got transformed into a camel. Lord Brahma worshipped Shiva to liberate his son - Sanat Kumar from the curse. Lord Shiva became pleased and blessed Sanat Kumar, as the result of which he regained his human body. After regaining his human body Sanat Kumar commenced a tremendous penance. Lord Shiva instructed Nandi to go to Sumeru mountain and preach Sanat Kumar. The sages reached Sumeru mountain as per the instruction of lord Brahma. They saw many sages meditating at the bank of a pond. They also saw Sanat Kumar engrossed in his meditation at a little distance from the other meditating sages. The sages went near Sanat Kumar and told him about their penances done for ten thousand years. They also revealed to him about the purpose of their arrival. Right then, Nandi arrived there, accompanied by his ganas Sanat Kumar and all the sages welcomed him. Sanat Kumar introduced all the sages to Nandi and told him about their tremendous penance done for ten thousand years. Nandi became very pleased and blessed them. He then preached Sanat Kumar and all the sages on the Shiva-tattva. Sanat Kumar passed on that knowledge to Sage Vyas, who again passed it on to Sutji. Sutji then revealed this knowledge to those sages who had assembled at Prayag. After receiving that knowledge from Sutji all the sages went to Prayaga teertha and took their bath. As they saw the signs of approaching Kaliyuga, they went to Kashi and performed the Pashupat Vrata. All of them attained liberation with the blessings of Lord Vishnu. Listening to Shivapuran for one time liberates a man from all of his sins. Listening to it for two times helps him to develop devotion in lord Shiva. Listening to Shivapuran for three times, helps a man to attain to the abode of Shiva. ", "next": "6", "prev": "5.7.21", "title": "SanatKumar Receive Shiva-Gyan from Nandi"}