{"index": "5.7.7", "image": "resized_images/Pashupat Vrata and its Rituals.png", "text": [" Pashupat Vrata has been mentioned even in the Atharvasheersha Upanishad.", " It begins on the full moon day, in the month of Chaitra.", " It can be performed anywhere - a Shiva temple, any sacred place of pilgrimage, forest or garden.", " A devotee should get up early in the morning, on the thirteenth day of bright lunar phase (two days preceding the full moon day) and after finishing his daily duties he should make salutations to his Guru.", " With the permission of his guru, the devotee should then put on while coloured clothes and a sacred thread of the same colour.", " He should also wear a white garland around his neck and apply sandal wood paste on his body.", " He should then sit on the seat made of Kusha grass and take a vow by holding a Kusha grass in his hand.", " After this he should do Havana by offerings articles into the sacred fire.", " He should observe a fast for the whole day and break it only in the night by having 'Prasada'.", " This ritual should be repeated on the following day but the fast should not be broken in the night.", " On the final day, that is full moon day he should repeat all the rituals and after putting off the fire of the Havana Kunda, he should smear his body with the ashes.", " He should then take his bath and put on dear's skin or bark of the tree.", " He should also hold a stick and put on a waist band (Mekhala).", " After that he should again rinse (Achaman) his mouth and smear ashes on his body.", " He should perform the exercise of Ashtanga yoga.", " Three times in a day as per the instructions of his guru.", " This way a man is freed from the beastly qualities present in him.", " Pashupat Vrata can be performed by a devotee as long as he is alive or he can continue it for twelve years of three years or one year or six months or one month, or twelve days or three days or even one day.", " On the completion of Pashupat Vrata, a devotee should establish a Shiva idol and worship it with all the sixteen modes of worship (Shodasopachar).", " At last he should perform Awaran Pujan and then worship his guru.", " Through out the period of fast, a devotee should have fruits only and he should sleep on the bare land.", " Pashupat Vrata done in such a way helps a devotee to attain to the abode of lord Shiva. "], "next": "5.7.8", "prev": "5.7.6", "title": "Pashupat Vrata and its Rituals"}