{"index": "5", "image": "resized_images/SHIVA MAHA-PURANA.png", "text": [" First of all, Sage Shaunak expressed his desire to Sutji about knowing the means, which could help a man in this era of Kali to attainment lord Shiva, by cleansing all the impurities of his mind and rectifying his inherent demonic tendencies.", " Sutji then described about Shiv Mahapuran - the supreme of all the puranas, which was narrated by Lord Shiva himself and which was later on retold by Sage Vyas with the permission of Maharshi Sanatkumar, for the benediction of common man.", " Sutji said, \"By understanding the mysteries of Shivmahapuran and singing its praises, a man attains greater virtues than that which could be attained by being charitable or by the performance of all the `yagyas'.", " Contemplating on the subject matters of Shivmahapuran give auspicious fruits just like a 'Kalpa-taru' (A mythological tree which fulfills all the wishes).", " Shiv Mahapuran contains twenty-four thousand shlokas and seven.", " Shivmahapuran is the best means for man's liberation.", " PROPER METHOD OF LISTENING TO SHIVPURAN Sage Shaunak requested Sutji to tell about the proper method of listening to Shivpuran, so that the man kind gets complete benefit.", " Sutji replied- \"First of all, an auspicious moment should be determined by an Astrologer.", " After that, friends and relatives should be invited, especially those who have the tendency of being away from such occasions.", " The sages and the virtuous people should be invited too.", " The 'Katha' must be help in scared places like Shiva temple, any place of pilgrimage or in one's home after doing a Bhumi Pujan of the land Where one intends to held the Katha of Shiv Puran.", " The canopy should be well decorated.", "\" \"After making a resolution and doing worship of Ganapati - the destroyer of all hurdles and obstacles the Katha should be commenced.", " The person who is telling the 'Katha' should be facing north and all the listeners should sit facing east.", " The person who is telling the 'Katha' should be a scholar and should be capable of clearing all the doubts from the listener's mind.", " There should be no kind of distraction during the 'Katha' period.", " A devotee, who listens to the Katha leaving behind all of his worldlys worries get complete benefits.", " A devotee should also make donations and offerings according to his capacity and capability otherwise he would become a wretched man.", " The Mantra 'OM NAMAH SHIVAY' should be chanted through out the period of Katha.", " RIGHT OF LISTENING TO SHIVMAHAPURAN:", "- An uninitiated person does not have the right to listen to the Katha of Shivmahapuran.", " So a man desirous of listening to Shivmahapuran should first get initiated.", " AUSTERITIES TO BE FOLLOWED:", " A devotee who has taken the vow of listening to the Katha of Shivmahapuran, should follow a celibate life.", " He should sleep on the floor and should have only fruits in the diet.", " He can have his normal dinner only after the completion of the Katha.", " The diet should be fresh and pure.", " He should also try to avoid sinful tendencies like lust, anger, greed, attachment and condemning other, etc.", " Making donations of even meager things give undiminishing virtues.", " RITES PERFORMED ON COMPLETION OF OBSERVANCE:", "- After the methodical completion of the Katha, a devotee should perform UDDYAPAN (Conclusion of the Katha), which is similar to the CHATURDASHI UDDYAPAN.", " The devotee should also Charitably make donations to all the brahmins who have helped in the performance of Katha.", " On the next day the 'Path' of SHIV GITA should be performed.", " If the devotee (listener of the Katha) is a householders, then he should perform 'Havan' with the ghee prepared from Cow's milk, for the pacification of the unhindered completion of the Katha.", " The Havan should be performed, either with the help of 'Rudra Samhita mantras' or 'Gayatri Mantra' or with the shlokas of Puran.", " This Purana consists of the following 7 Chapters: "], "next": "5.1", "prev": "4.7.11", "title": "SHIVA MAHA-PURANA"}