{"index": "6.1", "image": "resized_images/INTRODUCTION.png", "text": [" This chapter contains only 1 section:", " Narad asks sage Pulastya about Vaaman incarnation:", " Vaaman Puraan is one of the eighteen Puraans written by sage Vyasa.", " It contains tales pertaining to Lord Vishnu in his Vaaman (dwarf) incarnation.", " Sage Pulastya while giving answers to Narad's enquiry narrates the tale of Vaaman Puraan.", " All the Puraans give glimpses of Indian civilization and culture and Vaaman Puraan is no exception.", " It also teaches the virtue of righteousness and religiousness.", " Vaaman Puraan not only contains the divine tales of Nara- Narayana and Goddess Durga but it also contains tales of famous devotees like Prahlad, the salvation of Gajendra (elephant) etc.", " Sage Narad asks Pulastya- \"O revered sage! Why did Shri Hari take the incarnation of Vaaman?", " Why did Prahlad fight a battle with the deities despite being a devotee of Lord Vishnu?", " How did Sati, Daksha Prajapati's daughter become Mahadev's consort in her next birth?", " I am eager to know the answers to all these questions.", "\" Pulastya replied- \"O Narad! Once, Sati requested Lord Shankar to make arrangements for a permanent abode.", " At that time, Lord Shankar had his abode at Mandaar Mountain.", " Summer season was approaching and Sati quite rightly had apprehensions of living in the open.", " Lord Shankar told her that as he was a recluse, he never felt a need of a permanent dwelling.", " Though Sati was not satisfied by his answers yet she kept quiet.", " This way, both of them continued to live there.", " The summer season had passed and now it was the turn of rainy season to arrive.", " Sati made the same request to Lord Shankar.", " This time, Lord Shankar told her that it was impossible for him to construct a house, as he had no wealth.", " He also told her that he had only a tiger skin as his clothing, the king cobra- his sacred thread, Padma and Pingal (snakes)- his ear-rings and Keval and Dhananjay as his armlets.", " After hearing this, Sati became worried as to how she would pass the rainy season without a home.", " Lord Shankar then assured her that this problem would be easily solved if she lived above the clouds.", " This way, she would remain untouched by the showers.", " After this, both of them ascended towards the sky and started living above the clouds.", " From that day onwards, Lord Shankar came to be known as Jeebhootvaahan (one whose vehicle is the cloud). "], "next": "6.2", "prev": "6", "title": "INTRODUCTION"}