{"index": "6.11", "image": "resized_images/SAGE MANKANAK EULOGIZES SHIVA.png", "text": " Sage Mankanak was the Manasputra of Kashyap.\n He had seven sons, who were famously known as Marud Ganas.\n They are the one who hold all the movable and immovable objects of this world.\n Once, sage Mankanak injured his finger by the sharp edge of Kusha grass while he was trying to pluck them for his religious rites.\n But he was quite surprised when he found vegetative juice (Shaak Rasa) oozing out from the wound instead of blood.\n He thought that perhaps his blood had transformed into vegetative juice by the virtue of his penance.\n This abnormal event made him arrogant and he started dancing in joy as a result of which the whole world started to swerve.\n Lord Brahma became puzzled by this sudden development.\n He went to Lord Shiva and requested him to stop Mankanak from dancing so that the universe became steady.\n Lord Shiva went to sage Mankanak and said- \"O supreme sage! Being a hermit, you are supposed to have control over your emotions.\n May I know the reason of your extreme joy, which makes you dance.\n\" Mankanak told him that his penance had given him great power due to which vegetative juice was oozing out from the wound instead of blood and this was the reason for his extreme joy and happiness.\n \"That is why I am dancing\", said Mankanak.\n But Lord Shiva was not amused and wanted to teach him a lesson.\n He hit the thumb with the nail of his finger as a result of which, ashes poured out from the wound.\n Mankanak was surprised by this.\n Being ashamed, he said- \"I know, you are none other than Lord Shiva because nobody else can perform this amazing feat.\n I am your great devotee.\n You are the one on whom, deities like Brahma and Vishnu are dependent.\n I need your blessings so that the virtues of my penance remain intact.\n\" Lord Shiva blessed him and promised to dwell in his hermitage forever. ", "next": "6.12", "prev": "6.10", "title": "SAGE MANKANAK EULOGIZES SHIVA"}