{"index": "6.12.4", "image": "resized_images/Sthanu Tirtha.png", "text": [" The sages then asked Lomaharshan about the origin of Sthanu Tirtha and the importance of Sthanu Vata.", " They also expressed their desire to know about the reservoir named Saanihitya and how Indra had filled it up with mud.", " Sage Lomaharshan replied- \"Once, Sanat Kumar upon being asked by Baalkhilya and other sages the same question, narrated the following tale- During the period of final annihilation, when the whole earth was submerged in water, Lord Brahma manifested inside an egg.", " He slept there for thousands of Yugas.", " When he woke up from his sleep, he found the world devoid of any inhabitants.", " Being under the influence of Rajo Guna, he planned to commence his creation.", " At the same time, Lord Vishnu awakened from his sleep and broke that egg after seeing that the whole world had merged inside him.", " Subsequently, Lord Brahma began his creation starting from the word- 'OMKAR'.", " After that, the terms- Bhur, Bhuvah and Swah respectively came into existence.", " The brilliant effulgence radiating from the egg had dried up the water as a result of which, the remaining water had turned into the shape of an embryo.", " The reservoir- Saanihitya is situated at the same place where the egg had manifested itself.", " Meru Mountain is nothing but the outer shell of that egg and all the other mountains are its membrane.", " The oceans and the rivers are the fluid inside that egg.", " There is a great reservoir near the navel area of Lord Brahma.", " A big Banyan tree is situated just in the middle of that reservoir.", " This tree appears like a pillar (Sthanu).", " All the three major castes (Brahmin, Kshatriya and Vaishya) originated from that tree.", " Lord Brahma then created his Manasputras- Sanat, Sanandan etc.", " Subsequently, he created the Saptarishis and the Baalkhilyas.", " All the Baalkhilyas did a severe penance for thousands of years without having a morsel of food.", " They had become very weak but still Lord Shiva was not pleased with them.", "\" Once, Lord Shiva and Uma were travelling by aerial route when suddenly Uma saw the weak Baalkhilyas engaged in penance.", " She was saddened to see their frail bodies and requested Lord Shiva to end their miseries.", " Lord Shiva told her that the Baalkhilyas had not attained a bit of virtuousness inspite of their severe penance.", " \"They have still not become free from anger and desires\", said Lord Shiva.", " But Uma was reluctant to believe his words.", " Lord Shiva then asked her to wait there and himself went to show their real worth to her to prove his point.", " Lord Shiva then shed his apparels and became naked.", " As a mendicant, he visited the hermitages of all the Baalkhilyas.", " At that time the Baalkhilyas were engaged in penance and hence only womenfolk were present at the hermitages.", " The womenfolk, infatuated by Lord Shiva, started running after him.", " When the Baalkhilyas came to know about this, they uprooted his private organ (Linga) and threw it on the ground.", " Hardly had the Linga fallen on the ground, the whole world got engulfed by the process of destruction.", " All the sages and learned saints became worried and went to seek Lord Brahma's help.", " Lord Brahma revealed to them that this destruction was due to Shiva's wrath.", " He also told them about the futility of their penance as they were still under the influence of anger and lust.", " \"You cannot attain perfection until your flaws are removed\", said Lord Brahma. "], "next": "6.13", "prev": "6.12.3", "title": "Sthanu Tirtha"}