{"index": "6.12.2", "image": "resized_images/Vashishtha-pavah Tirtha.png", "text": " The sages asked Lomaharshan about the origin of Vashishthapava Tirtha and about the reason why sage Vashishth was carried along by the powerful current of Saraswati river.\n Lomaharshan said- \"There was great rivalry between sage Vashishth and sage Vishwamitra.\n In course of time, it turned into a bitter enemity.\n Vashishth had his hermitage at a place called Sthanu Tirtha and Vishwamitra's hermitage was situated just towards the west of it.\n Vishwamitra was jealous of Vashishth's accomplishment.\n\" Once, Vishwamitra asked river Saraswati to bring Vashishth to his hermitage with the help of powerful currents so that he could kill him.\n River Saraswati became sad and refused to obey him, which made Vishwamitra angry.\n He again repeated his commands.\n Seeing no other option, she went to Vashishth's hermitage and narrated the whole story to him.\n Vashishth agreed to be carried away by her current.\n When Vishwamitra saw Vashishth, he furiously started looking for some weapon to kill him.\n Saraswati became scared and carried Vashishth to safety as she did not want to acquire the sin of collaborating in the killing of a Brahmin.\n Vishwamitra angrily cursed her- \"May your water be mixed with blood and may the demons thrive on your banks.\n\" This way, Saraswati flowed with her water mixed with blood for one year.\n All the sages, deities, Gandharvas and Apsaras were worried at this happening.\n But, this was not the case with the demons, who lived happily at the bank of river Saraswati thriving on the blood mixed in her water.\n They used to live happily- dancing and rejoicing, as if they had won the heaven from the deities.\n One day, some sages arrived at the bank of river Saraswati and became distressed after seeing her water mixed with blood.\n They asked her about the reason.\n She revealed the whole story and the misdeeds of Vishwamitra.\n The sages then requested river Aruna- the liberator of all sins to change her course and start flowing towards river Saraswati.\n As soon as river Aruna submerged into river Saraswati, she (Saraswati) regained her purity once again. ", "next": "6.12.3", "prev": "6.12.1", "title": "Vashishtha-pavah Tirtha"}