{"index": "6.13", "image": "resized_images/SAGES TAKE LORD SHIVA’S REFUGE.png", "text": " Ashamed, the sages requested Lord Brahma to tell them the way to pacify Lord Shiva.\n Lord Brahma assured them that they would be forgiven if they took Lord Shiva's refuge.\n Lord Brahma went to Kailash Parvat accompanied by all the sages.\n After reaching there, he eulogised Lord Shiva with deep devotion.\n The sages also worshipped Lord Shiva.\n Lord Shiva was satisfied by their eulogy and devotion.\n He instructed the sages to establish the severed Linga at Saanihitya Sarovar.\n \"By doing this, you would have all your desires fulfilled.\n The Linga would become famous by the name of Sthanu- the whole world.\n A devotee who pays a visit to this sacred place of pilgrimage would become liberated from all his sins\", said Lord Shiva.\n The sages returned to the place of Lord Shiva's fallen Linga.\n They tried their best to lift it but were unsuccessful in their attempt.\n They became worried and went to Lord Brahma for help.\n Lord Brahma told them- \"Since Shiva's Linga had fallen on his own will, hence nobody except him can lift that Linga.\n\" All of them went back to Kailash Parvat but Lord Shiva was nowhere to be found.\n Lord Brahma went into a state of deep meditation and sighted Lord Shiva in the guise of an elephant.\n When Brahma and the deities proceeded on their way, they found a goddess with a kamandalu in hand and offered them Amrit.\n After being refreshed, the sages asked whether she knew of Lord Shiva's whereabouts.\n She told them that Lord Shiva was presently living in the middle of Saanihitya Sarovar.\n After reaching the reservoir, they found Lord Shiva in the guise of an elephant.\n They requested him to help them, establish his Linga at the desired place.\n Lord Shiva agreed.\n All of them then went to the site of Lord Shiva's fallen Linga.\n He lifted it with his trunk and established it towards the west of Saanihitya Sarovar.\n The sages were satisfied and expressed their gratitude to Lord Shiva.\n Lord Shiva, pleased by their eulogy and devotion, decided to make the Linga as his abode. ", "next": "6.14", "prev": "6.12.4", "title": "SAGES TAKE LORD SHIVA’S REFUGE"}