{"index": "6.14.3", "image": "resized_images/King Ven, Birth of Prithu.png", "text": " Sage Markandeya then goes on to describe about the splendours of Sthanu Tirtha- Surya was Manu's father.\n Ven was Manu's grandson.\n He was wicked and always criticised the Vedas.\n Being displeased by his irreligious son, Ven's father left for the forest to do penance where he attained salvation.\n In course of time, Ven's tyranny spread across the length and breadth of the earth.\n In a very short time, he became the lord of whole earth.\n He had strictly warned his subjects against worshipping any other deity except him.\n Sages became furious by his irreligious stricture and tried to change his mind but their efforts went in vain.\n Ultimately, Ven was killed by the angry sages.\n After his death, the sages churned his left hand, which resulted in the manifestation of a dwarf.\n The sages considered him to be unfit to become a ruler and churned Ven's right hand for the second time.\n This time, a divine entity manifested, who had all the auspicious signs on his body.\n The deities crowned this divine entity as the king and named him Prithu.\n Prithu proved to be a just king and his subjects were satisfied by his rule.\n One day, sage Narad arrived at Prithu's court.\n Wanting to grab the opportunity, he asked Narad how his father could be liberated from his sins.\n Narad told him that his father was presently living among the Mlechchas and was suffering from diseases like consumption and leprosy.\n \"He would be cured of his diseases if he is taken to Sthanu Tirtha and made to take a dip in the holy Saanihitya Sarovar\", said Narad.\n He went to the site and found his father living among the Mlechchas.\n After taking the Mlechchas' permission, he brought his father to Sthanu Tirtha.\n His effort of helping his father to take a bath was resisted by the deity- Vaayu who said- \"The waters of Saanihitya Sarovar would get polluted if such a lowly sinner took a bath in it.\n First of all, you must go on a pilgrimage and visit all the sacred places to make your father pure.\n Only then he will be entitled to take bath here\".\n Prithu accompanied by his father went on a pilgrimage and visited all the sacred places.\n When both of them returned to Sthanu Tirtha, his father had become pure by this time.\n Ven took his bath and became liberated from his sins.\n He worshipped Lord Sthanu and eulogised him with total devotion. ", "next": "6.14.4", "prev": "6.14.2", "title": "King Ven, Birth of Prithu"}