{"index": "6.17.9", "image": "resized_images/Lord Shiva does Penance.png", "text": [" Lord Shiva was so deeply attached to Uma that for 1000 years, he was possessed by only her thoughts.", " He forgot about his duties and as a result, there was anarchy all over the world.", " His obsession with Uma had also decreased his radiance.", " He decided to do penance with the objective of regaining his radiance.", " When Uma came to know about his decision, she was unhappy but Lord Shiva consoled her by relating the significance of his decision.", " Before leaving, he entrusted the responsibility of her security to Nandi.", " He started wandering in search of a suitable place for doing penance.", " Sometimes, he did penance under the tree, sometimes on the mountain peaks and sometimes on the banks of a river.", " Initially, he used to eat only kand and Moola but later on he stopped eating even that and lived only on air.", " This way, 900 years passed during which he travelled to all the three lokas.", " Ultimately, he even stopped breathing.", " He inserted a small wooden block in his mouth to stop the air from entering his body.", " This act of Shiva resulted in the tremendous generation of energy inside his body as a result of which that wooden block blasted off through his skull and fell on the Himalaya Mountain with such force that the wooden block levelled numerous peaks of Himalaya Mountain to the ground.", " The famous place of pilgrimage- Kedarnath is situated at this very place.", " After that, Lord Shiva did a severe penance by immersing his whole body in the waters of Saraswati river.", " He remained immersed in the water for one complete year and did not come out.", " All the seven worlds including the oceans and the mountains started shaking violently.", " The stars and the Nakshatras started falling down on the earth.", " Curious to know why this happened, the worried deities went to Lord Brahma.", " Even Lord Brahma could not satisfy their curiosity as he had no answer.", " All of them then went to Lord Vishnu but he too was not aware of the reason.", " All the deities including Lord Vishnu then went to Mandaar Parvat to see Lord Shiva.", " But they were surprised to find out that neither Lord Shiva nor Uma were present there.", " Lord Vishnu was aware of Lord Shiva's penance in the Saraswati river.", " Due to the sin of causing Mridani's foetus to abort, the deities could not know the fact behind this strange event.", " The deities then performed the most austere Taptakrichcha Vrata to atone for their sin.", " Lord Vishnu then gave them a glimpse of Shiva Linga, which manifested in his heart.", " All the deities again worshipped that Shiva Linga and made offerings.", " Lord Vishnu then took them to Kurukshetra where Lord Shiva was doing his penance in the waters of Saraswati.", " The deities eulogised Lord Shiva by saying \"STHANAVE NAMAH\" and Indra requested him to stop doing his penance as the whole world was in turbulence.", " Lord Shiva accepted their request with a smile and discontinued with his penance.", " Even after Lord Shiva had stopped doing his penance, the earth continued to shake violently.", " Surprised, he started wandering here and there to know the truth behind this turbulence.", " He found sage Shukracharya doing penance on the bank of river Oghavati with the objective of learning the most secret Mritsanjeevani Vidya.", " Lord Shiva blessed him and his desire was fulfilled but the earth still continued to shake violently.", " Lord Shiva then proceeded towards Saptasaraswat where he found sage Mankanak was dancing in joy and his steps were causing the earth to shake.", " Sage Mankanak had acquired tremendous virtues due to his severe penance and as a result instead of blood, vegetative juice secreted from his wound.", " He had become arrogant and thought that it happened only because of his penance.", " Lord Shiva then subdued his arrogance by causing wound on his finger from which ashes poured out.", " Sage Mankanak was ashamed of himself and stopped dancing, and the earth became calm once again. "], "next": "6.17.10", "prev": "6.17.8", "title": "Lord Shiva does Penance"}