{"index": "6.17.7", "image": "resized_images/Kaartikeya Kills Taraka and Mahishasura.png", "text": " After being appointed as the chief commander of the deities, Kaartikeya sought his guardians' permission to kill the demons- Taraka and Mahishasura. All the deities including Lord Vishnu blessed Kaartikeya and wished for his victory. Lord Vishnu eulogised Kaartikeya and praised his valiance. Kaartikeya then proceeded with a huge army comprising of Ganas and Kritikas. Kaartikeya had taken an aerial route so that he could reach his enemies' territory as soon as possible. The Ganas disguised as birds, followed him. As they were about to reach their enemy's place, Kaartikeya requested the Ganas to descend to the earth. The Ganas followed his instruction and descended to the earth making a thunderous noise. Some demons like Mahish, Taraka, Virochan, Jambh and Kujambh heard this noise and went to Andhak to inform him about it. As the demons were trying to find out the cause of the noise, a demon- Paatalketu arrived there in an injured condition. The demons were surprised and asked how he got injured. Paatalketu, narrating the incident said- \"I had entered sage Gaalav's hermitage in the guise of a boar with the intention of killing him. Suddenly, an arrow pierced my body. I ran towards the sea coast to save my life where I found large number of people who were planning to kill Mahishasura and Taraka. I have come here to inform you about their plan. I am very scared and worried.\" Andhak assured them that there was nothing to worry about as both Mahishasura and Taraka were mighty and it was not an easy task for anybody to kill them. When Mahishasura and Taraka came to know about this, they immediately set out with a huge army towards the sea coast. An intense battle commenced in which both the sides fought valiantly. The Ganas and the Matrikas launched a severe attack on the enemy with all the weapons they had at their disposal. But the demons remained unaffected and their assault was too much for the Ganas to bear. After defeating the Ganas, Mahishasura menacingly ran towards Kaartikeya. Suchakraksh who was fighting from Kaartikeya's side unleashed his chakra to stop Mahishasura. Mahishasura retaliated by attacking the chakra with his mace but his mace was cut into pieces by the chakra. After destroying the mace, Suchakraksh's chakra chased Mahishasura. When Banasura saw Mahishasura's life in danger, he came forward to help him. He attacked the chakra with his 500 hands and grabbed Suchakraksh with the remaining 500. Seeing Suchakraksh in danger, Makaraksh hit Banasura on his head with his mace. Seething in pain, Banasura immediately released Suchakraksh. Seeing his army defeated, Taraka came forward to fight with a sword. He fought valiantly and defeated the Ganas and the Matrikas in a very short time. The defeated Ganas took the refuge of Kaartikeya. When Kaartikeya saw Taraka chasing the Ganas, he killed him with his weapon- Shakti. Taraka's death scared Mahishasura and Banasura. To save his life, Mahishasura ran away towards Himalaya Mountain while Banasura hid himself in the ocean. Kaartikeya chased Mahishasura as a result of which, he was forced to abandon Himalaya. Mahishasura now took refuge in a cave of the Kraunch Mountain. Seeing the demon being protected by his maternal cousin- Guh (cave), Kaartikeya was in a dilemma. He knew that if he attacked Mahishasura inside the cave then his cousin- Guh might get hurt. He waited for Mahishasura to come out. Lord Brahma, Lord Vishnu and Lord Mahesh appeared and advised Kaartikeya to kill the demon. Indra too advised him the same. But Kaartikeya did not pay heed and told them that he would kill Mahishasura only after he came out from the cave. Furious, Indra told Kaartikeya that a man did not become a sinner if he killed one person to safeguard his community's interest. Giving his own instance, he narrated as to how he had killed his own brother- Namuchi. But Kaartikeya was not convinced and refused to act according to Indra's instruction. Very soon, their arguments turned into a major dispute when Indra boasted of his strength. Kaartikeya challenged him for a duel. Indra proposed a plan according to which, whoever circumambulated the Kraunch Mountain first would be considered as the winner. When Kaartikeya returned after circumambulating Kraunch Mountain, he found Indra sitting there. Furiously, he asked Indra why he was seated. Indra replied that he was the winner as he had already finished circumambulating the Kraunch. Both of them quarrelled but were not able to decide the winner. So, both of them went to Lord Brahma, Lord Vishnu and Brahma to take their help. Lord Vishnu advised them that only Kraunch Mountain could decide the winner. Both of them went to Kraunch Mountain and requested him to tell as to who the winner was. Kraunch Mountain said- \"Indra is the winner since he was the first to circumambulate me. Kaartikeya became furious and attacked Kraunch Mountain with his Shakti as a result of which, the great mountain was fragmented into pieces. Mahishasura who was hiding in the cave of Kraunch Mountain was also crushed to death. Later on, Kaartikeya felt very sorry for having killed his maternal cousin- Guh and after being advised by Lord Vishnu, he went to Prithudak Tirtha to atone for his sin. ", "next": "6.17.8", "prev": "6.17.6", "title": "Kaartikeya Kills Taraka and Mahishasura"}