{"index": "6.17.5", "image": "resized_images/Killing of Nishumbh and Shumbh.png", "text": " Shumbh and Nishumbh were sons of Danu.\n They wanted to avenge Mahishasura's death and sent many demons like to bring Goddess Chandika after enslaving her.\n First of all, Sugreev was sent followed by Dhumralochan but both of them were killed by the Goddess.\n When Shumbh and Nishumbh heard of their death, they were infuriated.\n Nishumbh attacked the goddess with a huge army.\n Shumbh attacked from the other side.\n In the fierce battle, Goddess Chandika broke Nishumbh's sword as well as his shield.\n Nishumbh then attacked Goddess Chandika with his weapon- Shakti.\n Goddess Chandika broke it with her Chakra.\n At last, she attacked him with her arrows at him and as a result, Nishumbh got injured and fell.\n When Shumbh saw Nishumbh, injured and unconscious, he ran towards Goddess Chandika to kill her.\n Goddess Chandika blew her conch and made a thunderous noise by pulling the bowstring.\n Shumbh released the dangerous weapon- Ugradipti in the direction of Goddess Chandika.\n But her weapon Maholkanaamni destroyed it.\n Shumbh thundered loudly and attacked Goddess Chandika with a volley of arrows but none could cause any harm to her.\n Finally, Goddess Chandika attacked Shumbh with her trident.\n Shumbh fell down unconscious.\n After sometime, he regained his consciousness and attacked Goddess Chandika with his arrows.\n But she destroyed all the arrows.\n In the meantime, Nishumbh had regained his consciousness.\n He got up and attacked Goddess Chandika with his trident.\n In the end, Goddess Chandika killed Nishumbh by piercing her trident in his heart.\n As Nishumbh was dying, an another demon manifested from his body.\n Even he was killed by her.\n Her mount Simha devoured all the dead demons.\n Shumbh became angry at the death of his brother- Nishumbh.\n He furiously told the goddess- \"O wicked lady! Do not be proud of your strength borrowed from others.\n\" Goddess Chandika replied- \"O wicked demon! I am the only power of this whole universe.\n I am the origin of cause and effect.\n Look! All the divinities are entering into my body.\n The next moment, all the divine entities, which had earlier manifested from the bodies of the deities united with the goddess.\n Now, the goddess was alone.\n A tremendous battle was fought between Goddess Chandika and Shumbh.\n Ambika attacked him with numerous divine weapons.\n But, Shumbh neutralised her attack with his own weapons.\n Shumbh covered the whole body of Goddess Chandika with his arrows.\n She broke his bow.\n After this, Shumbh attacked her with his weapon- Shakti, which was broken into pieces by her chakra.\n Now, Shumbh took out his sword and attacked her with it.\n She broke his shield and sword with her arrows.\n Shumbh then attacked her with his mace.\n Even his mace was broken into pieces.\n Shumbh had no more weapons left with him.\n He hit the goddess on her breast with his clenched fist.\n She slapped him so hard on the face that he fell down.\n The next moment, he got up and manifested himself in the sky.\n Now, a tremendous duel was fought between them in the sky.\n In the end, she dashed him to the ground and pierced the trident in his heart.\n Shumbh was instantly killed.\n After the killing of Shumbh, Gandharvas, the deities and Apsaras were so pleased that they danced and rejoiced.\n The whole atmosphere echoed with the sound- \"SHANTI SHANTI\" (Let there be peace).\n After goddess Chandika killed Shumbh, all the deities under the leadership of Indra and Agni started eulogising her- \"O Goddess! Be pleased upon us! Protect the whole world, as you are the goddess of this whole universe.\n You appear in the form of this earth- the base on which everything is situated.\n Your light illuminates all the living creatures.\n You are the only power through which creation, nurturing and annihilation takes place.\n You are the Brahmani, Maheshwari and the Kaumari.\n We salute you because you have protected us from the terror of the demons.\n We need your protection from all the calamities of this world.\n\" Goddess Chandika was very pleased by their eulogy.\n She asked them for any wish.\n The deities said- \"O Akhileshwari! We need your protection.\n Clear all the obstacles from our path.\n Eliminate our enemies.\n\" Goddess Chandika replied- \"During Vaivasvat Manavantar, I will take incarnation from Yashoda's womb- the wife of Nand, to kill the demons Shumbh and Nishumbh.\n After that, I will kill the demon- Vaiprachit in my most aggressive form.\n One hundred years later, I will manifest myself and would be known as Satakshi because of my hundred eyes.\n My next incarnation would be known as Shakambhari because I would nurture the whole world during the period of drought.\n I will kill the demon Durgam during that drought period.\n I will kill the demon Arun- the tormentor of all the three worlds by taking the form of a bee.\n Due to this, I will be known as Bhramari.\n I will take incarnations every time the demons torment the world.\n Goddess Chandika says- \"I will clear all the obstacles from the path of such a man who worships me.\n If a devotee listens to the great tales of how I killed Mahishasura, Shumbh and Nishumbh, on the eighth, ninth and fourteenth days of any month then he would be liberated from poverty and all his sins.\n He would become free from fear.\n A devotee must listen to my divine tales during all the religious ceremonies like making sacrifice, worship and performing Yagya.\n By doing this, all his enemies will be eliminated.\n A man who remembers me when faced with dangerous situations remains protected by me.\n\" After blessing the deities, Goddess Chandika disappeared from their sight.\n All the demons, who had survived after the killings of Shumbh and Nishumbh, went to the nether world to save their lives. ", "next": "6.17.6", "prev": "6.17.4", "title": "Killing of Nishumbh and Shumbh"}