{"index": "6.17.1", "image": "resized_images/Mena gives birth to Uma.png", "text": [" Mena gave birth to three daughters and a son.", " The eldest daughter- Raagini was red complexioned and had red eyes.", " Kutila was fair complexioned and had beautiful eyes like that of lotus petals.", " The youngest daughter- Kali was dark complexioned and had beautiful eyes like the petals of blue lotus.", " Mena also had a son named Sunaam.", " When all three of them were of six years, they started to do penance.", " The deities saw these beautiful girls and were enchanted by their beauty.", " Aditya and the Vasu Ganas took Kutila to Brahma loka and asked Lord Brahma- \"O lord! Will this girl give birth to a son capable of killing Mahishasura?", "\" Lord Brahma told them that she was incapable of bearing the effulgence of Lord Shiva and hence she should be released.", " Kutila was dejected by Lord Brahma's rejection and challenged him that she would try every means so as to attain the capability of holding the effulgence of Lord Shiva.", " Lord Brahma became angry with her arrogant utterances and cursed her to become a river.", " In a very short period, the furious current of Kutila over-flooded the whole Brahma loka but Lord Brahma managed to control her current.", " In this way, Kutila remained in Brahma loka in the form of a river.", " When the deities saw Raagini doing penance, they took her to Lord Brahma.", " Even she was cursed by Lord Brahma in the same manner as her sister had been cursed.", " Due to Lord Brahma's curse, she became Sandhya (evening) and started for the auspicious yoga of Kritika.", " After losing her two daughters, Mena tried to dissuade Kali from doing penance.", " But Kali was not to listen.", " Reacting to her mother's advises, Kali pronounced 'U' 'Ma' and as a result she was named Uma by her mother.", " Uma commenced her severe penance to please Lord Shiva.", " When Lord Brahma came to know about this, he instructed the deities to bring her along to Brahma loka but the deities were unsuccessful in their attempt as Uma's radiance was unbearable for them.", " They returned to Brahma loka and narrated the whole story to Lord Brahma.", " Lord Brahma was convinced that Uma was worthy of being Shiva's consort.", " One day, Himalaya, Uma's father brought her back home.", " Once, Lord Shiva went to Himalaya Mountain to do penance.", " When Himalaya came to know of his arrival, he was extremely happy.", " He made all necessary arrangements for Lord Shiva.", " One day, while Lord Shiva was engrossed in meditation, Uma arrived there.", " Lord Shiva was pleased to know that Sati had re- incarnated as Uma.", " But his joy was momentary as he went back into deep meditation.", " Uma paid her obeisance by touching Shiva's feet.", " Lord Shiva wanting to test Uma's devotion went into hiding.", " Uma sought her father's permission to do penance with the objective of having Shiva as her husband.", " Himalaya agreed and gave his permission.", " She started her penance after creating an earthen idol of Lord Shiva.", " She worshipped that idol with total devotion.", " Lord Shiva became pleased with her devotion and appeared before her in the guise of a mendicant.", " On being enquired by Uma, Lord Shiva told her that he was on his pilgrimage to Prithudak.", " \"I am used to all these austerities as I have been practising it since my childhood.", " But why are you torturing yourself in such a tender age?", "\", asked Lord Shiva.", " Lomaprabha, Uma's companion was also present there.", " She told the mendicant about the objective with which Uma was doing her penance.", " \"She wants to have Lord Shiva as her husband\", said Lomaprabha.", " Hearing this, the mendicant laughed loudly and made fun of Shiva.", " He tried to dissuade Uma from marrying Lord Shiva.", " Uma became extremely angry and asked the mendicant to keep mum.", " But when the mendicant continued with his abuses, she got up and tried to move away from the side.", " Lord Shiva became pleased by her total devotion and appeared in his real form.", " He assured Uma to go back home and said- \"I will send the sages to your house with a marriage proposal.", " The idol which you have been worshipping with such deep devotion would become famous as Bhadreshwar.", " Uma returned home and Shiva proceeded on his way to Prithudak. "], "next": "6.17.2", "prev": "6.17", "title": "Mena gives birth to Uma"}