{"index": "6.17.3", "image": "resized_images/Uma Marries Lord Shiva.png", "text": " Lord Vishnu, Brahma, the deities and the Ganas were pleased to hear about Shiva's marriage.\n Lord Shiva went to his abode- Kailash Mountain to make preparations for the marriage ceremony.\n Lord Shiva's marriage procession proceeded towards Himalaya Mountain.\n His appearance was quite terrifying with a tiger skin around his waist and Gorochan Tilak on his forehead.\n He had a garland of skulls around his neck.\n Snakes were coiling all around his body.\n His mount- Vrishabh (ox) was walking in a majestic way.\n The marriage procession comprised of the deities, Yakshas, demons and his Ganas.\n Lord Vishnu had Goddess Lakshmi by his side and was mounted on Garud (eagle) while Lord Brahma was mounted on Hans (swan).\n When the marriage procession reached its destination, Himalaya received his esteemed guests with great honour and guided them to his palace.\n The womenfolk envied Uma as they glanced at the handsome appearance of Lord Shiva.\n Uma was looking divinely beautiful in her white coloured silken apparel.\n At last, both the bride and the bridegroom entered the canopy where the marriage ceremony was supposed to be performed.\n Himalaya placing Uma's hand in Shiva's, requested him to accept her as his wife.\n Lord Shiva said- \"O king of the mountains! Despite being homeless, I agree to accept your daughter as my wife.\n\" After that, both Shiva and Uma tied the nuptial knot and circumambulated the sacred fire for three times.\n Both of them made offerings to the sacred fire.\n As Uma touched Shiva's feet, Lord Brahma got a chance to have a glimpse of her beautiful face.\n He was so infatuated by her divine beauty that he ejaculated.\n Nobody except Lord Shiva was aware of this incident.\n Lord Brahma tried to conceal his ejaculated sperms (Veerya) under the soil.\n But Lord Shiva prohibited him from doing so and said- \"Don't destroy this Virya.\n From it would manifest 80,000 Baalkhilyas.\n\" Lord Shiva's prophesies came true and in a very short time, 80,000 Baalkhilyas appeared there.\n Lord Shiva then returned to Mandaar Parvat accompanied by his consort, Uma. ", "next": "6.17.4", "prev": "6.17.2", "title": "Uma Marries Lord Shiva"}