{"index": "6.17.4", "image": "resized_images/Vishwakarma Constructs a Palace.png", "text": [" After reaching Mandaar Mountain, Lord Shiva instructed Vishwakarma to construct a home.", " Vishwakarma constructed a spacious home for Shiva, which was spread in the area of 64 Yojans.", " The home was decorated with Swastika symbols and its walls were made of gold.", " One day, Lord Shiva jokingly referred to Uma as Kali because of her dark complexion.", " But Uma did not take his comments lightly and told Shiva that she was going to the Himalayas to do her penance so that he did not dare to call her by that name again.", " Thus, Uma went to Himalaya Mountain and commenced her penance.", " Standing on one feet, she engaged herself in severe penance.", " One day, a lion arrived and seeing Uma standing on one feet, waited patiently for the moment when she would lose her balance and fall into its clutches.", " Uma continued with her penance for one hundred years by continuously chanting the sacred Brahma mantra.", " Pleased by her devotion, Lord Brahma appeared before her and asked what she wished for.", " Uma first of all requested him to bless the lion with immense power.", " She then requested him to bless her with a golden complexion.", " Lord Brahma blessed her and disappeared.", " She abandoned her dark complexioned skin from which manifested Kaushiki.", " Now, her complexion turned golden due to Lord Brahma's blessings.", " Indra appeared before her and sought her permission to take Kaushiki along with him.", " Uma gave her consent without any hesitation.", " Indra took Kaushiki to Vindhya Mountain and requested her to stay there.", " He said- \"You would become famous as Vindhya Vaasini and would be revered even by the deities.", "\" He presented a lion to her and went back to his abode.", " On the other hand, Uma returned to Mandaar Mountain and lived happily.", " Lord Shiva became so deeply attached to her that he forgot about his duties and as a result of which, the whole world became disturbed.", " The deities became scared by this development and went to seek Lord Brahma's advice.", " Lord Brahma went to Mandaar Mountain accompanied by all the deities.", " They tried to enter Shiva's abode but Nandi- Shiva's mount did not let them in.", " Helpless, all of them waited eagerly for the time Shiva would come out.", " Agni seeing rows of swans coming out from Shiva's abode disguised himself as a swan and thus managed to get inside.", " He went near Lord Shiva and said- \"O lord! The deities are anxiously waiting for you outside.", " How come, you are not aware of this?", "\" Lord Shiva immediately got up and ran towards the deities.", " Indra and other deities were scared at the prospect of losing heaven to Lord Shiva's progeny.", " So, they requested Lord Shiva not to procreate any child from Uma.", " Lord Shiva agreed but asked them as to who was capable of holding his out-flowing sperms.", " Agni came forward and swallowed each drop of Shiva's sperm.", " Satisfied, the deities left.", " Lord Shiva went inside and told everything to Uma.", " She became furious and cursed the deities that they too would remain sonless just like her.", " One day before taking her bath, Uma applied Ubtan (mixture of sandalwood, turmeric etc.", ") on her body.", " She then peeled off the paste from her body and made an elephant-headed image from it.", " Maalini, her companion assisted her in taking bath.", " Maalini was smiling all the while as Uma was taking her bath.", " Uma became curious and wanted to know the reason of her strange smile.", " Maalini told Uma about her firm belief that one day, she (Uma) would definitely become a mother.", " Uma told her that this was impossible as the deities had prohibited her husband, Shiva from procreating a child.", " But Maalini continued to smile.", " After taking her bath, Uma went back home.", " After sometime, Lord Shiva arrived and took his bath at the same place.", " The elephant-headed image created by Uma was lying there.", " Suddenly it became alive and started making a hissing sound from his trunk.", " Lord Shiva delightfully took him to Uma and said- \"Look at your son.", "\" Uma was surprised to see that elephant-headed image alive and affectionately embraced him.", " Lord Shiva again said- \"Your son will become famous as Vinayak and the whole world would worship him.", "\" Lord Shiva then entrusted the task of child's security to Ghatodar.", " Thus, both Lord Shiva and Uma lived happily.", " The same Uma later on took incarnation as Goddess Katyayani and killed the demons- Shumbh and Nishumbh. "], "next": "6.17.5", "prev": "6.17.3", "title": "Vishwakarma Constructs a Palace"}