{"index": "6.17.6", "image": "resized_images/Birth of Kaartikeya.png", "text": " Swallowing of Lord Shiva's sperm had subdued Agni's radiance.\n The deities advised him to take Lord Brahma's help.\n While he was on his way to Brahma loka, he came across a river named Kutila and requested her to hold Shiva's sperm.\n She agreed and requested him to release it in her waters.\n In course of time, she became pregnant.\n The thought of giving birth to an illegitimate child tormented her, so she went to Lord Brahma to take his advice.\n Lord Brahma instructed her to abort her foetus at Udyachal Mountain, which was covered by the dense forest of reed.\n Lord Brahma felt that it was a very safe place for her and nobody will be aware of this incident.\n Kutila followed his instructions.\n Kutila aborted her foetus just according to Lord Brahma's instructions.\n The foetus remained there for 10,000 years after which a child was born, radiant like a rising Sun and eyes like the petals of lotus flower.\n The child being hungry started to cry.\n At that time, all the six Kritikas were passing through that forest.\n They were so mesmerised by the child's beauty that they started quarrelling among themselves as to who should first feed breast milk to the child.\n Seeing their quarrel, the child appeared with his six heads.\n This way, all the six Kritikas fed their breast milk to the child at a time.\n This is the reason why Kartikeya has six heads.\n After Agni came to know of Kaartikeya's birth, he proceeded to bring him back home.\n But Kutila saw him on the way and enquired about his journey.\n When Agni revealed his intention, she started quarrelling with him for Kaartikeya's custody.\n Meanwhile, Lord Vishnu arrived there and enquired regarding their quarrelling.\n Lord Vishnu after being told the reason advised them to take Lord Shiva's help as he was the best judge on such matters.\n Both Kutila and Agni went to Lord Shiva and tried to get his consent.\n Uma advised Lord Shiva by saying- \"All of us must go to that place where the child is living and try to know as to whom he would like to have as his guardian.\n\" All of them went to that reed forest and found Kaartikeya in the lap of one of the Kritikas.\n Kaartikeya knew about their desires.\n Seeing them worried, he manifested in four different appearances of Kumar, Vishaakh, Shaakh and Mahasen.\n Kumar went towards Lord Shiva while Vishaakh went towards Uma.\n Similarly, Shaakh went towards Kutila while Mahasen went towards Agni.\n Thus, everybody was satisfied.\n Lord Shiva then blessed the Kritikas by saying that Kaartikeya would become famous deriving his name from them.\n All the deities arrived there and decided to make Kaartikeya, the chief commander of their army. ", "next": "6.17.7", "prev": "6.17.5", "title": "Birth of Kaartikeya"}