{"index": "6.19.1", "image": "resized_images/Andhakasura – The Demon.png", "text": [" Narad asks sage Pulastya- \"What did the demon Andhak do after entering Paatal loka and how was Lord Shiva's life at Mandaar Mountain?", "\" Pulastya says- \"Andhak was infatuated by Girija's divine beauty and his lust only became stronger as the days passed by.", " Although Prahlad tried very hard to convince him and narrated the tale of his birth, which happened only because of Lord Shiva's blessing.", " Once Lord Shiva was engrossed in meditation when Uma playfully shut all his three eyes and the whole atmosphere was covered in darkness.", " An entity manifested from that darkness who was presented to Hiranyaaksh and who later on became famous as Andhak.", " Prahlad also told him that his lust for his own mother (Parvati) was licentious and most immoral.", "\" In order to dissuade Andhak from going ahead with his immoral intention, Prahlad narrated a story, which described the destruction of an immoral king named Danda.", " \"Sage Shukracharya was the royal priest of King Danda, who performed all the religious rites.", " He had a daughter named Araja.", " Once Shukracharya had gone to meet the demon Vrishparva and stayed there for some days.", " King Danda went to Shukracharya's hermitage to find out the reasons for his absence.", " He saw Araja and became enchanted by her beauty.", " He expressed his desires to Araja that he wanted her at any cost.", " Araja tried to dissuade him by saying that his immoral action would amount to committing treachery towards his Guru- Shukracharya.", " She also tried to scare him by citing about her father's rage, which even the deities feared.", " King Danda then narrated this tale to force her to accept his proposal- \"Vishwakarma had a beautiful daughter- Chitrangada.", " Once, she had gone to take bath in the river with her companions.", " Suddenly, King Surath arrived there and being infatuated by her beauty became lovesick.", " Seeing his pitiable condition, Chitrangada offered herself to him despite her companions' objection.", "\" After narrating this story, King Danda asked Araja to follow the example of Chitrangada.", " But she said- \"You have narrated only half the story.", " I will tell you what happened after that.", "\" She then told this story- \"The immoral act of Chitrangada had angered her father and he cursed her that her married life would be unsuccessful.", " One day, King Surath was drowned by the powerful current of the Saraswati.", " Chitrangada fainted as she could not bear the sorrow of her husband's separation.", " After regaining her consciousness, she looked all around but could not find her husband.", " Once again, she became unconscious and fell in the Saraswati river.", " The powerful currents of Saraswati drowned her and she was ultimately thrown in Gomti river.", " Gomti's current abandoned her near a forest inhabited by ferocious lions.", "\" After narrating her story, Araja told King Danda that she would certainly not accept his proposal as she did not want to meet the same fate as that of Chitrangada.", " The king told her that the story was still incomplete and narrated the following tale- \"When Chitrangada regained her consciousness, she found herself in a dense forest.", " Seeing her in a sorrowful mood, Anjan- a Guhyak consoled her by saying that very soon, she would re-unite with her husband.", " He also advised her to go on a pilgrimage to Shrikanth.", " Chitrangada went to Shrikanth situated towards the south of river Kalindi.", " After taking a bath in Kalindi river, she visited the Shrikanth temple and worshipped Lord Maheshwar.", " Meanwhile, a sage arrived there and seeing Chitrangada queried about her staying in a deserted place.", " Chitrangada narrated the whole story as to how she was cursed by her own father.", " The sage became extremely furious after hearing her woeful tale and cursed Vishwakarma to become a monkey.", " He also advised her to go to Saptagodaavar and engage in the worship of Lord Haatkeshwar where one day she would meet Devavati- the daughter of demon Kandarmaali.", " Chitrangada went to Saptagodaavar and engaged herself in the worship of Lord Haatkeshwar.", " The sage wrote the following lines on the walls of Shrikanth temple- \"Is there anybody who could liberate this beautiful girl from her sorrow?", "\" After that, the sage proceeded on his pilgrimage to Pushkarnath. "], "next": "6.19.2", "prev": "6.19", "title": "Andhakasura – The Demon"}