{"index": "6.19.3", "image": "resized_images/Search for Chitrangada and Vedavati.png", "text": " In the meantime, both daughters of Yaksha and the demon arrived at Shrikanth Mahadev temple and engaged themselves in the worship of lord Mahadev.\n One day, sage Gaalav arrived at the temple and was astonished to find two young ladies at such a deserted place.\n While taking bath, he heard the melodious songs of the two ladies.\n He became convinced of their divinity as it was impossible for mortals to sing with such expertise.\n After the worship, sage Gaalav asked them their identity who then narrated the whole story.\n The next morning, as Gaalav was about to leave, both of them requested him to take them along.\n All three of them then left for Pushkar Tirtha.\n After reaching their destination, sage Gaalav decided to take a dip in the holy river.\n While taking bath, he saw many female fish trying to coax their male counterparts into making love by saying-\"If sage Gaalav is not afraid of being in the company of young women then what makes you so scared in copulating with us?\n\" The male fish replied that he was afraid of getting ridiculed by the public.\n Sage Gaalav was so ashamed of his conduct that he did not come out of the river.\n Both ladies waited anxiously for sage Gaalav.\n Suddenly, Chitrangada arrived and was surprised to see strangers standing there.\n All three of them were looking at each other with surprised expressions on their face when Vedavati arrived there suddenly.\n She went near Chitrangada and enquired about her identity.\n Chitrangada narrated the whole story and revealed how circumstances had forced her to reach this place.\n In a very short time, all four of them became well acquainted with one another.\n They went to Haatkeshwar temple situated on the banks of Saptagodaavar River and worshipped Lord Haatkeshwar.\n They started living in the temple premises and spent their time in the daily worship of Lord Haatkeshwar.\n On the other side, Shakuni, Jabaali and Ritdhwaj were anxiously searching them.\n During the search, Jabaali went to Shaakal Janpad accompanied by his father- Ritdhwaj.\n At that time, Shaakal Janpad was ruled by Indradyumna- the son of Manu.\n After meeting him, Ritdhwaj sought his help in finding his lost daughter- Nandayanti.\n Indradyumna told him- \"O Brahmin! Even I have lost my daughter and don't know where she is at present.\n So, all three of us must go in search of our respective daughters.\n\" After saying this, all three of them decided to proceed ahead in search of their daughter.\n When they reached Badrikashrama, they were amazed to find a young man engaged in austere penance.\n After formal introduction, it dawned on Indradyumna that the young sage was his own nephew- Surath.\n Indradyumna requested his nephew to join him in searching his daughter.\n Ritdhwaj told Surath- \"The girl for whom you are doing such austere penance had been taken by me to Saptagodaavar.\n Come with me and I will help you to re-unite with her.\n\" All of them then left for Saptagodaavar.\n In the meantime, as Ghritaachi- Devavati's mother arrived at Udaygiri Mountain to where she came across a monkey and enquired if he had seen her daughter.\n The monkey told the frail looking Ghritaachi that he had taken a young woman named Devavati to a hermitage near Shrikanth temple.\n Ghritaachi revealed to the monkey that the girl whom he was referring as Devavati was actually her daughter Vedavati.\n She requested the monkey to help her in locating her lost daughter.\n Ghritaachi proceeded towards river Kaushiki in search of Vedavati followed by the monkey.\n After reaching there, Ghritaachi took a holy dip in the waters of Kaushiki.\n In the meantime, Jabaali and Ritdhwaj too had reached the banks of river Kaushiki.\n When Jabaali saw that monkey, he told his father Ritdhwaj by pointing his finger towards that monkey- \"This is the same monkey who had enslaved me and tied me up with creepers.\n\" Shakuni, the master archer became furious and sought Ritdhwaj's permission to kill that monkey.\n Ritdhwaj pacified him by saying- \"Bondage is because of your past Karmas, so it is useless to kill this poor monkey.\n\" He then requested the monkey to free his son- Jabaali from the weight of the three branches, which were still tied to his body.\n The monkey opened the knots and Jabaali was now absolutely free.\n Ritdhwaj was pleased and wanting to bless the monkey, said- \"You can demand anything from me.\n I am willing to fulfil any of your wishes.\n\" The monkey replied by saying- \"O great sage! Didn't you recognise this unfortunate monkey?\n I am Chitranagada's father whom you had cursed to become a monkey.\n Bless me that I become liberated from all my sins.\n\" Ritdhwaj blessed the monkey and said- \"You would be liberated from all your sins, the day you procreate a child from Ghritaachi.\n You would also regain your human body on that day.\n\" The monkey became pleased after receiving the blessings.\n In course of time, Ghritaachi became aware of the monkey's real identity and developed physical intimacy with it.\n At first, both of them stayed at Kolaahal Mountain but later on, they shifted to Vindhya Mountain.\n Meanwhile the group of five people- Ritdhwaj, Jabaali, Shakuni, Indradyumna and Surath reached Saptagodaavar Tirtha.\n All of them got down from the chariot and took bath in the holy river.\n The thirsty horses quenched their thirst and satisfied their hunger by grazing on the green grass.\n After satisfying their hunger, the horses galloped towards Haatkeshwar temple.\n When Chitrangada, and her companions heard the galloping sound, they climbed on top of the temple and looked all around.\n Chitrangada saw Ritdhwaj and his companions taking bath and immediately recognised him.\n Her companion- Nandayanti too recognised Jabaali.\n They were extremely pleased and climbed down from the rooftop of the temple.\n They worshipped and eulogised Lord Haatkeshwar to express their gratitude.\n After sometime, Ritdhwaj and his friends arrived at the temple to worship Lord Haatkeshwar.\n He recognised Chitrangada and was pleased to meet her.\n In the meantime, Ghritaachi and the monkey also arrived there.\n Ghritaachi was pleased to meet her daughter- Vedavati and embraced her.\n Ritdhwaj instructed the monkey to summon Guhyak from the Anjan Mountain, Kandarmaali from the Paatal loka and the Gandharva King Parjanya from heaven respectively.\n Guhyak, Kandarmaali and Parjanya arrived at the Haatkeshwar temple and all three of them were pleased to meet their respective daughters.\n Chitrangada accusing herself for her father's turning into a monkey, tried to give up her life.\n But Ritdhwaj consoled her by saying that her father would regain his human body very soon.\n Ghritaachi too approved his statement and said- \"After ten months, I would give birth to a son and on that same day, your father would be liberated from sage Gaalav's curse and regain his human body.\n\" After ten months, Ghritaachi gave birth to a son who later on became famous as Nala.\n Vishwakarma became liberated from the curse and regained his human body.\n Chitrangada was delighted to meet her father.\n A grand marriage ceremony was organised at Saptagodaavar, which was witnessed by the deities, the Gandharvas and the demons.\n In this marriage ceremony, sage Gaalav performed the rituals after which, Jabaali was married to Kandamaali's daughter, Indradyumna to Vedavati, Shakuni to the Yaksha's daughter and Surath was married to Chitrangada.\n After the marriage ceremony, everybody returned to their respective places.\n After completing this story, King Danda once again requested Araja to accept his proposal.\n But she was not convinced and said- \"Say whatever you like but I will never surrender to your evil intentions.\" ", "next": "6.19.4", "prev": "6.19.2", "title": "Search for Chitrangada and Vedavati"}