{"index": "6.19.4", "image": "resized_images/Sage Shukracharya Curses Danda.png", "text": " Prahlad says- \"Blinded by lust, Danda forcibly breached the modesty of unrelenting Araja and returned to his palace. Araja was saddened by the inability to protect her chastity and started wailing. When Shukracharya returned to his hermitage, he found Araja lying down at the entrance. He asked her about what transpired with her. Araja narrated the whole story, which made Shukracharya extremely furious and his eyes were reddened due to his anger. He thundered- \"The wicked Danda would become a pauper after losing his wealth and kingdom within a week.\" After cursing Danda, he instructed his daughter Araja to do penance so that she could become liberated from her sin and himself went to Paatal loka accompanied by his disciples. Shukracharya's curse came true and as a result, Danda lost his whole kingdom within a week. After narrating this story, Prahlad told Andhak- \"On account of the immoral deeds of King Danda, the deities abandoned Dandakaarnya and it was now inhabited by the demons. Now it must be clear to you that a person who breaches a chaste woman's modesty against her will is doomed to destruction. Andhak, you must not go ahead with your evil intention of marrying Parvati because she is Lord Shiva's consort whose might is unmatched.\" Andhak replied angrily- \"I have driven out the deities from heaven. Why should I get scared of Shiva who is fascinated by his wife's beauty?\" Prahlad tried his best to convince Andhak against going ahead with his evil plan but it had no effect on him. Andhak ordered his lieutenant Shambar to go to Mandaar Mountain and inform Lord Shiva that Parvati should be given to him (Andhak) if he (Lord Shiva) wanted to remain alive. Shambar went to Mandaar Mountain with narrated Andhak's desire to Lord Shiva. Hearing this, Goddess Parvati who was sitting besides Lord Shiva told Shambar that she would agree to marry Andhak on the condition that he defeats Lord Shiva in a battle. Shambar returned and narrated everything to Andhak. Now, Andhak's anger crossed all limits and he ordered Duryodhan to prepare for the war. Andhak's huge army was instructed to assemble. The whole atmosphere reverberated with the sound of bugles and war cries. Andhak proceeded towards Mandaar Mountain with a huge army, which consisted of mighty warriors like Jambh, Kujambh, Shambar, Virochan, Duryodhan and Vrishparva. Destiny led Andhak towards his own death trap. ", "next": "6.20", "prev": "6.19.3", "title": "Sage Shukracharya Curses Danda"}