{"index": "6.19.2", "image": "resized_images/Vishvakarma becomes a Monkey.png", "text": " Continuing with his story, King Danda says- \"Chitrangada stayed for a long period at Saptagodaavar. She used to spend time by engaging in the worship of Lord Haatkeshwar waiting for the day she would meet her husband. Vishwakarma had become a monkey due to the curse of that sage and started living at Shaalveya Mountain. One day, a demon named Kandarmaali arrived at the foothills of Shaalveya Mountain accompanied by his daughter- Vedavati. The monkey (Vishwakarma) held Vedavati by her hand. Kandarmaali became furious and took out his sword to kill the monkey. Sensing danger, the monkey ran away towards Himalaya Mountain carrying Vedavati in his lap. Kandarmaali chased him. On the way, the monkey abandoned Vedavati at the door of a secluded hermitage and hid himself in the waters of river Kalindi but was drowned. Kandarmaali had seen the monkey drowning and conjured that his daughter too might have drowned along with him. He returned to his abode in a remorseful mood. The ferocious current of Kalindi river carried that monkey to a famous place called Shivi. After regaining his consciousness, he returned to the place where he had left Vedavati. After reaching that spot, he found Anjan accompanied by his daughter- Nandayanti treading along. He mistook Nandayanti for Vedavati and ran towards her. Sensing danger, Nandayanti jumped into the Hiranvati River and was carried by its ferocious current to Kaushal. When she regained her consciousness, Nandayanti found herself near a large Banyan tree. Sitting on the rock in a thoughtful mood, she heard a heavenly voice- 'Is there anybody who could inform sage Ritdhwaj about his son's captivity and who has been tied to this Banyan tree?' Nandayanti was surprised to find a 5 year old child being tied to the topmost branch of the Banyan tree. On being enquired, the child told her- \"My name is Jabaali. Sage Ritdhwaj is my father who has blessed me with 5000 years of childhood birth, 10,000 years of adolescence and 20 years of adulthood respectively. But he had also warned me of being held captive for the period of 500 years during my childhood. One day, I had gone to take bath in the Hiranvati River when suddenly, I came across a huge monkey who enslaved me. I am living here in captivity since then.\" After narrating his story, Jabaali enquired about Nandayanti's identity. Nandayanti told everything, which had happened to her. Jabaali advised her to go to Shrikanth temple situated on the bank of river Yamuna and said- \"There, you would meet my father Ritdhwaj who comes to the temple daily in the afternoon to worship Lord Shiva. You can seek his help.\" Nandayanti went to Ritdhwaj's hermitage as per the instruction of Jabaali. One day while she was worshipping in the Shrikanth temple, she saw those lines inscribed by the sage, who had once cursed her father- Vishwakarma. She added one more line to that inscription- \"Sage Mudgal had prophesised that I would become a queen. Instead of becoming a queen, I am going through my most turbulent period. Is there anyone who could help me out?\" After that, she went to the bank of river Yamuna where she found a beautiful hermitage. She entered inside the hermitage and found Vedavati sitting there. Very soon, both of them became fast friends. In the meantime, sage Ritdhwaj had gone to offer prayers in the Shrikanth temple and saw those lines inscribed on its walls. He went into deep contemplation and understood what those lines meant. After worshipping, he left for Ayodhya where he met King Ikshvaaku. He requested Ikshvaaku to instruct his son- Shakuni to release Jabaali from the monkey's captivity. Ikshvaaku instructed his son to fulfil sage Ritdhwaj's desire. All three of them including Ikshvaaku went to the site of Jabaali's captivity. Shakuni being a master archer, cut all the creepers that had grown around Jabaali. Sage Ritdhwaj climbed up the tree and found that Jabaali was tied to the branch. He tried to open the knot but was unsuccessful and called Shakuni for help. Shakuni tried hard to open the knot but even he was unsuccessful. He then cut that branch into three pieces by unleashing a volley of arrows. Thus Jabaali became free albeit partially as he was burdened with the three pieces of that branch. ", "next": "6.19.3", "prev": "6.19.1", "title": "Vishvakarma becomes a Monkey"}