{"index": "6.2.1", "image": "resized_images/Shiva Returns to Mandaar Mountain.png", "text": [" DAKSHA PERFORMS A GRAND YAGYA Pulastya says- \"This way, both Shiva and Sati lived above the clouds till the end of rainy season.", " When autumn season arrived, both decided on returning to Mandaar Mountain.", " Daksha had organised a grand Yagya in which he had invited all the prominent deities and sages except his own son-in-law, Shankar and his daughter, Sati.", "\" Narad was surprised as to why Maheshwar- the lord of all splendours was not invited by Daksha.", " He was also curious to know why Lord Shankar had become a Kapaali (a mendicant).", " Pulastya told him that during the period of final annihilation, Lord Vishnu after waking up from his sleep found a divine entity, who possessed three eyes, who had a trident in his hands and who wore a Rudraksha garland around his neck.", " Lord Vishnu then created ego, which had its evil effects on both Brahma and Shankar.", " Lord Shiva in his arrogance asked Brahma, his identity and origin.", " Lord Brahma then arrogantly asked Shankar, his identity.", " This way, a dispute ensued that later on turned into a fight in which, Brahma defeated Shankar.", " Lord Shiva severed two of the five heads of Lord Brahma.", " But the second head fell and got stuck on Lord Shiva's left palm.", " Angrily, Lord Brahma created a terrific creature, which challenged Shankar and ridiculed him by saying that as he (Shankar) was a sinner, therefore, he would not dirty his hands by killing him.", " Lord Shankar was ashamed of himself.", " He went to Badrikashrama and requested Lord Vishnu for some alms.", " Lord Vishnu asked Shankar to hit on his (Vishnu's) left arm.", " Shankar hit Vishnu's left arm with his trident and the impact resulted in the creation of three streams.", " The first stream went up in the sky and established itself as Akashganga.", " The second one was Mandakini, which was received by sage Atri.", " The third stream fell on the skull, which was stuck in Lord Shankar's left palm.", " This resulted in the manifestation of a divine child who was ferocious and well armed with bow and arrows.", " Shankar instructed him to kill that creature, which was created by Brahma.", " A tremendous duel was fought between them, which was inconclusive for thousands of divine years. "], "next": "6.2.2", "prev": "6.2", "title": "Shiva Returns to Mandaar Mountain"}