{"index": "6.2.3", "image": "resized_images/Sati Gives up her Life.png", "text": [" Sage Pulastya says- \"O Narad! This way, Lord Shiva became famous as Kapaali.", " This was the reason why Daksha did not invite him.", " In the meantime, Jaya, sage Gautam's daughter went to see Sati at Mandaar Mountain.", " Seeing her alone, Sati asked about her two sisters, Jayanti and Aparajita.", " Jaya revealed to her that both of them had gone to their maternal-grandfather's (Daksha) Yagya.", " Jaya also told her that all the deities had been invited to the Yagya.", " When Sati heard this, she was grieved and angry with her father.", " In a fit of rage, she gave up her life.", " Seeing her lifeless body, Jaya started wailing.", " Lord Shiva arrived there and upon hearing Jaya's wails, asked her why Sati was lying on the ground.", " Jaya then narrated the whole story.", " Lord Shankar became so infuriated that it resulted in the creation of numerous Ganas among whom Veerbhadra was the most prominent one.", " Lord Shiva accompanied by the Ganas went to the site where Daksha was performing the Yagya.", " A tremendous battle ensued between them and the deities and finally, the deities were overpowered and ran away from the site.", " Veerbhadra, finding the time opportune, entered the oblation site.", " When the deities saw him entering the oblation site, they returned and tried to prevent him from doing so.", " Again, an intense battle erupted between both the sides.", " The deities used all kinds of weapons but they could not control the onslaught of Veerbhadra and fled.", " Veerbhadra then went near the sacrificial fire.", " The sages were terrified and ran towards Lord Vishnu who attacked Veerbhadra with arrows but it did not hurt him at all.", " Vishnu then attacked him with other divine weapons.", " But still, Veerbhadra succeeded in neutralising those weapons.", " Vishnu was enraged and attacked him with his Sudarshan chakra that Veerbhadra swallowed.", " This angered Lord Vishnu further.", " He lifted Veerbhadra and dashing him to the ground, pressed Veerbhadra's stomach as a result of which, the Sudarshan chakra came out from his mouth.", " But Lord Vishnu spared Veerbhadra's life.", " Veerbhadra then went to Lord Shiva and narrated his woeful tale of defeat.", " Lord Shiva instructed Veerbhadra to leave for a safer haven and himself went to the oblation site accompanied by Bhadrakali.", " The sages became scared on seeing his terrifying appearance. "], "next": "6.2.4", "prev": "6.2.2", "title": "Sati Gives up her Life"}