{"index": "6.20.2", "image": "resized_images/The Battle Commences.png", "text": [" Pulastya says- \"When the Ganas saw Andhak's army approaching the Mandaar Mountain, they made a loud roar, which reverberated through the land and sky.", " Hearing this roar, Lord Ganesha became apprehensive and went to Mandaar Mountain to ask Lord Shiva about the origin of that tremendous roar.", " Lord Shiva told him- \"I am going to fight a battle with Andhak.", "\" Lord Ganesha also expressed his willingness to accompany him.", " Lord Shiva then entrusted the job of Parvati's security to prominent Matrikas like Maalini, Jaya, Vijaya, Aparajita and Jayanti.", " He then went to fight Andhak holding his weapon- trident in his hand and mounted on a bull.", " The Ganas made a protective ring and surrounded him from all sides.", " In a very short time, both armies confronted each other and a tremendous battle began in which the Ganas crushed many demons to death.", " The demons retaliated by attacking them with mace and swords.", " All the deities assembled in the sky to witness this battle.", " Mahapashupat attacked the demons with such force that it caused great losses to the enemy.", " On seeing death and destruction caused in the demon's camp, Tuhunda- the mighty demon attacked the Ganas with his most destructive weapon- Paridhi, which scared the Ganas and they fled.", " Then Lord Ganesha came forward to fight Tuhunda.", " Tuhunda assaulted him with his weapon- Paridhi but it fragmented into hundreds of pieces after dashing against Ganesha's belly.", " On seeing the destruction of his maternal uncle's most destructive weapon, Rahu came running towards Lord Ganesha and held him tightly.", " Lord Ganesha, Ghatodar and Sukeshi assaulted him simultaneously with their respective weapons.", " Writhing in pain, Rahu immediately released Ganesha.", " Seeing the time opportune, Lord Ganesha severed Tuhunda's head with his axe.", " After killing Tuhunda, Lord Ganesha attacked the demons but the attack was repulsed by the mighty Bali.", " In this battle, the Ganas were finally able to annihilate the demons.", " Shambar protected himself by taking Shukracharya's refuge and all the surviving demons including Andhak followed suit. "], "next": "6.20.3", "prev": "6.20.1", "title": "The Battle Commences"}