{"index": "6.20.6", "image": "resized_images/Marut Ganas of Different Manvataras.png", "text": " Sage Pulastya says- \"O Narad! Now, I am going to describe about the origin of Marut Ganas of various Manvantaras. Savan was Swayambhu Manu's son. He had no sons and when he died, the sorrowful queen- Sudeva heard a heavenly voice, which instructed her to give up her life by jumping into the burning pyre.\" \"You would become a proud mother of seven sons\", said the heavenly voice. The queen acted accordingly and died after jumping into the burning pyre.\" \"The souls of the dead king and queen ascended towards the sky. The prophesies made by the heavenly voice came true and Sudeva found herself in her periods. The king enjoyed a physical relationship with the queen for five days. Incidentally, few drops of sperms fell towards earth. After this both the souls departed towards Brahma loka. These falling drops of sperms were gathered by the wives of some sages and stored in a lotus flower. Those women were Samana, Nalini, Vayushmati, Chitra, Vishakha, Harita and Alini. They mistook the sperms for ambrosia and drank it after getting permission from their husbands. But after drinking it, they became devoid of their effulgence and were abandoned by their respective husbands. In course of time, they gave birth to seven sons who became famous as Aadya Maruts during Swayambhu Manvantara.\" After having described about the Marut Ganas, sage Pulastya went on to describe about Swarochish Manvantara- \"Kratudhwaj was the son of Swarochish Manu. He had seven sons. All of them went to Meru Mountain to do penance as they were desirous of Indra's kingdom. Indra being scared instructed Putna to create hurdles in their penance so that Kratudhwaj's sons wishes remained unfulfilled.\" \"Putna went to the place where Kratudhwaj's sons were doing penance. There was a river nearby where Kratudhwaj's sons arrived one day to bathe. Acting according to her plan, Putna too entered into the river to take bath. Kratudhwaj's sons were infatuated by her divine beauty. They could not control themselves and as a result, they had an ejaculation. Putna was successful in accomplishing her mission of corrupting the thoughts of Kratudhwaj's sons, who after realising that their penance had gone in vain returned to their father's kingdom. The released sperms of Kratudhwaj's sons was swallowed by a fish named Shankhini. One day, she was caught by a fisherman and presented to Kratudhwaj's sons, who again released her into a nearby pond. In course of time, Shankhini died after giving birth to seven young fish. The seven young fish started crying at their mother's death. Lord Brahma appeared and advised them not to cry and for this reason, they were called Marut. Lord Brahma blessed them by saying- \"All of you would attain the status of deities and would be capable of flying in the air.\" After finishing his story, sage Pulastya told Narad that this was how Marut Ganas originated during Swarochish Manvantara. Sage Pulastya says- \"Now, I am going to describe about the Marut Ganas of Uttam Manvantara. Jyotishmaan was the son of Vayushmaan and his wife was the daughter of sage Vrihaspati. As they were sonless, both of them decided to do penance to beget a son. The Saptarishis arrived there and enquired as to why they were doing such a severe penance. Jyotishmaan's wife told the Saptarishis that they were desirous of a son. The Saptarishis blessed her by saying that she would become a mother of seven sons. In course of time, Jyotishmaan's wife became pregnant. One fateful day, Jyotishmaan passed away. His sorrowful wife wanted to commit Sati. While he was sitting on the burning pyre, suddenly, a piece of burning flesh fell into the nearby river and got fragmented into seven pieces. Seven Marut Ganas manifested from these seven pieces of flesh.\" Sage Pulastya says- \"During Taamas Manvantara, Ritdhwaj, the son of Taamas Manu did a severe penance with the desire of getting a son. He made offerings of his own flesh, blood and sperms to the oblation fire. Suddenly, he heard a heavenly voice instructing him not to make offerings of his sperms. But the king continued with his offering and as a result, he died. After sometime, seven infants manifested from the oblation fire who later on became famous as the Marut Ganas of Taamas Manvantara.\" King Ripujeet was the descendant of Raivat. He was sonless and after being pleased by his extreme devotion, the deity- Sun had blessed him with a daughter named Surati. In course of time, she grew into a beautiful woman. One day, Ripujeet passed away and a grieved Surati decided to give up her life. The Saptarishis arrived there and they were so infatuated by her beauty that they tried to prevent her from doing so. But unrelenting Surati did not listen and gave up her life by jumping into the burning pyre. The sorrowful Saptarishis went away after casting lusty glances on her. Seven infants manifested from the burning pyre, who became famous as Marut Ganas of Raivat Manvantara. During Chaakshush Manvantara, a sage named Manki did a tremendous penance at the banks of Saptasaraswat. But he fell down from grace after being infatuated by the beauty of an Apsara named Vapu. His sperms ejaculated and fell into the Saptasaraswat river from which manifested the seven Marut Ganas. ", "next": "6.20.7", "prev": "6.20.5", "title": "Marut Ganas of Different Manvataras"}