{"index": "6.20.4", "image": "resized_images/Lord Shiva Kills Andhak.png", "text": " Inspite of death and destruction caused to his army, Andhak still wanted to continue fighting against Lord Shiva's army.\n He even dismissed the advises of Shukracharya who wanted a momentary retreat and rebuffed him by saying- \"All the deities including Maheshwar and Indra cannot save themselves from my wrath.\n Very soon, I am going to vanquish them.\n\" He then instructed his charioteer to move the chariot towards enemy's position.\n He shot a volley of arrows, which entirely covered the deities.\n Lord Vishnu advised the deities to kill Andhak along with his charioteer and destroy the chariot so that Lord Shiva could kill Andhak without any difficulty.\n All the deities then attacked the demons with renewed vigour.\n Lord Vishnu killed thousands of enemy's horses with his mace.\n Skand killed the charioteer and Vinayak accompanied by the Ganas destroyed Andhak's chariot.\n After being bereft of his chariot, Andhak attacked the deities with his mace.\n Seeing the deities in danger, Lord Shiva concealed them within his body and challenged Andhak for a duel.\n Andhak tried to attack Lord Shiva who was mounted on Nandi.\n Lord Shiva immediately jumped down from Nandi's back and attacked Andhak with his trident, which pierced his chest.\n Even after being seriously injured, Andhak did not die instead he pulled Lord Shiva for one mile holding him tightly in his clutch.\n Lord Shiva tried to resist by attacking for the second time.\n But Andhak retaliated by hitting Shiva with his mace causing serious injury on his head.\n A stream of blood oozed out from the wound, which poured down towards all the four directions.\n The blood stream which poured down towards east resulted into the manifestation of Bhairav named Kaalraj.\n Similarly, Kamaraj, Chakramala, Somaraj, Swachcharaj, Lalitraj and Vighnaraj manifested from the other three directions.\n Lord Shiva then lifted Andhak above his head with the help of his trident, which was still pierced in Andhak's chest.\n His body had become red due to the blood oozing out from Andhak's wound.\n Lord Shiva had toiled hard to kill Andhak and as a result, he was perspiring profusely.\n The sweat drops originating from Shiva's forehead resulted into the manifestation of a divine girl while the sweat drops that fell on the ground from Shiva's face resulted into the manifestation of a divine boy.\n Both the children started gulping down the blood emanating from Andhak's wound.\n Lord Shiva named the girl child as Charchika while the boy child was named Mangal and blessed both of them.\n Lord Shiva held Andhak above his head for 1000 divine years, which reduced his body to a skeleton.\n At last, Andhak realised his mistake and begged for forgiveness.\n He eulogised Lord Shiva and hailed his greatness.\n Lord Shiva told him that he would forgive him only when he accepts Parvati as his mother.\n Andhak agreed not only to accept Parvati as his mother but also Shiva as his father.\n Shiva became pleased and lowered down his trident.\n He healed Andhak's wound by his divine touch.\n The deities became pleased at Andhak's change of heart and blessed him.\n Lord Shiva then took Andhak to Mandaar Mountain.\n Parvati was still hiding behind the bushes.\n When she saw Lord Shiva approaching, she recognised him and called her companions to come out from their hiding.\n Lord Shiva gleefully told Parvati that Andhak had now become her slave.\n \"Look at him.\n He is making salutations to you.\n Accept him as your son.\n Andhak then eulogised Parvati with complete devotion.\n Parvati became pleased and expressed her desire to bless him with a boon.\n Andhak said- \"I don't want anything.\n I just want to become liberated from all my sins and remain in the proximity of Lord Shiva.\n\" Parvati blessed him and made him the Gana of Shiva who became famous as Bhringi. ", "next": "6.20.5", "prev": "6.20.3", "title": "Lord Shiva Kills Andhak"}