{"index": "6.20.3", "image": "resized_images/Shukracharya Uses Sanjeevani Vidya.png", "text": " Andhak went to Shukracharya and narrated the woeful tale of demons' defeat.\n He also requested Shukracharya to help the demons win the battle.\n Shukracharya was dejected but he assured the demons that he would make alive, all the dead demons with the help of Sanjeevani Vidya and really all the mighty demons like Jambh, Kujambh etc.\n became alive once again.\n When Nandi came to know about this unbelievable incident, he went to Lord Shiva and informed him.\n Lord Shiva instructed him to bring Shukracharya by any means.\n \"I shall control him by my Yogic power\", said Lord Shiva.\n Nandi infiltrated into the demon's army but Hayakandhar spotted him and tried to resist his forward march.\n Nandi attacked Hayakandhar with his Vajra as a result of which, he fell down unconscious.\n After this, Kujambh, Jambh and some other demons ran menacingly towards Nandi.\n They surrounded him from all sides and started assaulting him ruthlessly.\n On seeing Nandi in danger, Lord Brahma became very worried and instructed the deities to help him.\n Indra and all the other deities joined Lord Shiva's army and fought bravely against the demons.\n The sudden entry of the deities in the battlefield had distracted the attention of the demons and as a result, Nandi got an opportunity to penetrate through the rank and files of demons army.\n Ultimately, he successfully accomplished his mission and brought Shukracharya to Lord Shiva after abducting him.\n Lord Shiva wasted no time and swallowed Shukracharya immediately.\n The next moment, Shukracharya found himself in Lord Shiva's stomach.\n Shukracharya made frantic efforts to come out of the stomach but was unsuccessful.\n Being helpless, he started eulogising Lord Shiva.\n After becoming pleased by Shukracharya's extreme devotion, Lord Shiva expressed his desire to bless him with a boon.\n Shukracharya requested Lord Shiva to give him a way so that he can come out from his stomach.\n Lord Shiva agreed and asked him to come out immediately.\n Shukracharya started searching for an exit point but was amazed by the vastness of Shiva's stomach in which he saw the existence of the whole universe.\n He made ceaseless effort for one divine year but was unsuccessful in his attempts to come out from Shiva's stomach.\n At last, he surrendered to the will of Lord Shiva.\n Lord Shiva told Shukracharya- \"By entering into my stomach, you have become my son.\n Now, if you want to become free then you should come out through the pore of my Linga.\n\" After saying this, Lord Shiva liberated Shukracharya through his Linga who after being released made salutations to him and joined the demons' army once again.\n The demons were extremely pleased at his arrival.\n Once again, a fierce battle took place, which continued for eight divine years.\n When the demons realised about the deities' supremacy in the battle, they started employing illusionary tactics and swallowed all the Ganas and the deities.\n The scene of the battlefield, Mandaar Mountain became devoid of Ganas and the deities, which made Lord Shiva extremely furious.\n His extreme anger resulted into the manifestation of Jrimbhayika- a ferocious entity.\n The mere touch of Jrimbhayika made the demons to yawn.\n All the deities and the Ganas came out from the opened mouths of the demons.\n Once again, the battle commenced, which continued for 700 years.\n When Andhak realised that Lord Shiva was invincible then he decided to acquire Parvati by deceitful means.\n He sought the help of one of his most trusted commander- Sunda by saying- \"O brave Sunda! You are like my brother.\n I need your help.\n The battle has continued for such a long period but has still remained indecisive.\n I have decided to approach Parvati in the guise of her husband- Shiva and I want you to disguise yourself as Nandi.\n\" Sunda agreed to disguise himself in the form of Nandi to help his master.\n Andhak went to Mandaar Mountain in the guise of Lord Shiva mounted on Sunda's back who had disguised himself as Nandi.\n When Parvati saw the injury marks on Shiva's (Andhak's) body, she told her companions- \"Look, how grievously the demons have injured my husband! Please bring the medicinal herbs quickly so that I can dress his wounds.\n\" Her companions rushed to bring the medicinal herbs and in the meantime, Parvati started observing the wounds of Shiva (Andhak) minutely.\n She was surprised to see the absence of both the shoulders on his body.\n She immediately realised that somebody else had come in the guise of her husband- Shiva.\n Sensing danger, she ran away to protect herself.\n Her companions ran behind her and Andhak chased all of them.\n Parvati and her companions hid behind bushes.\n Being unable to locate Parvati, Andhak returned to the battlefield and the battle continued.\n The deities were fighting valiantly.\n Lord Vishnu created havoc among the enemy ranks and Lord Brahma sprinkled holy water from his kamandalu, which had increased the strength and power of the deities.\n Indra attacked the demon- Bala on his head with his Vajra but it was broken into pieces.\n On seeing the destruction of his weapon, Indra became scared and wanted to flee from the battlefield.\n Jambh, the demon made fun of him and challenged him for a duel.\n Indra then requested Lord Vishnu to provide him with a weapon so that he could fight Jambh but Lord Vishnu sent him to Agni.\n Agni made a replica of his weapon- Shakti and gave it to Indra.\n Holding his new weapon, Indra then proceeded on his way to fight Jambh mounted on his elephant- Airavat.\n Jambh assaulted Airavat with such force that Indra started falling down towards the ground.\n When the Siddhas and Charanas saw Indra falling down, they provided a magnificent chariot to him so that he could fight with the demons.\n Meanwhile Indra dashed against the ground with a great thud as a result of which, the earth shook violently.\n Sage Shamik's wife thought that the earth was shaking violently due to the impact of earthquake.\n She requested her husband to carry their son outside the hermitage so that he remains unharmed and said- \"The astrologers say that whatever is kept outside home during an earthquake becomes stable.\n\" Sage Shamik was very surprised but still followed her instructions.\n After the shaking of the earth had subsided, Shamik's wife requested him to bring back the child.\n Sage Shamik went outside and was surprised to find two children instead of one.\n He came back carrying both the children in his lap and asked his wife as to what made the second child to manifest.\n She told him that the second child will become the charioteer of Indra and assist him in the battle.\n This second child was none other than Maatali who acted as the charioteer of Indra during the battle.\n Now, Indra had both the chariot and the charioteer in his possession.\n He went to the battlefield mounted on his new chariot.\n On the way, he saw a multicoloured bow and arrows lying on the ground.\n He picked up the weapons and fought valiantly with the demons.\n He killed many mighty demon warriors.\n Jambh and Kujambh ran menacingly towards him but Lord Vishnu severed the head of Kujambh with his Sudarshan chakra.\n Jambh assaulted Indra with his mace but Indra retaliated by attacking with his Shakti as a result of which Jambh was killed. The rest of the demons fled from the battlefield. ", "next": "6.20.4", "prev": "6.20.2", "title": "Shukracharya Uses Sanjeevani Vidya"}