{"index": "6.20.5", "image": "resized_images/The Origin of Marut Ganas.png", "text": " Narad asked Pulastya about the battle which Indra fought with the demon at Malay Mountain. Pulastya replied- \"Andhak's followers- Maya and Taar tried to enter Pataal loka after being defeated by the deities. While they were passing close to the Malay Mountain, they decided to live there being enchanted by its natural beauty. The caves of Malay Mountain were inhabited by sages who were Lord Shiva's devotees. The demons started causing obstacles in the rituals performed by the sages. When Lord Shiva came to know about this, he instructed Indra to go to Malay Mountain and help the sages. Indra went to Malay Mountain and successfully drove out the demons from there. Narad again asked Pulastya as to why Indra was also known as Gotrabhit. Pulastya narrated the following tale- \"After her son's death, Diti requested her husband, Kashyap to bless her with another son so that Indra could be killed. Sage Kashyap advised her that she would get her desire fulfilled after the successful accomplishment of her penance lasting for 100 divine years. In course of time, Diti became pregnant. One day, sage Kashyap left for Udaygiri Mountain to do his penance and Diti was left all alone. One day, Indra arrived at the hermitage and expressed his desire to be at Diti's service if she permitted. Diti gave permission and Indra engaged himself in serving her. He used to keep the oblation site clean and bring dry wood necessary for the performance of Yagya. This continued for 1000 divine years. One day, Diti was taking rest after her bath. She had postponed her penance for sometime because of her impurity. As she was tired, very soon, she fell asleep. Seeing the moment opportune, Indra entered into her womb through her nostrils and cut the foetus into seven parts. After waking up, Diti realised about her foetus' destruction. Indra was very scared on the prospect of being cursed by Diti and said- \"I am not the cause of your foetus' destruction. It has been destroyed due to your own impurity. So please don't curse me.\" Diti replied- \"You are certainly not responsible for my foetus' destruction. It was all in my destiny. From the pieces of the foetus manifested the Marut Ganas and since Indra had tried to harm his own uterine brothers therefore he became famous as Gotrabhit. ", "next": "6.20.6", "prev": "6.20.4", "title": "The Origin of Marut Ganas"}