{"index": "6.21.1", "image": "resized_images/Bali Rules Heaven.png", "text": [" The mighty Banasura saw the demons running away from the battlefield and came to their rescue.", " The arrival of Banasura boosted the morale of the defeated demons and they returned to fight the deities.", " Lord Vishnu advised the deities to fight gallantly and disappeared from the battlefield.", " Shukracharya assured the demons of their victory because he thought that the deities would be no match for the demons might in the absence of Lord Vishnu.", " Once again, a fierce battle commenced.", " Bali attacked the deities ferociously with his mace.", " Banasura devastated the deities' army with his thousand hands.", " Ultimately, the deities were defeated in this battle and the heaven came under the control of demons.", " The defeated deities took refuge in Brahma loka after abandoning the heaven.", " Bali ruled the heaven with the help of his relatives.", " One day, Bali called his father- Prahlad to heaven and requested him to become the ruler of heaven but Prahlad refused by saying- \"As I have chosen the path of Yoga after relinquishing everything, it would not be proper for me to get attached to worldly matters once again.", " Since you have snatched heaven from the deities on account of your valiance, hence the heaven belongs to you.", "\" Bali requested Prahlad to enlighten him on the duties of a king and on the virtuous deeds which would enable him in attaining Dharma, Arth, Kama and Moksha.", " Prahlad advised Bali to rule in a just manner and for the benediction of the world.", " He also advised Bali to engage himself in the service of all the three castes so that they remain loyal to him.", " Prahlad said- \"Virtuosity increases when people unwaveringly follow their Dharma.", " Increase in virtuosity helps a king to rule without any problem.", "\" Bali agreed to rule in a just manner as per the advice of Prahlad. "], "next": "6.21.2", "prev": "6.21", "title": "Bali Rules Heaven"}