{"index": "6.22.4", "image": "resized_images/Prahlad’s Pilgrimage.png", "text": [" Pulastya says- \"Prahlad went to the sacred place called Rishikanya and took a holy dip in the Irawati River.", " After that, he worshipped Lord Janardan in the temple situated nearby and then proceeded on his journey towards Kurukshetra.", " After reaching there, he worshipped Lord Kurudhwaj and paid a visit Lord Narsimha temple.", " After taking a holy dip in the river Devika, he proceeded on towards Gokarna Tirtha where he took bath in river Prachi and worshipped Lord Vishwakarma.", " Ultimately after visiting numerous sacred places, he reached Madhunandini where he worshipped Lord Shiva who had a chakra in his hands and Lord Vishnu possessing a trident.", "\" Narad was surprised and asked Pulastya why Lord Shiva and Lord Vishnu had held Sudarshan chakra and trident respectively.", " Pulastya explained- \"During ancient times, there was a mighty demon king named Jalodbhav.", " He had pleased Lord Brahma by his severe penance and was blessed by him to become immortal.", " After receiving the boon, Jalodbhav became arrogant and started tormenting the deities and the sages.", " The deities sought the refuge of Lord Vishnu.", " They accompanied Lord Vishnu to Himalaya Mountain to meet Lord Shiva.", " Lord Vishnu and Lord Shiva exchanged their weapons.", " Both of them went to kill the demon who on seeing them got scared and hid in a nearby river.", " Lord Vishnu and Lord Shiva waited eagerly for him on the opposite banks of the river.", "\" \"After sometime, Jalodbhav came out of the river thinking that both of them must have departed by now.", " He climbed up the Himalaya Mountain and both the deities chased him.", " Lord Shiva attacked him with his chakra while Lord Vishnu pierced his trident in his chest.", " Jalodbhav died and fell down from the Himalaya Mountain.", "\" After finishing his story, Pulastya says- \"This was the reason why both Lord Vishnu and Lord Shankar had exchanged their weapons.", " The spot where Lord Shankar had kept his foot resulted into the manifestation of river Vitastaa.", " Prahlad after worshipping Lord Vishnu and Lord Shiva at Madhunandini went to Bhrigutung Tirtha situated on the Himalaya Mountain.\" "], "next": "6.22.5", "prev": "6.22.3", "title": "Prahlad’s Pilgrimage"}