{"index": "6.22.2", "image": "resized_images/Pururava Regains his Good Looks.png", "text": [" Pulastya says- \"After worshipping Lord Trivikram, Prahlad went to Lingabhedak Mountain and worshipped Lord Shankar.", " He also visited many more sacred places like Kedar Tirtha, Badrikashrama, Bhadrakarna and Vipaasha.", " At last, he reached Irawati and worshipped that Almighty Lord with whose blessings, Pururava was able to regain his good looks.", "\" Narad was curious to know this story.", " Pulastya says- \"Once upon a time, there lived a rich trader named Sudharma.", " Once, while passing through the Surashtra desert, he was attacked by bandits and robbed of all his possessions.", " Dejected, he started wandering in the desert like a lunatic.", " He saw a Shami tree and decided to take rest under its shade.", " On this tree lived numerous ghosts.", " On seeing Sudharma, the leader of the ghosts asked him as to where he was going.", " Sudharma narrated his woeful tale which made the ghosts very sad.", " The leader of the ghosts said- You must not lose heart.", " If you are destined to possess wealth then you would become wealthy once again but worrying about your lost wealth will only have ill effects on your health and you would become weak.", " On being instructed by their leader, the ghosts offered food to the hungry Sudharma.", " After satiating his hunger, Sudharma asked the leader of the ghosts- Who are you?", " How could you provide me such a delicious dish in this deserted forest?", " The leader of the ghosts said- \"In my previous birth, I was a Brahmin and my name was Somasharma.", " I was very poor but my neighbour Somashrava was a rich and prosperous trader.", " Being a poor Brahmin, I was not able to perform my religious duties.", " Once, people of all castes thronged Irawati and Nadvala to take a holy dip on the auspicious occasion of Shravan Dwadashi.", " I followed them and after taking my bath, performed all the necessary rituals.", " As I was poor, I could donate things of little importance like umbrella, shoes, sweets, curds etc.", " This was the first and the last time, I had donated anything in my life.", " After my death, I became a ghost.", " My companions also never donated anything in their previous life.", " The delicious food which you had relished just now was due to the virtue of food items donated in my previous life.", " This Shami tree is due to the virtue of donating umbrella.", "\" Somasharma was surprised and asked the leader of the ghosts whether he could be of any help to him to which the leader requested him to offer Pind Daan at Gaya so that he became liberated from Preta Yoni.", " Somasharma went to Gaya and performed the necessary rituals of Pind Daan as a result of which, the ghosts went to Brahma loka after being liberated.", " Somasharma continued to observe the fast of Shravan Dwadashi every year.", " One fateful day, he passed away and was reborn in a royal family.", " After reaching youth age, he became the king of Shaakal Puri and indulged in enjoyments and sensual pleasures.", " After his death, he was born in a Brahmin family.", " Though ugly, he was well versed in all the scriptures.", " After a few years, he got married.", " His wife would make fun of his ugly looks which annoyed him.", " He went to Irawati and worshipped Lord Jagannath with full devotion.", " Lord Jagannath blessed him and his ugly looks turned into a handsome appearance.", " He enjoyed a very satisfied married life and after his death was reborn as King Pururava. "], "next": "6.22.3", "prev": "6.22.1", "title": "Pururava Regains his Good Looks"}