{"index": "6.22.1", "image": "resized_images/Dhundhu Performs Ashvamedhya Yagya.png", "text": " Pulastya says- \"During his pilgrimage, Prahlad visited many sacred places like Manas Tirtha, Kaushiki, Devahnad and Hastinapur etc. At last he reached the bank of river Yamuna where he worshipped Lord Trivikram (Vaaman).\" Narad was surprised at the mention of Vaaman's name and asked Pulastya- \"Lord Vishnu is still to take Vaaman incarnation then how come Prahlad visited his temple? Pulastya says-\"Sage Kashyap had an Aurasputra named Dhundhu. Lord Brahma had blessed Dhundhu of immortality. In course of time, Dhundhu defeated the deities and drove them out from heaven as a result of which, they had to take refuge in Brahma loka. When Dhundhu came to know that the deities were living in Brahma loka, he decided to attack Brahma loka. He consulted the demons but they told him that it was impossible for them to reach Brahma loka. Sage Shukracharya said- \"Indra had accomplished 100 Ashwamedha Yagyas by the virtue of which, he could go to Brahma loka. If you are desirous of reaching Brahma loka then you too will have to perform Ashwamedha Yagya.\" Dhundhu expressed his willingness to perform Ashwamedha Yagya. Shukracharya started making preparations for Ashwamedha Yagya at the bank of river Devika. He appointed his disciples and some other sages belonging to Bhargava's clan to supervise the Yagya ceremony. The Ashwamedha Yagya commenced and a horse was let loose according to the tradition. When the deities came to know about this Ashwamedha Yagya being performed by Dhundhu, they were scared and requested Lord Vishnu to disrupt the Yagya so that Dhundhu could not reach Brahma loka. Lord Vishnu assured the deities and went to the site where Dhundhu was performing Ashwamedha Yagya in a dwarf appearance. He entered into the Devika River and started drowning according to his plan. When the demons saw the dwarf (Lord Vishnu) drowning, they rushed to save him. After taking him out from the river, they asked him about his identity. The dwarf said- \"I am the youngest son of Prabhas. My name is Gatibhaas and my elder brother is Netrabhaas. After our father's death, my elder brother did not give me my due share in the property. When I insisted, he flung me into this river.\" The Brahmins who were performing the Yagya requested Dhundhu to donate wealth to Gatibhaas. Dhundhu agreed and said- \"I am willing to fulfil all your wishes. Demand anything you like. Gatibhaas demanded a small piece of land measured by three steps. Lord Vishnu then revealed his giant appearance and covered the whole earth with his first step. His second step covered the heaven and there was no place left for his third step. Lord Vishnu became furious and put his third step on the back of Dhundhu as a result of which he was crushed to death. A large pit measuring 1000 Yojans was created due to the impact of his weight and Lord Vishnu threw Dhundhu's dead body in that pit.\" After completing his story, Pulastya told Narad- \"This is how Lord Vishnu became Trivikram for the first time to defeat the evil designs of Dhundhu. Prahlad paid a visit to the temple of Vaaman situated at the place where Dhundhu was killed. ", "next": "6.22.2", "prev": "6.22", "title": "Dhundhu Performs Ashvamedhya Yagya"}