{"index": "6.22.7", "image": "resized_images/The Greatness of Sarasvat Stotra.png", "text": " Sage Pulastya says- \"There lived a Kshatriya who kept enemity towards Brahmins. After his death, he was reborn as a demon and spent his life indulging in nefarious activities. Once he saw a hermit doing penance. He wanted to devour him but was unsuccessful in his attempt as the hermit had protected himself by chanting Vishnupanjar stotra. So, he waited for the hermit for four months to come out from his meditative trance. After the completion of his meditation, the hermit was surprised to see a weak and frail demon waiting for him. He asked the demon about his identity and the purpose for which he was waiting there. The demon told him that although he had come with the intention of devouring him, he was unsuccessful in his attempt as he (hermit) was well protected by Vishnupanjar stotra. \"I am very impressed by your spiritual feats and I am desirous of learning the same from you. I have committed many sins in my life, so tell me how to become liberated from them\", asked the demon. But the hermit was not convinced and told the demon that he would never preach a demon. He advised the demon to take help of some other Brahmin. The demon went in search of another Brahmin. One day, he saw a Brahmin doing penance and caught hold of him. The Brahmin was frightened and requested the demon- \"Wait until I return after giving this fruit to my teacher.\" But the demon thought that the Brahmin was trying to escape hence he did not allow the Brahmin to leave. The worried Brahmin went near a burning fire and pleaded for help. Suddenly, Goddess Saraswati manifested herself and told the Brahmins- \"Don't be afraid. With my blessings, you would be able to narrate the means for the demon's benediction.\" After blessing the Brahmin, Goddess Saraswati disappeared. The Brahmin narrated the Saraswat stotra to the demon- You must chant the following stotra thrice in a day- 'I make salutations to Lord Hari who is also known as Krishna, Hrishikesh, Vasudev, Janardan and Jagannath. May he liberate me from my sins. I make salutations to Lord Vishnu who rests on Sheshnaag and who hails Shankchakra Gada and chakra in his hands, may he liberate me from my sins. Lord Vishnu who manifests himself in each individual soul just like the element of fire manifests itself in a piece of wood. May he liberate me from my sins.' The Brahmin told the demon that the daily chanting of Saraswat Vishnu stotra would enable him to get liberated from his sins. The demon was pleased and after releasing the Brahmin went to a place called Shaalgraam. He engaged himself in severe penance and started chanting the stotra taught by the Brahmin. Ultimately, he was successful in becoming liberated from his sins and went to Vishnu loka. ", "next": "6.23", "prev": "6.22.6", "title": "The Greatness of Sarasvat Stotra"}