{"index": "6.22.5", "image": "resized_images/Tales of Upamanyu and Shridama.png", "text": " Sage Narad was still not satisfied by Pulastya's explanation and asked Pulastya as to what compelled Lord Vishnu to give his chakra to Lord Shiva.\n Pulastya says- \"There used to live a learned Brahmin named Veetmanyu.\n He was well versed in all the Vedas and other scriptures.\n His wife's name was Atreyi and Upamanyu was his son.\n Inspite of his knowledge, Veetmanyu lived in absolute poverty and found it difficult to make arrangements for daily necessities.\n One day, young Upamanyu on being hungry started crying.\n His helpless mother consoled him by saying that if he worshipped Lord Shiva then he would even get nectar and would get liberated from the pangs of hunger for ever.\n Veetmanyu was surprised and asked as to who this Lord Virupaaksh was.\n Atreyi narrated the following story- During ancient times, there was a demon king named Shridama.\n He ruled over the whole earth.\n Once, he decided to snatch the Srivatsa- Lord Vishnu's dearest ornament from him.\n When Lord Vishnu came to know about his intention, he became furious but since he had no weapon at his disposal he went to take Lord Shiva's help in this regard.\n Lord Shiva gave Sudarshan chakra to him and said that with the help of that infallible weapon, he could kill anybody.\n But Lord Vishnu was not convinced about the weapon's destructive power and expressed his desire to test it on Lord Shiva himself.\n Lord Shiva agreed and Vishnu released the Sudarshan chakra towards him.\n As a result, Lord Shiva's body was severed into three parts- Vishvesh, Yagyesh and Yagyayajak.\n Now, Lord Vishnu became satisfied and made salutations to Lord Shiva to express his gratitude.\n\" \"Lord Vishnu went to the mountain where the demon Shridama lived and severed his head with the Sudarshan chakra.\n After killing the demon, Lord Vishnu returned to his abode- Ksheersagar.\n\" After finishing her story, Atreyi told Upamanyu that such was the greatness of Lord Virupaaksh.\n Upamanyu did a severe penance to please Lord Virupaaksh and was blessed by him as a result of which, he never felt hungry in his life. ", "next": "6.22.6", "prev": "6.22.4", "title": "Tales of Upamanyu and Shridama"}