{"index": "6.23.2", "image": "resized_images/Arrival of Lord Vaaman at Kurukshetra.png", "text": " Pulastya says- \"After satisfying Bharadwaj's curiosity about his different abodes, Lord Vaaman left for Kurukshetra where Bali was busy performing his Yagya. As soon as Lord Vaaman reached Kurukshetra, the whole earth started shaking violently and high tides rose in the ocean. Being frightened of Lord Vishnu, Agni did not accept the offerings made by Bali. Bali was very surprised by all these sudden developments. He asked Shukracharya about the reason for all these strange happenings.\" Shukracharya replied- \"O king of the demons! Definitely, all these strange happenings signifies the arrival of Lord Vasudev.\" Bali then asked Shukracharya as to what was the most appropriate way of honouring his eminent guest. \"What donations should I make to him so that he is pleased and satisfied?\", asked Bali. Shukracharya warned him by saying- \"Forget about donating anything otherwise you will get into serious trouble.\" Bali told him that he would not disgrace himself by refusing to meet the demands made by Vasudev. \"The way a man behaves in his speech, action and thoughts is the result of his past karmas. Are you not aware of the incident related with Koshkar which happened at Malay Mountain? Koshkar was the son of sage Mudgal. He was famous for his austerities and his wife too was very virtuous. In course of time, a son was born to them but alas he was blind and deaf. Koshkar's wife abandoned that child in front of her house. Incidentally, an ogress named Surpaakshi happened to arrive there and after seeing the abandoned child, exchanged him with her own child. She carried Koshkar's child to Shaalodar Mountain with the intention of devouring him. When her husband came to know about the incident, he reprimanded Surpaakshi for her misdeed. The demon warned the ogress that both of them would be cursed by the Brahmin and advised her to keep the child at the same place from where she had brought him.\" In the meantime, Koshkar came out from his hermitage after hearing the cries of Surpaakshi's child. He was surprised to find some other child instead of his own and told his wife- \"It seems that this child is under the influence of a ghost.\" After saying this, he protected the child by demarcating a round circle initiated with mantra around him. Right then, the ogress arrived and after keeping the Brahmin's child on the ground wanted to take back her own child. But she could not enter inside that circle. Koshkar took his child in his lap and went inside the hermitage. This way, the ogress returned to the mountain without her child. Koshkar brought up both the children with great care. He named the ogress's child as Diwakar while his own son was named Nisachar. As destiny would have liked it, Diwakar turned out to be a very studious child and became well versed in Vedas within a very short time whereas Nisachar was not interested in studies and had a bad habit of criticising everybody. Koshkar became furious and threw Nisachar in a well. There was a Amla tree inside that well and the child survived living on its fruits. This way, ten years passed and one day, Koshkar's wife arrived at the well to fetch water. On seeing his mother, Nisachar tried to convince her that he was her son but she was not convinced. He then accompanied his mother back home and narrated the reason why he had taken birth as a deaf and blind child. \"In my previous birth, I was the son of Vrishakapi and was very famous for my scholarly traits. In due course of time, I became very arrogant and started indulging in all sorts of evil deeds. After my death, I went to Raurav Narak and suffered all the tortures over there. I was reborn as a tiger and after being enslaved by a king, I was kept inside a cage. Once, the king had gone out and the beautiful queen arrived near the cage. I was infatuated by her beauty and expressed my lusty desires to her. She was taken aback by my proposal and said- \"How can physical relationship be possible between us?\" But I requested her to release me by opening the cage door. The queen opened the door and I became free. I caught hold of her and tried to satiate my lust but right then the guards arrived there and killed me. Once again I went to the hell and after suffering the pains I was reborn as an ass. My master was Agniveshya, a Brahmin. Once, his wife- Sumati wanted to go to her father's house. Agniveshya advised her to go riding on my back and instructed his servant to escort us. While on our journey, we reached a river and Sumati expressed her desire to take bath. She went to take bath and I waited for her to return. While she was taking her bath, I became infatuated by her beauty and caught hold of her. The servant who was escorting us saw this and became angry. He killed me by hitting with his stick. Once again, I went to hell and was reborn as a parrot. A wicked fowler trapped and sold me to a trader's son. Although I lived a luxurious life, yet I was not happy because of my slavery. Once, his daughter arrived near my cage and playfully kept me on her breasts. I became infatuated and tried to have physical relations with her. But I was suffocated to death after getting entangled in her necklace. Once again, I went to hell and after suffering the tortures, was reborn as a bull. My master was a Chandaal and I used to pull his cart. Once, his wife was sitting in the cart I was pulling. Unmindful of her surroundings, she was singing songs in a beautiful voice. After listening to her melodious voice, I became infatuated and tried to have physical relations with her. I turned back but the noose around my neck became tight and I was suffocated to death. Once again I went to hell and after suffering the pains, was reborn as a blind and deaf son to you. I remember all my previous lives and I am aware that my physical disabilities are only because of my past sins. I have decided to atone for all my sins by doing penance and indulging in virtuous deeds. After saying this, he went to Badrikashrama to do penance. After finishing his story, Bali told Shukracharya that a man inherits his qualities from his past life and it is impossible for him to change them. \"It is applicable to both good and bad qualities. My penance, virtuosity, benevolence and generosity have been inherited from my past life and come what may, I have decided not to shun them.\" Pulastya says- \"This way, Bali remained firm in his resolve to meet any demand made by his esteemed guest and started waiting eagerly for his arrival.\" ", "next": "6.23.3", "prev": "6.23.1", "title": "Arrival of Lord Vaaman at Kurukshetra"}