{"index": "6.23.1", "image": "resized_images/Bali’s Arrival at Kurukshetra.png", "text": " Pulastya says- \"After the departure of Prahlad on his pilgrimage, Bali desirous of performing a Yagya went to Kurukshetra. Shukracharya had invited the descendants of sage Bhargava to supervise the proceedings of Ashwamedha Yagya but his decision was not approved by the descendants of some other sages like Atri, Gautam, Kaushik and Angira. As a result, all of them left Kurukshetra. After their departure, Shukracharya started making preparations for the Yagya and initiated both Bali and his wife- Vindhyavali into the rituals. After that, a horse was let loose according to the tradition. The demon Tarkaaksh followed that horse. The Ashwamedha Yagya continued for three months after which, Aditi gave birth to a child who was dwarfish in size at a time when the Sun had juts entered the zodiac of Gemini. All the deities and sages including Lord Brahma were extremely pleased by Lord Vaaman's birth. They went to Aditi's hermitage and eulogised Lord Vaaman. Lord Vaaman became pleased by their eulogy and requested Lord Brahma to help perform his consecrations. On being instructed by Lord Brahma, sage Bharadwaj performed Vaaman's Jaat karma and Yagyopavit. After that, sage Bharadwaj taught him Vedas and other scriptures which was mastered by Vaaman in less than one month. After finishing his studies, Lord Vaaman sought his Guru's permission to go to Kurukshetra. Sage Bharadwaj expressed his inability by saying- \"How can a mortal like me give permission to the supreme lord? If you want to go to Kurukshetra then how can I stop you from going there? I have some queries regarding your various abodes and would you be gracious enough to enlighten me on that?\" Lord Vaaman said- \"The whole universe including the sky, earth, ocean, mountains, clouds are pervaded by my existence. All the deities, sages, living and non-living things have manifested from me. When I took my first incarnation of Matsya I had my abode in the holy waters of Manas Sarovar. As my second incarnation of tortoise, I had my abode in the holy waters of Kaushiki River. I had my abode at Hastinapur when I took my incarnation as Govind. As Narayan, I had my abode at Badrikashrama, as Jayesh, I had my abode at Bhadrakarna.\" This way, Lord Vaaman described about his different abodes in great detail. ", "next": "6.23.2", "prev": "6.23", "title": "Bali’s Arrival at Kurukshetra"}