{"index": "6.23.3", "image": "resized_images/Lord Vaaman’s Demands.png", "text": " Bali was pleased that he would get an opportunity to see the Almighty God whom the sages contemplate upon.\n He was proud of his good fortune that the lord was paying him a visit.\n Shukracharya aware of the reason for Vaaman's arrival warned Bali against making any promise to him.\n Bali replied- \"How can I refuse if the Almighty God demands anything from me?\n I am willing to face any hardship to safeguard my benevolent image.\n I don't mind if the deities get benefited by my actions.\n Even if the lord is coming with the intention of killing me, I am not scared as that is how I would attain salvation.\n Come what may, I am not going to abandon my charitable nature.\n\" As the conversation between Shukracharya and Bali continued, suddenly, Lord Vaaman arrived at the site.\n Vaaman's radiance subdued the power of all demons present there.\n Lord Vaaman being impressed by the grandeur of Vaaman's Yagya complimented him for organising such a magnificent Yagya.\n Bali eulogised and worshipped his esteemed guest.\n He requested Vaaman to reveal the reason of his arrival and promised that his wishes would be fulfilled.\n Lord Vaaman smiled and told him that he needed a small piece of land measured by three steps for the performance of Yagya.\n Bali was surprised by this demand and requested him to ask for more land but Lord Vaaman told him that he needed only that much land.\n Bali agreed and took a vow to donate a piece of land measured by three steps.\n Hardly had Bali taken his vow, when suddenly Lord Vaaman expanded his size.\n His first step covered the whole earth.\n By his two successive steps, he covered the two worlds.\n This way, Bali was forced to donate all the three worlds according to his vow.\n Lord Vishnu then made Indra, the king of all the three worlds and sent Bali to the nether world named Sutal.\n He blessed Bali by saying- \"You would enjoy a long life till the end of this present Kalpa.\n You would hold the post of Indra till the arrival of Saavarni Manavantar.\n As long as you remain supportive of the Brahmins and the deities, you would enjoy all the pleasures of life.\n But if you go against their wishes then you would be fastened by Varun's noose.\n\" After saying this, Lord Vishnu disappeared. ", "next": "6.23.4", "prev": "6.23.2", "title": "Lord Vaaman’s Demands"}