{"index": "6.3.1", "image": "resized_images/Andhak – The Demon King.png", "text": " Sage Narad was curious to know how the demon King Andhak behaved with the deities.\n He asked Pulastya in this regard.\n Pulastya replied- \"After ascending the throne, Andhak did a severe penance to please Lord Shiva and received a boon according to which he could neither be killed by the deities nor by any mortal.\n He also received another boon according to which even fire could not burn him.\n Andhak appointed Shukracharya as his chief priest.\n He defeated the deities and had gained control over the whole earth.\n Once, Andhak had gone to see the beautiful sight of Sumeru Mountain.\n Indra after making adequate arrangements for the security of his capital Amravati came forward to fight him with a huge army.\n A fierce battle was fought between both the armies.\n The whole atmosphere was covered in darkness due to the dust.\n It became difficult for the warriors of both the sides to distinguish between friend and an enemy.\n The whole battlefield was strewn with dead bodies and blood.\n Indra unleashed a volley of arrows towards Andhak.\n In reply, Andhak too retaliated by unleashing a volley of arrows towards Indra.\n In this duel, both of them got injured.\n Infuriated, Indra attacked him with his Vajra, which destroyed all of Andhak's weapons.\n Indra's Vajra then chased Andhak who jumped down from his chariot to save his life.\n Andhak defended himself by attacking it with his fist.\n As a result, it fell on the ground.\n Indra then attacked Andhak by unleashing a volley of arrows in his direction.\n Andhak dodged the assault and ran towards him menacingly.\n He attacked Airavat- the elephant and mount of Indra with such force that it became paralysed.\n Seeing his elephant in such a pitiable condition, Indra picked up his Vajra and ran inside the fort to save himself.\n Andhak then single-handedly destroyed Indra's whole army.\n Yamaraj was fighting from the deities' side.\n He attacked Prahlad who was fighting from Andhak's side.\n It became impossible for Yamaraj to match Prahlad's valour and bravery.\n As a result, he was forced to flee from the battlefield.\n Inspite of having mighty warriors like Varun and Agni in their ranks, the deities could not match the valour of the demon's army, which comprised of valiant and brave fighters like Virochan, Maya and Shambar.\n Ultimately, the deities were defeated in this battle.\n The victorious demon King Andhak returned to Paatal loka with his army. ", "next": "6.3.2", "prev": "6.3", "title": "Andhak – The Demon King"}