{"index": "6.3.2", "image": "resized_images/Sukeshi’s Queries.png", "text": " Sukeshi was the son of demon King Vidyutkeshi. He was a great devotee of Lord Shiva. Being pleased by his devotion, Lord Shiva had blessed him with invincibility and gifted him a city, which was situated in the sky. Sukeshi was a virtuous and just king. Once, he had gone into the Magadh forest where he found numerous sages engrossed in meditation. After introducing himself to the sages, he expressed his desire to know about the path that led to benediction. He also wanted to know how a man could achieve respectability and contentment in his life. The sages told him that a man could achieve benediction only by following the path of Dharma. \"A religious man achieves both respectability and contentment\", said the sages. Sukeshi then asked them about the characteristics of Dharma. The sages revealed to him that the deities engage themselves in religious activities like Yagya, self-study, study of Vedas and worship of Lord Vishnu. So, all these activities are the Dharma of the deities. \"The Dharma of the demons consists of negative qualities like jealousy etc. But they have profound knowledge in policy matters and have great devotion towards Shiva\", said the sages. \"The Siddha's Dharma is to engage himself in activities like practice of Yoga, study of Vedas, self-realisation and devotion to both Lord Vishnu and Shiva\", said the sages. In this way, the sages enlightened Sukeshi on the Dharma of different sections of divine entities. At last, Sukeshi requested the sages to tell something about the hell (Narak). The sages replied that altogether there were 21 hells. The name of the first hell is Raurav, which covers the area of 2000 Yojans. The second hell Maharaurav is twice the area of Raurav. Similarly, the names of the remaining hells are Taamistra, Andhataamistra, Kaalchakra, Aprathisth, Ghatiyantra, Asipatravan, Taptakumbh, Kootshaalmali, Karpatra, Swabhojan, Sandansh, Lohapind, Kalmasikta, Kshaarnadi, Krimibhojan, Vaitarninadi, Shonitpayabhojan, Kshuraagradhaar, Nishitachakra and Sanshoshan. ", "next": "6.3.3", "prev": "6.3.1", "title": "Sukeshi’s Queries"}