{"index": "6.3.6", "image": "resized_images/The Rise and Fall of Sukeshi’s Kingdom.png", "text": [" Pulastya says- \"After being enlightened by the sages on various subjects, Sukeshi returned to his capital.", " He taught the demons all that he had learnt.", " As a result, all the demons became very virtuous.", " The newly attained virtuosity and religiousness made the demons invincible and powerful.", " Sukeshi's capital was situated in the sky.", " The whole city illumined brightly due to virtuosity attained by the demons.", " Its illumination even subdued the radiance of Surya (Sun).", " Now it became very difficult to determine when the Sun rose.", " The deity Surya became worried at this development.", " He started pondering on how the demons became so powerful and contemplated over the means to destroy the demons.", " While Surya was meditating, the fact regarding the demons' power dawned on him.", " Surya became furious and angrily glanced at Sukeshi.", " The city started falling towards earth.", " Sukeshi became worried and started praying to Lord Shiva.", " Seeing his devotee, Sukeshi in trouble, Lord Shiva looked angrily at Surya as a result of which, he too started falling towards the earth.", " When the sages and hermits saw Surya falling down, they advised him to take refuge in Lord Vishnu.", " Surya curiously asked as to how could he take Vishnu's refuge as he had been punished by Lord Shiva.", " The sages then advised him to direct his descent to Varanasi.", " Surya accepted their advice and landed at Varanasi between two rivers- Varuna and Asi.", " He was feeling restless because of severe heat and so he decided to take a bath in the Asi River.", " After taking his bath, he started revolving around both the rivers.", " In the meantime, all the sages, demons, Apsaras went to Brahma loka and requested Lord Brahma to re- establish Surya in his original abode.", " Lord Brahma, accompanied by all the deities went to Lord Shiva and requested him to forgive Surya.", " Shiva was pleased at their humbleness and forgave Surya and re-established him on his chariot.", " He also gave a new name to Surya- Lolaark.", " At last, Surya was re- established in the sky. "], "next": "6.4", "prev": "6.3.5", "title": "The Rise and Fall of Sukeshi’s Kingdom"}