{"index": "6.4.2", "image": "resized_images/Prahlad meets Nar-Narayana.png", "text": [" One Narayan saw all three of them coming and he treated all of them with respect.", " As he was aware of the reasons for their arrival, he decided to give them a surprise.", " He made the figure of a beautiful woman on his thigh with a flower.", " The next moment, the figure transformed into a live woman, which surprised all of them.", " For Kamadev, the beautiful woman resembled his wife Rati.", " He became so infatuated by her beauty that he forgot about the actual purpose of his visit.", " The same thing happened to Vasant and all the Apsaras.", " Everybody who had come with the desire of victory had actually become a victim.", " Seeing all of them surprised and amazed, Narayan told them that the beautiful woman was created by him from his thigh.", " He also instructed them to take away that beautiful woman to heaven.", " Kamadev and Vasant were captivated by Narayan's power.", " They also became terrified.", " They went back to heaven accompanied by Urvashi and narrated the whole story to Indra.", " Even Indra was amazed.", " In a short time, the amazing deeds of Narayan spread in all the directions and the various lokas.", " Once, Prahlad- the son of demon King Hiranyakashipu asked sage Chyavan about the most revered and sacred place of pilgrimage in the whole world.", " Sage Chyavan told him about Naimisharanya- the most sacred place of pilgrimage on the earth.", " Prahlad visited Naimisharanya accompanied by many other demons.", " After reaching there, all of them took bath in a river.", " While roaming about in the city, Prahlad saw the trunk of a tree pierced with numerous arrows.", " Not far from the tree, he saw two hermits doing penance.", " Two divine bows and a pair of quiver were lying by the side.", " Prahlad was amazed as to why the hermits would require weapons.", " He revealed his thoughts to the hermits.", " Both the hermits replied that a person who works according to his capabilities, earns respect.", " Prahlad became angry at their reply.", " He asked them as to what were their capabilities.", " Actually, the hermits were none other than Nar and Narayan.", " Both of them told Prahlad that they were invincible and nobody could defeat them in battle.", " Prahlad's anger crossed all limits.", " A tremendous battle ensued between Prahlad and Nar-Narayan. "], "next": "6.4.3", "prev": "6.4.1", "title": "Prahlad meets Nar-Narayana"}