{"index": "6.6.4", "image": "resized_images/Reincarnation of Goddess Durga.png", "text": " Revealing the reasons for Goddess Durga's re-incarnation, sage Pulastya says- \"Goddess Durga is also known as Kaushiki as she had manifested from the cell (Koshika) of Uma's (Parvati's) body. After the manifestation, she went to Vindhya Mountain with the objective of killing the demons- Shumbh and Nishumbh. She was accompanied by numerous Bhoot ganas (spirits). After Sati's death, Rudra engaged himself in penance and became a celibate. He had even relinquished his responsibility of leading the deities' army. When Mahishasura came to know that the deities were bereft of their commander, he attacked them as a result of which, the deities were defeated. The deities went to Lord Vishnu who was at that time living at Shwetdweep. When they reached there, they were surprised to find that Lord Vishnu was aware of their defeat. Lord Vishnu then advised them by saying- \"All of you must go to Mena- Maanasputri of Agnishwat and request her to give consent to marry Himalaya. The same Mena would give birth to a beautiful girl who in reality would be the re-incarnation of Sati. All of you must go to Kurukshetra and eulogise her on the night of Amavasya.\" The deities were curious to know about the origin of Kurukshetra. Lord Vishnu told them- \"During the initial phase of Satya Yuga, there was a mighty king named Riksh, who was the descendant of Soma. Samvaran was the son of Riksh. He succeeded his father at a young age. Samvaran was a great devotee of mine. Vashishth- the son of Varun was his chief priest and had taught him all the Vedas. One day, Samvaran went to the forest for hunting after entrusting his responsibilities to Vashishth. After reaching the forest, he started wandering in search of his game. He saw a beautiful lake full of numerous lotus flowers. He also saw many Apsaras and other divine beauties enjoying themselves by singing and dancing. Samvaran was infatuated by the divine beauty of one of those Apsaras- Tapti, who was the most beautiful among them. Coincidentally, Tapti too saw Samvaran staring at her. She was so infatuated by Samvaran's handsomeness that she fell unconscious. She was carried by her companions back home. After returning to his capital, Vashishth was surprised to find change in Samvaran's behaviour. It seemed as if his mind was pre-occupied by something. By his Yogic power, Vashishth came to know about the whole incident. He decided to take the help of Tapti's father- Surya. He went to Surya and requested him to marry Tapti with Samvaran. Surya did not want to annoy his esteemed guest, so he gave his consent. Vashishth then returned to his hermitage accompanied by Tapti and ultimately Tapti and Samvaran got married. ", "next": "6.7", "prev": "6.6.3", "title": "Reincarnation of Goddess Durga"}