{"index": "6.6.3", "image": "resized_images/Killing of Mahishasura.png", "text": " Narad asked sage Pulastya as to how Goddess Durga kill Mahishasura.\n Sage Pulastya replied- \"After the killing of Chikshur, Mahishasura sent Namar to fight Goddess Durga.\n Namar proceeded towards the Vindhya Mountain accompanied by a huge battalion.\n After reaching there, he shot a volley of arrows towards the Vindhya Mountain.\n As a result, the whole mountain was covered by innumerable arrows.\n This defiant act of Namar made Goddess Durga extremely furious.\n She attacked her enemies menacingly.\n She killed some of the demons by her sword, some with her mace and many more were killed by her arrows.\n Even her mount- Simha killed many demons.\n The demons were completely surprised by the ferociousness of the attack and fled from the battlefield.\n Seeing his whole army fleeing from the battlefield, Namar came forward, mounted on an elephant to fight Goddess Durga.\n He unleashed his devastating weapon- Shakti towards her.\n At the same time, he also attacked her mount- Simha (lion) by releasing many arrows towards it.\n But Goddess Durga destroyed all the weapons.\n In the meantime, the elephant held the Simha with its trunk but the Goddess's mount somehow released itself from the trap and attacked Namar.\n Namar fell from the elephant and died.\n After Namar's death, Chikshur came to fight the Goddess but both his hands and legs were severed by her.\n Ultimately, Goddess Durga severed his head as a result of which, Chikshur died.\n The news of Chikshur's death spread like a wildfire.\n Many more valiant commanders of Mahishasura's army came forward to fight her but all of them were vanquished.\n At last, Mahishasura came forward to fight Goddess Durga in the guise of a buffalo.\n Goddess Durga started playing her damru (small drum) and Veena, which resulted into the emergence of numerous ghosts.\n He attacked the ghosts with his horns, four legs and by violently lashing his tail.\n He then attacked Durga's mount- Simha and his violent movements shook even the earth and the mountain.\n Goddess Durga grabbed his neck with the help of a noose.\n The next moment, Mahishasura transformed his appearance into an elephant.\n Goddess Durga then severed his trunk.\n Mahishasura again changed his guise into a buffalo.\n Goddess Durga attacked him by unleashing various weapons but the demon escaped unhurt.\n Goddess Durga suddenly jumped down from her mount- Simha and climbed upon Mahishasura, who was in the guise of a buffalo.\n Mahishasura started jumping violently.\n Goddess Durga pressed Mahishasura's back with such force that he suffocated.\n She then severed his head.\n Suddenly, Mahishasura appeared in human form with a sword.\n Goddess Durga kicked him on his chest and again severed his head.\n The news of his death created havoc in his army and the demons fled from the battlefield and hid themselves in Paatal loka.\n The deities became pleased at Mahishasura's death and eulogised Goddess Durga.\n She became pleased and after assuring the deities of taking re- incarnation for their welfare, disappeared from the scene. ", "next": "6.6.4", "prev": "6.6.2", "title": "Killing of Mahishasura"}