{"index": "6.6.1", "image": "resized_images/Mahishasura’s Atrocities.png", "text": " During ancient times, there lived two demons- Rambh and Karambh who would torment people.\n As both were sonless, they decided to do severe penance by keeping their bodies submerged in Panchmad River with a desire of having sons.\n Indra becoming fearful, took the guise of a crocodile and killed Karambh while he was doing penance in the river.\n Rambh became so dejected by his brother's death that he decided to give up his life by severing his head and offering it in the sacrificial fire.\n As he was about to turn his thoughts into reality, Agni appeared before him and prevented him from doing so and said- \"Killing oneself is a grave sin.\n Don't give up your life.\n I am willing to fulfil any of your wish.\n\" Rambh was pleased and requested Agni to bless him with a mighty and powerful son.\n Agni blessed him by saying- \"You will beget a son from a woman of your own choice.\n But destiny had something else in store for him.\n Once, Rambh had gone to see Yaksha King- Maalvat.\n He was impressed by Maalvat's prosperity and unlimited wealth.\n King Maalvat possessed lot of animal wealth like goats, lambs, oxen, elephant, horses, cows etc.\n Rambh saw a beautiful buffalo in the cowshed.\n He started caressing her body just to appreciate her beauty.\n The buffalo got aroused and forced Rambh to copulate with her and this resulted in the buffalo's pregnancy.\n Rambh returned to Paatal loka accompanied by the buffalo.\n But the other demons came to know about this unusual incident and as a result, Rambh was excommunicated from the demons' tribe.\n Both of them decided to return to Yaksha King Maalvat's palace.\n In due course of time, the buffalo gave birth to a beautiful calf, which could change its appearance according to its wishes.\n Once, seeing the buffalo alone, a bull tried to breach her modesty.\n The buffalo ran towards Rambh for her safety.\n Rambh attacked the bull with a sword and injured it.\n In retaliation, the bull also dashed its horns against Rambh's chest, which proved to be fatal.\n Seeing the dead Rambh, the buffalo became engulfed in sorrow.\n She had no other option but to take refuge of the Yakshas who protected her life.\n In the meantime, the seriously injured bull fell into a divine lake and died.\n Amazingly, its body transformed into a demon.\n The Yakshas decided to cremate Rambh's body.\n The buffalo too decided to embrace death by jumping into the burning pyre.\n But as soon as the pyre was lit, a ferocious demon emerged from it with a sword.\n He drove away all the Yakshas and killed the buffalo but spared her calf.\n This ferocious demon later on became famous as Raktabeej.\n He had defeated all the deities including Indra, Rudra, Surya and Marut.\n But the calf, which became famous as Mahishasura was even mightier than Raktabeej.\n All the defeated demons had accepted him as their leader and he was crowned as their king.\n Mahishasura defeated all the deities and drove them out from heaven.\n The defeated deities accompanied by Brahma went to Lord Vishnu and narrated their woes to him.\n Lord Shiva too was present there.\n Both of them became furious after hearing the atrocities committed by Mahishasura.\n Divine effulgence appeared from the mouth of all the angry deities.\n These effulgence got collected at a place resulting in the manifestation of Goddess Katyayani.\n All the deities presented their weapons to her- Lord Shiva gave his trident, Lord Vishnu gave his chakra, Agni gave his Shakti etc.\n After acquiring all the weapons, Goddess Durga thundered loudly.\n The deities eulogised her after which she proceeded towards Vindhya Mountain mounted on her lion.\n Vindhya Mountain had been cursed by sage Agastya as a result of which, its enormous size turned into a hill.\n The tale behind this curse is as follows- In the ancient times, Vindhya Mountain was so high that it became very difficult for the Sun to make its movement.\n The Sun went to sage Agastya and requested him to minimise the size of Vindhya Mountain.\n Sage Agastya went near the Vindhya Mountain and said- \"I am going on a pilgrimage but you are coming in my way.\n Since I am an old man, it is impossible for me to climb your steep slopes.\n I request you to reduce your size and remain in the same position till I return from my pilgrimage otherwise you will have to face my wrath.\n\" Vindhya Mountain accepted his request and turned into a hill.\n Sage Agastya then proceeded on his pilgrimage towards south but did not return according to his promise.\n He constructed a magnificent hermitage and asked Lopamudra- the daughter of Vidarbha King to stay there and himself returned to his hermitage.\n Vindhya Mountain remained in that position waiting for sage Agastya's arrival.\n This way, sage Agastya solved the problem of the Sun.\n Goddess Durga chose this very mountain to launch her assault.\n All the deities, Siddhas, Nagas, Apsaras etc. were present with her. ", "next": "6.6.2", "prev": "6.6", "title": "Mahishasura’s Atrocities"}