{"index": "6.6.2", "image": "resized_images/The Demons – Chand and Mund.png", "text": " Once, the demon brothers, Chand and Mund were passing near the Vindhya Mountain when they saw Goddess Chandika there. Both these demons were stunned by her divine beauty. They had never seen such a beautiful woman in their life. They went to Mahishasura and told him about her beauty. Mahishasura proceeded with a huge army, which comprised of valiant commanders like Vidaalnetra, Vishang, Vaayakal, Agraayudh, Chikshur, Raktabeej etc. The army assembled at the foothills of Vindhya Mountain. There, Mahishasura instructed Dundubhi to go and bring Goddess Durga by any means. Dundubhi went to Goddess Durga and boasted about Mahishasura's might and power by saying- \"The mighty Mahishasura has defeated all the deities who ran out from heaven to save their lives. He is lord of all the three worlds and is invincible but this victorious and mighty king has been enslaved by your beauty. You must not miss this chance of marrying him.\" Goddess Durga replied- \"I am aware of Mahishasura's feats. I am most willing to marry him. But there is one problem. There is a tradition in our clan according to which an aspiring husband is required to give a Shulk (tax) in lieu of getting married.\" Dundubhi was happy thinking that it would not be difficult for Mahishasura to fulfil her demand. He said- \"Mahishasura can even give up his life for your sake.\" Hearing this, Goddess Durga laughed loudly and said- \"O demon! According to the tradition of our clan, only such a person can marry a woman who defeats her in the battle.\" Dundubhi went back to Mahishasura and narrated the whole story. Mahishasura instructed Chikshur to go and bring Goddess Durga after enslaving her. Chikshur proceeded with a huge army. Seeing him coming in the direction of Goddess Durga, Lord Brahma instructed her to use an armour to protect herself. The Goddess refused by saying- \"No demon can stand before me in a battle.\" All the deities then chanted Vishnupanjar Stotra for her safety. Protected by the Stotra, she was successful in killing many demons. Seeing his devastated army, Mahishasura himself came to fight her. ", "next": "6.6.3", "prev": "6.6.1", "title": "The Demons – Chand and Mund"}