{"index": "6.7", "image": "resized_images/TALES OF KING KURU AND KURUKSHETRA.png", "text": " In course of time, Tapti gave birth to a son, who possessed all the signs of royalty.\n After growing up, he mastered all the four Vedas and other scriptures within a very short period.\n At the raw age of 24, he became a scholar.\n When he attained marriageable age, he was married to Saudamini- the daughter of Sudama.\n Later on, he was appointed as the successor by his father, Samvaran.\n After becoming the king, Kuru ruled his subjects in a just manner but very soon he got bored of his monotonous life.\n He knew that only those kings became immortal who accomplished amazing feats.\n He decided to do something for which people would remember him.\n With the objective of making his name immortal, he went to the most sacred place called Samantpanchak and decided to cultivate the eight virtues - Tapa, Satya, Kshama, Daya, Shauch, Daan, Yuga and Brahmacharya on its barren land.\n He started ploughing a piece of land with a golden plough, which was pulled by Lord Shankar's bull and Yamaraj's buffalo named Paundrak.\n While he was busy ploughing the field, Indra approached him and asked suspiciously as to what he was trying to cultivate.\n When Kuru revealed his intentions, Indra made fun of him and went back.\n But Kuru was not worried and continued to cultivate the land.\n In a very short time, he had already cultivated the land measuring 7 kosas.\n One day, Lord Vishnu arrived and asked the same question, which Indra had asked.\n When Kuru revealed his intentions, Lord Vishnu was surprised and wondered as to from where he would get the seeds to grow these things.\n Kuru told him that all these eight virtues were present in his own body and it would not be a difficult task to cultivate these things.\n Lord Vishnu wanted to test his commitment and sincerity and said- \"Give the seeds to me.\n I would sow the seeds while you should plough the field.\n\" Kuru outstretched his right hand but Lord Vishnu cut it into thousands of pieces with his chakra.\n All the pieces were distributed among the deities but Kuru was unfazed and again stretched his left hand towards Lord Vishnu.\n But his left hand too met the same fate.\n In this way, the most generous and benevolent King Kuru offered all his organs to Lord Vishnu.\n But all the organs were severed by Lord Vishnu.\n At last, Kuru offered his head as he had nothing else to offer.\n Lord Vishnu was pleased by his generosity and asked him to demand anything.\n Kuru replied- \"All the area cultivated by me should become famous as a sacred pilgrimage.\n All the devotees who visit or die at this sacred pilgrimage must attain salvation.\n This place should be known by my name.\n\" This is how the most sacred place of pilgrimage- Kurukshetra came into existence. ", "next": "6.8", "prev": "6.6.4", "title": "TALES OF KING KURU AND KURUKSHETRA"}