{"index": "7.1", "image": "resized_images/INTRODUCTION.png", "text": [" Once Jaimini, a disciple of sage Vedavyasa expressed his curiosity before Markandeya- 'O Lord! In the great epic Mahabharat, which was created by Vedavyasa, description of Dharma, Arth, Kama and Moksha appears to be intertwined at times and at other times, it appears to be separate from one another.", " Vedavyasa had described the norms, the stages and the means to perform the duties in all the four stages.", " This epic contains cryptic knowledge of Vedas.", " Hence O great sage! I have approached you in order to grasp the full knowledge contained in Mahabharat with your help.", " Why did Lord take human incarnation even though He is the cause of the origin, perpetuation and destruction of the universe?", " How did Draupadi become the wife of five Pandavas?", " How did Balaram expiate for the sin of killing a Brahmin?", " How did Draupadi's sons give up their lives?", " Kindly narrate all these things in detail.", " ' Markandeya says- 'O Muni ! Presently I am engaged in evening worship.", " Hence I do not have time to narrate these things in detail.", " But I am telling you about the birds which will narrate you the entire content of Mahabharat.", " Those birds will also remove all your doubts.", " Sons of the great bird Drona- Pingaksha, Vibodha, Suputra, Sumuk etc.", " stay in the caves among the hills of Vindhyachal.", " They are proficient in Vedas.", " Go and ask them, they will remove all your doubts.", "' Markandeya's words surprised Jaimini.", " To confirm, he asked again- 'It is surprising that the birds could narrate the content of Mahabharat just like human beings.", " It is even more surprising that they are proficient in Vedas knowledge, which is even rare to find among humans.", " Kindly tell me how did they come to acquire such profound knowledge despite having being born in the form of birds.", " Why do you call them as the sons of Drona?", "' Markandeya says- 'Long ago, a strange event took place in Nandanvan involving Indra, Devrishi Narad and some of the elves.", " One day, Indra was enjoying his time in the Nandanvan forest along with his elves.", " At the same time Narad also arrived there.", " Indra welcomed and offered him a seat.", " The elves also greeted Narad.", " Indra then said- 'Munivar! Tell me what you desire now?", " If you desire to listen to a song, should I order the Gandharvas or if you wish to watch the dance, should I order one of my elves, Menka, Rambha, Mishrakeshi or Urvashi?", " Any of these four can perform a seducing dance before you.", "' Narad expressed his desire to watch the dance of an elf, who was superior in beauty to the other elves.", " This led to a row among the elves.", " Each one of them was proud of her beauty and talent.", " Narad then advised them to test their beauty by breaking sage Durvaasa's penance who was at that time staying on a hilltop.", " All the elves expressed their inability to perform this task successfully.", " Only an elf named Vapu, driven by her haughtiness accepted to break the penance of sage Durvaasa.", " Accordingly she reached the hill where Durvaasa was staying and began to sing an infatuating song in her sweet voice.", " Very soon, the song began to show its effect on Durvaasa.", " Attracted by the sweet voice, Durvaasa went in search of the origin of the voice and found Vapu singing at a distance.", " Durvaasa understood that the elf had come to break his penance.", " Angrily, he cursed the elf that she would take birth in the lineage of the birds for sixteen years, she would not bear a child and ultimately would be killed by a weapon to regain her heavenly abode.", " After saying this, sage Durvaasa migrated to Akashganga. "], "next": "7.2", "prev": "7", "title": "INTRODUCTION"}