{"index": "7.10.5", "image": "resized_images/Rajyavardan’s Subjects Eulogize Aditya for their King’s Long Life.png", "text": " Kraustuki says- 'O lord! Enlighten us on the greatness of Bhaskar.' Markandeya replied- 'There was a king named Rajyavardhan. His subjects were very happy and satisfied under his rule. They were free from all the diseases. Rajyavardhan ruled for 7,000 long years. His wife was Maanini. One day, while Maanini was applying oil on his head, she saw a grey hair. She became very sad and started crying. A drop of tear fell on the king. He asked the queen as to why she was crying. The queen told him about the reason. The king laughingly said- 'I am fully satisfied by my rule of 7,000 years. The grey hair on my head is an indication that I must now abandon my worldly life and become a recluse. This would be more appropriate for me.' When his subjects came to know about his decision, they became sad. But nothing could make the king change his mind. He decided to become a recluse after appointing his son as his successor. The king called the astrologers for consultation. The astrologers advised the king to change his mind. But Rajyavardhan did not listen to them. At last, his subjects decided to eulogise the Sun god and demand a long life for their king. All of them started worshipping the Sun god. A Gandharva whose name was Sudama appeared before them and instructed them to go to a forest named GuhaVishaal and continue their penance. All of them went to the forest as per the instruction of the Gandharva. There was a beautiful temple of Lord Bhaskar in the forest. They worshipped Surya and eulogised him. Their worship continued for three months after which the Sun god became pleased and appeared before them. Lord Bhaskar asked them to demand any boon. He said- 'O Brahmin! Demand anything you wish.' All of them said- 'O lord! If you are really pleased with us, then bless our King Rajyavardhan with a long life. Please bless him with an eternal youth and a life free from all the deities. We want our king to live for 10,000 years. The Sun god blessed them by saying- 'So be it'. After receiving the boons, all of them came to the king's palace and narrated the whole story. The queen was very pleased but the king was worried. The queen was surprised at the king's sadness even after getting such good news. The king replied- 'What is the use of remaining alive for 10,000 years? You won't be alive then. Will I be able to enjoy my life in your absence? Will not the deaths of my sons, my grandsons and my near and dear ones make me sad? The boon of myself enjoying life for 10,000 years will actually prove to be a curse.' The queen sadly said- 'Whatever you have said is true. I could not understand this fact because of my ignorance. Now, you must do your duty, as the boon of the Sun god is not going to go in vain. The king decided to go to the Mountain- Prabhriti and do penance. He wanted to receive a boon from Sun god, which enabled all his subjects and his relatives to remain alive as long as he lived. The queen also decided to move along with the king. Both of them did an austere penance. The Sun god appeared before them and blessed them. Thus, Rajyavardhan lived for 10,000 years along with his subjects. ", "next": "7.10.6", "prev": "7.10.4", "title": "Rajyavardan’s Subjects Eulogize Aditya for their King’s Long Life"}