{"index": "7.11.5", "image": "resized_images/Bhalandan and Vatsapri.png", "text": [" Naabhaag told his wife- 'I would never accept the kingdom for the second time, which I had relinquished at the instruction of my father.", " He then instructed his son to rule over the kingdom he had won.", " Following his father's instructions, Bhalandan started ruling over his kingdom.", " Later on, he got married and begot a son named Vatsapri.", " Vatsapri was married to Saunanda when he attained youth-hood.", " Vatsapri married her after killing the demon Kujrimbha.", " There was a king named Vidurath.", " He had two sons whose names were Suniti and Sumati.", " One day, while Vidurath was having his usual walk, he saw a large pit.", " He became very curious.", " Just then, a sage arrived at the scene whose name was Suvrat.", " Pointing his finger towards the pit, the king asked Suvrat as to what it was.", " The sage said- 'A demon by the name of Kujrimbha lives inside this pit.", " He controls all the events, which occur on this earth and in heaven.", " He possesses a mace called Sunand and which was made by Vishwakarma.", " This large pit which you see is the result of the assault, he made with his mace.", " This demon is very cruel and wicked.", " He torments the deities and destroys the oblation sites of the sages.", " There is one very peculiar characteristic related with his mace.", " The mace would become powerless if touched by a woman.", " But this is only a temporary change because it regains its power the next day.", " But this fact is unknown to the demon.", " After saying this, sage Suvrat went on his way.", " King Vidurath returned to his palace and consulted his ministers.", " His daughter, Mudaavati was listening to their conversation.", " One day, the demon abducted Mudaavati.", " The king sent both his sons accompanied by a huge army to bring her back but the demon defeated them.", " The king made a declaration that he will marry his daughter to anybody who brings back his daughter and sons from the clutches of the demon.", " Hearing his declaration, Vatsapri came to Vidurath and said- 'Give me your permission.", " I will bring back your daughter and your sons after releasing them from the clutches of the demon.", "' Vidurath gave the permission.", " Vatsapri entered into the nether land through that large pit.", " A tremendous battle ensued between him and the demon.", " This battle continued for three days.", " On the final day of the battle, the demon tried to take the help of his mace and went to grab hold of it.", " But sensing that the demon was going to pick up the mace, she immediately touched the mace as a result of which it became powerless.", " Being unaware of this happening, the demon attacked Vatsapri with that powerless mace.", " But he could not harm Vatsapri.", " Ultimately, Vatsapri was successful in killing the demon.", " Vatsapri released all three of them- Suniti, Sumati and Mudaavati from the demon's captivity and brought them back to the king's palace.", " After the death of the demon, Sheshnaag acquired the mace.", " Mudaavati's name was later changed to Sunanda, after that mace.", " King Vidurath became very pleased and married Mudaavati to Vatsapri. "], "next": "7.11.6", "prev": "7.11.4", "title": "Bhalandan and Vatsapri"}