{"index": "7.11.3", "image": "resized_images/Curse of Sage Pramati.png", "text": " Markandeya says- 'The king stopped fighting at the request of Naarad. Naabhaag married the Vaishya girl. After the marriage, the king ordered Naabhaag to follow a Vaishya's occupation. Naabhaag got engaged in activities like animal husbandry and agriculture. With the passage of time, a son was born and who was named Bhalandan. When he grew up, his mother entrusted him the job of looking after the cows. Bhalandan knew nothing about the job he was entrusted with. He went to sage Neep and told his problem. Sage Neep understood everything and taught him the nuances of handling various weapons as a result of which, he became a master in this art. After this, Bhalandan went to Vasuraat, the son of Pitravya and demanded his share in the kingdom of his great-grandfather. Vasuraat refused to give anything by saying- 'Being the son of a Vaishya, you are not entitled to become a king.' Bhalandan became very angry and attacked Vasuraat with a huge army. In this battle, Vasuraat was defeated. Now, Bhalandan had control over the entire earth. He returned to his father, Naabhaag in order to hand over the reign of the kingdom, he had won in the battle. But Naabhaag refused to take anything by saying - 'I have been cursed by my father to become a Vaishya. I cannot go against his wishes by taking over the responsibility of a king as this would disturb the peace of my ancestors who are in heaven and even I would not attain liberation. The second thing is that you have won this kingdom by your power and strength. It will not be proper for me to rule over this kingdom.' Suprabha, the wife of Naabhaag was listening to their conversation. She could not stop laughing. She said- 'You are not a Vaishya, because I too belong to a Kshatriya family. During ancient times, a king named Sudev had a friend- Nala. One day both of them went to the forest to hunt. In the forest, Nala saw sage Pramati's wife and became enchanted by her immense beauty. He wanted to marry he and tried to forcibly abduct her. Being a chaste woman, Pramati's wife started shouting for help. Sage Pramati heard her screams and arrived at the site. He became enraged when he saw Nala trying to abduct his wife and King Sudev doing nothing to protect her. Pramati requested King Sudev to protect his wife from Nala. King Sudev lied to sage Pramati about his caste, to help his friend- Nala. He said- 'I cannot help you because I am a Vaishya. You must go to any Kshatriya to take help. Sage Pramati was exasperated. He fumed- 'You will certainly become a Vaishya as you have lied to me about your caste.' ", "next": "7.11.4", "prev": "7.11.2", "title": "Curse of Sage Pramati"}