{"index": "7.11.9", "image": "resized_images/King Khaninetra.png", "text": " Markandeya says- 'Khaninetra was the son of King Vivinsha.\n He was very brave and valiant.\n The Gandharvas had proclaimed that no one could match Khaninetra's benevolence, who had donated the whole earth after accomplishing 10,000 Yagyas.\n Khaninetra had given so much wealth as donations to the Brahmins that there was no need for them to take donations for the rest of their lives.\n Khaninetra was sonless.\n One day, he went to the forest to hunt an animal for sacrificial purpose needed during Pitra Yagya.\n The performance of this Yagya was supposed to bless him with a son.\n In the forest, he saw a deer that was cognisant of his desire.\n The deer requested him by saying- 'O king! You can get my flesh by killing me.\n' The king was very amazed.\n He asked the deer as to why it was willing to get sacrificed.\n The deer replied- 'O king! I don't have any offspring.\n For this reason, I consider my life as useless.\n' While the conversation was going on between the king and the deer, another deer came near them and expressed his desire to get sacrificed by saying- 'O king! Please kill me and get the flesh because the flesh of this sonless deer would be of no help to you.\n' The king was astonished.\n He asked the second deer as to why he was willing to die.\n The second deer replied- 'O king! I have numerous sons and daughters and this worries me a lot.\n Whenever my children go out in search of food, I become very anxious till they have returned to me safely.\n This way, I pass the whole day and night in anxiety.\n The king was very confused.\n He said- 'I don't know who is superior between a sonless person and a person who doesn't have any son.\n Although I needed the flesh for the accomplishment of Pitra Yagya but now after meeting both of you, I have become confused.\n It is true that a man has to face all kinds of sorrows because of their children but yet, a sonless man is not complete and remains indebted.\n So, I have decided to get a son by doing a penance just like my predecessors did in the past.' ", "next": "7.11.10", "prev": "7.11.8", "title": "King Khaninetra"}