{"index": "7.11.6", "image": "resized_images/The Kingdoms of Pranshu, Prajaati and Khanitra.png", "text": " Markandeya says- 'Sunanda gave birth to 12 sons.\n Their names were Pranshu, Praveer, Shoor, Suchakra, Vikram, Krama, Bala, Balaak, Chand, Prachand, Suvikram and Swarup.\n After growing up, Pranshu became the king.\n Pranshu had a son named Prajaati.\n Prajaati had five sons among whom Khanitra was one of them.\n Khanitra became a mighty king and was very famous for his religiousness and virtuosity.\n He distributed the kingdoms among his brothers.\n Shauri was made the king of the eastern region, Udavasu of the southern region, Muni of the western region while Mahaarathi was made the king of northern region.\n One day, a minister of Shauri, Vishwavedi instigated him against his brother Khanitra by saying- 'O king! You must try to capture your brother's kingdom as your kingdom is too small for your descendants to rule over.\n A time may come when your descendants would be forced to choose agriculture as their occupation because the continuous distribution of your kingdom among your progenies would leave almost nothing for them.\n' Shauri said- 'My brother is so kind to me.\n Why should I cheat him like that?\n' The minister said- 'The duty of the king is only to look after the kingdom's interest.\n The relation should not come in the way.\n' At last, the minister was successful in convincing him.\n After sometime, the wicked minister also influenced the rest of his brothers.\n Ultimately, King Khanitra was left all alone as all of his ministers and even his sons were misguided by Vishwavedi.\n Vishwavedi appointed four priests of Khanitra as the supervisor of Yagyas.\n One day, while the priests were performing Yagya, four ogresses appeared from the sacrificial fire and tried to attack King Khanitra.\n But they could not harm him because of his virtuous character.\n They then turned towards Vishwavedi and the priests and killed all of them.\n Thus, Vishwavedi bore the fruits of evil deeds. ", "next": "7.11.7", "prev": "7.11.5", "title": "The Kingdoms of Pranshu, Prajaati and Khanitra"}