{"index": "7.12.3", "image": "resized_images/Liberation of Aveekshit and his Disenchantment.png", "text": " When king Karandham came to know about his son's defeat and captivity, he consulted his friends.\n All of them decided to attack the kingdom of Vishaal and release Aveekshit from captivity.\n Karandham marched towards the kingdom of Vishaal followed by a huge army.\n A tremendous battle was fought which continued for three days.\n Karandham became victorious in this battle.\n At last, Aveekshit was rescued from his captivity.\n King Vishaal decided to marry his daughter with Aveekshit but Aveekshit was disillusioned with life.\n He said to Vishaal- 'I can never accept such a woman as my wife who has witnessed my defeat.\n I have decided to renounce life.\n So, it would be better if you marry your daughter with somebody else.\n' King Vishaal asked his daughter to choose any other king as her husband as Aveekshit was not willing to marry her.\n But the princess wanted to marry Aveekshit and believed that he still remained an undefeated king because he had fought single-handedly with all the kings.\n He was defeated only because of unfair means adopted by his jealous rivals in the battle.\n 'I shall accept only Aveekshit as my husband otherwise I shall remain unmarried', said the princess.\n King Karandham requested his son to marry the princess but Aveekshit turned down even his father's request.\n Seeing the futility of his advice, Karandham returned to his kingdom.\n Aveekshit too went along with him.\n Sudati Vaishaalini went in the forest to do penance.\n She observed a fast for three months.\n She became very weak but still continued with her penance.\n The deities felt sorry at her condition.\n They sent an envoy to persuade her to discontinue with her penance.\n The envoy requested her to stop torturing herself.\n 'You would be a mother of a Chakravarti king who would be mighty and powerful', said the envoy.\n Sudati Vaishaalini said- 'How can I become a mother without a husband?\n I have decided that nobody except Aveekshit will be my husband.\n But he has turned down my proposal.\n So, I have vowed to remain unmarried in this life.\n' The envoy said- 'O great soul! I have been asked not to reveal much.\n You must take care of your health.\n Due to the virtues of your penance, you will certainly become a mother.\n' Sudati following her instructions and broke her fast. ", "next": "7.12.4", "prev": "7.12.2", "title": "Liberation of Aveekshit and his Disenchantment"}