{"index": "7.12.5", "image": "resized_images/Aveekshit Rescues Vaishalini.png", "text": " Markandeya says- 'Once, Aveekshit had gone for a hunt in the forest when suddenly, he heard a female voice shouting for help. He proceeded in the direction of the voice. After reaching there, he saw Danu's (a demon) son Dhridhakesha, holding a lady by her hair. The woman was crying- 'I am the wife of Aveekshit. This wicked demon is trying to abduct me.' Aveekshit was surprised as to how could the lady claim that she was his wife. He apprehended that it must be the illusionary tactics of the demon to trap him. But despite his apprehensions, he went near the wailing woman to release her from the clutches of that demon. He warned the demon of dire consequences if he did not release her. The demon left the woman and attacked Aveekshit. A tremendous duel was fought. In the end, Aveekshit severed the head of that demon. The deities were very pleased at Dhridhakesha's death. They praised Aveekshit for his bravery. They asked him to demand any boon. Aveekshit demanded a valiant son for himself as per the aspirations of his father- Karandham. The deities said- 'You would get your son from this very woman, you have rescued. The child would become a very mighty king after growing up.' Being unaware of the real identity of Vaishaalini, he told the deities- 'I had vowed to remain a bachelor but changed my decision only due to the word I had given to my father. But I cannot marry this woman because by doing so, I would be breaching the trust of that woman who wanted to marry me and who had rejected everybody for my sake.' The deities then revealed to him that this lady was none other than Vaishaalini whom he was talking about. 'She had done a severe penance to be your wife.' After saying this, the deities disappeared. Vaishaalini requested him to accept her as his wife. 'You have rescued me from this demon. I offer myself to you', said Vaishaalini. ", "next": "7.12.6", "prev": "7.12.4", "title": "Aveekshit Rescues Vaishalini"}