{"index": "7.12.4", "image": "resized_images/Aveekshit Promises his Father to get Married.png", "text": [" Markandeya says- 'Once, Veera- the wife of King Karandham and mother of Aveekshit had taken a vow to accomplish a very arduous penance.", " But this could only be accomplished with Karandham's and Aveekshit's assistance.", " Karandham had assured her that he would provide all the wealth required for the accomplishment of that austerity while Aveekshit had assured her of physical help.", " Veera commenced her arduous austerity named 'Kimichhak Vrata'.", " This particular Vrata had a peculiar characteristic and that was- any demand made during the course of the Vrata, ought to be fulfilled at any cost failing which meant forfeiting all the virtues of this arduous austerity.", " King Karandham was consulting his minister about the means that would change Aveekshit's decision regarding his marriage.", " The ministers said that as Karandham had become old, there was an urgent need for his successor.", " The question was that who would become king after Aveekshit as he had decided to remain unmarried.", " This thought was tormenting all of them.", " Suddenly, King Karandham heard the priest who was assisting queen Veera in the accomplishment of the Kimichhak Vrata, telling somebody- 'The queen is busy performing the Kimichhak Vrata.", " What is your demand?", " I promise, it will be fulfilled by the queen no matter how extraordinary it may be.", "' Aveekshit too arrived at the scene.", " He promised that their demands would be met without delay as it was obligatory for the success of Kimichhak Vrata, which his mother was performing.", " Seeing the time as opportune, King Karandham said before the people could say anything- 'O son! I have a demand.", " Promise me that you will fulfil it.", "' Aveekshit gave his word.", " The king said that he aspired for a grandson but this was impossible unless he (Aveekshit) got married.", " Initially, Aveekshit tried to convince Karandham that it was an impossible task as he had vowed to remain a celibate but ultimately he had to change his mind to honour his words. "], "next": "7.12.5", "prev": "7.12.3", "title": "Aveekshit Promises his Father to get Married"}