{"index": "7.14.1", "image": "resized_images/Sumana Chooses Dama as her Husband.png", "text": " Markandeya says- Dama was the son of Narishyant.\n His mother was Indrasena- the daughter of Babhru.\n He became the master in archery under the tutelage of Vrishparva.\n He also learnt the nuances of handling other kinds of weapons under the guidance of Dundubhi.\n He learnt the scriptures from sage Shakti and the art of yoga from Aashartishen.\n Sumana, the daughter of King Charusharma had chosen Dama as her husband in a Swayamvara.\n But Mahanand, Vayushmaan and Mahadhanu did not like her decision, as they too wanted to marry her.\n All three of them decided to abduct her by force and marry who ever among them she decided to marry with.\n Their evil intentions were corroborated by the friends of Dama.\n Thus, all three of them abducted Sumana.\n Dama became angry.\n He asked all the kings who were present in the Swayamvara- 'Tell me whether Swayamvara is religious or irreligious?\n' One of the kings said that certainly a Swayamvara is religious and only Dama has the right to marry Sumana as she had herself chosen him.\n But some other kings supported Dama's opponents.\n They said- 'Raakshas Vivaaha is the norm prevalent among people possessing arms.\n Only such a person has a right to marry Sumana who has defeated his rivals.\n' Dama became furious with them.\n He knew that they were saying such things out of jealousy.\n But still he decided to accept their proposal.\n He threw an open challenge by saying- 'Anybody who wants to die may abduct my wife in front of my eyes.\n' A tremendous battle was fought between Dama and his opponents.\n At first, Mahanand came forward to fight him with a sword in his hand.\n Dama showered a volley of arrows at him.\n All the arrows were neutralised by Mahanand.\n After that, Mahanand jumped and climbed on the chariot of Dama.\n Dama severed his head.\n After the killing of Mahanand, Vayushmaan came forward to fight Dama but his sword was broken into two pieces by the assault of Dama.\n Dama then killed his charioteer.\n After that, Vayushmaan picked up his spiked mace but Dama destroyed even this mace.\n In the battle, Vayushmaan got injured and fell on the ground.\n Vayushmaan quit the idea of fighting.\n Seeing him reluctant to fight, Dama spared his life.\n At last, Charusharma married his daughter Sumana with Dama.\n After staying for some days at his father-in-law's place, Dama returned home accompanied by his wife- Sumana. ", "next": "7.14.2", "prev": "7.14", "title": "Sumana Chooses Dama as her Husband"}