{"index": "7.2.1", "image": "resized_images/Birth of Four Birds.png", "text": [" Markandeya says - 'In the lineage of the avian King Garud, there were two brothers- Kank and Kandhar.", " One day, Kank visited Kailash Parbat where a demon Vidrayudrup, who was a slave of Kuber, was enjoying privacy with his wife and drinking wine.", " Seeing Kank, the demon showed his displeasure at his arrival at an improper time.", " But Kank boldly asserted his right on the mountain as according to him, it belonged to all.", " The infuriated demon decapitated Kank with his sword.", " Hearing the news of his brother's killing, Kandhar resolved to kill the demon.", " After performing the last rites of his brother, he also arrived on the mountain where the demon Vidrayudrup was still drinking wine with his wife.", " The demon lost his temper again.", " Kandhar then challenged the demon to have a fight with him.", " A fierce battle ensued between them.", " Ultimately, Kandhar killed the demon.", " The demon's wife- Madanika finding herself in a helpless situation accepted Kandhar as her husband.", " Thus, Kandhar returned to his palace with a newly found wife.", " Madanika was in fact the daughter of Menka, the elf and could change her guise at will.", " After marrying Kandhar, she took the guise of the bird.", " The bird Madanika was born as elf - Vapu in her next birth due to the curse of sage Durvaasa.", " Kandhar named her Taarkshi.", " A Brahmin named Mandapal had four sons.", " Drona was the youngest among them and proficient in scriptures, Vedas etc.", " Kandhar married his daughter, Taarkshi to Drona.", " After their marriage, Drona and Taarkshi were spending their time happily.", " Taarkshi conceived during the same time when the battle of Mahabharat was going on.", " As destiny would have it, Taarkshi flew over the battlefield where she saw Arjuna and Bhagdatt, the king of Pragjyotishpur, fighting valiantly against each other.", " Accidentally an arrow aimed at Bhagdatt went in the direction of Taarkshi and struck her in the abdomen and tore it apart.", " As a result of this, four eggs fell on the ground.", " At the same time, a huge bell fell from Supratik's neck, the elephant of Bhagdatt, and covered the eggs safely.", " After the battle of Mahabharat was over, a sage Shami visited the battlefield.", " There he happened to spot the bell and heard faint chirping coming from underneath the bell.", " The sage removed the bell and discovered four wingless chicks beneath it.", " Surprisingly he said to his disciples- 'Look! Falling of these eggs and getting safely covered by the bell simultaneously shows that these chicks are no ordinary birds.", "' Then he instructed his disciples to carry the eggs to the hermitage and keep it securely at a place safe from predators. The disciples did as told. "], "next": "7.2.2", "prev": "7.2", "title": "Birth of Four Birds"}