{"index": "7.2.9", "image": "resized_images/Birth of Living Creatures.png", "text": " Jaimini says- O great birds, how does a living being take birth?\n How does it grow in the womb bearing all the pain?\n How does it grow after taking birth?\n What happens to the soul after death?\n How does it experience the fruits of his Karmas?\n The greatest surprise is how does a little foetus survive in the womb.\n Kindly clear all these doubts.\n Birds say- Once upon a time, a Brahmin lived along with his son- Sumati.\n One day, the Brahmin instructed Sumati to study Vedas under the tutelage of a teacher and himself went to the forest to attain Brahmagyan- the knowledge which frees the soul from transmigration.\n But due to his laziness, Sumati did not pay heed to his father.\n When his father repeated his instruction, he simply laughed and said- 'O father! I know everything.\n I have studied all the Vedas in my various births.\n I have experienced the darkness of mother's belly for many times.\n I have suffered thousand kinds of diseases in my previous lives.\n I have experienced the authority as well as slavery in my previous births.\n I had killed as well as got killed by others.\n Hence, I feel, I have all the knowledge and I am sure that I will definitely attain Brahmapad.\n' Sumati's father was pleased at his son's claims and asked him how he attained such virtuosity.\n Sumati said- 'O father! I was a Brahmin in my previous birth.\n I had attained the designation of Acharya.\n After sometime, I became a recluse.\n I was blessed with an extraordinary memory, which I retained even after my death.\n This is the reason why I remember the self knowledge attained in my previous birth.\n With the support of this knowledge and religious virtues, I will attempt to attain salvation.\n Tell me what you expect from me.\n I will try to fulfil your expectations.\n' The Brahmin then asked many questions related to life and death.\n Sumati explained those queries thus:\n Those who never tell a lie, who have faith and devotion, only such people die peacefully.\n Whoever's mind is free from the evils like Kama, Krodh, Moha, Dwesh etc.\n (lust, anger, affection, jealousy etc.\n) and who are altruistic in nature and make donations liberally die in peace.\n Those who lack these virtues suffer great pain at the time of death.\n As soon as such people sight Yamadoot they begin to cry and call their relatives.\n But their relatives do not understand their calls.\n Then the dying person turns away his eyes and grasps for breath.\n He feels great pain when his soul leaves his body.\n Even after death, sufferings of such people do not end.\n They have to undergo scores of tortures in hell.\n Those who donate umbrella, shoes, clothes and cereals attain heaven.\n The sinners on the other hand pass through different hells and take birth as inferior creature in their next lives.\n After continuous transmigration through lower life forms, these sinners once again take birth as human beings but are imperfect.\n They remain dwarf, hunched or have any other deformity.\n Then they pass through all the four castes- Shudra, Vaishya, Kshatriya and Brahmin classes.\n As their action improves, they might even attain the position of Indra.' ", "next": "7.3", "prev": "7.2.8", "title": "Birth of Living Creatures"}