{"index": "7.2.7", "image": "resized_images/King Harishchandra.png", "text": " After being thrown out from his kingdom by Vishwamitra, Harishchandra reached the holy town of Varanasi, which was an abode of Lord Mahadev. There Harishchandra saw Vishwamitra standing before him. Vishwamitra said- 'A month has been completed now. Now, give me my Dakshina.' Harishchandra said- 'There is still half an hour in the completion of this month. Please wait. I will give your Dakshina.' Vishwamitra said- 'I will come after half an hour.' Saying this, Vishwamitra departed. When Vishwamitra left, Harishchandra started to worry as to what would happen to him in his next birth if he did not keep his promise made to a Brahmin. Seeing him perplexed, queen Shaivya tried to console him. She said- 'Man requires a wife only to produce a child. Now we already have a child- Rohit. Hence I am no longer useful for you. You sell me and pay the acquired wealth as Dakshina to the Brahmin.' Harishchandra fainted after hearing his wife's words. The queen began to wail at her husband's condition. Thus wailing, the queen also fell unconscious. The little Rohit also felt perplexed by his parent's condition. He began to cry- 'O father! O mother! I am hungry. Give me food.' At the same time, Vishwamitra arrived there in the guise of Kaal. After sprinkling water on Harishchandra's face, he made him conscious and said- 'O king! Get up and pay my Dakshina. Your sorrows will increase if you do not fulfil your promise.' Harishchandra was regaining his consciousness slowly but seeing Vishwamitra he fainted once again. This further enraged Vishwamitra. He said- 'O king! If you have even slightest of respect for Dharma, give my Dakshina at once. I will wait till evening and curse you if you fail to pay my Dakshina.' Saying this Vishwamitra departed. The fear of the curse began to terrorise Harishchandra. Meanwhile the queen also regained consciousness. She once again insisted to sell her in order to pay the Dakshina. This time, Harishchandra accepted her proposal and took the queen to the township. There addressing the crowd, he said- 'O dear citizens, kindly listen to me. I am selling my wife who is dearer to me than my own life. Anybody interested in buying her, please do so before evening.' An old Brahmin stepped forward from the crowd and said- 'I will buy her.' Hearing his words, Harishchandra became extremely sad that he could not even utter a word. The Brahmin then stuffed the money in the bark clothes of Harishchandra and began to drag the queen by her hair. The boy Rohit began to cry holding the hem of her mother. Seeing the condition of her son, the queen requested the Brahmin- 'O Arya! Kindly let me see the face of my child for once.' Then the queen turned towards Rohit and said- 'O son! Your mother is no longer free now. She has become a slave. Do not touch me because I have become an untouchable.' Then the old Brahmin began to forcibly drag the queen with him. Rohit also followed them crying loudly for his mother. The old Brahmin angrily kicked him. But still the boy did not give up following them. At last, the queen requested the Brahmin- 'O lord! I will not be able to serve you without my son. So kindly buy him also.' Hearing the words of the queen, the Brahmin once again stuffed some more money in the clothes of Harishchandra and tied the boy with the queen and began to drag both of them. Meanwhile Vishwamitra also appeared there and demanded the Dakshina. Harishchandra gave him all the money he had got from selling his wife and son. Seeing that amount of money, Vishwamitra boiled with anger and said- 'O wretched among the Kshatriyas! You call this small amount of money as Dakshina! Now look at the powers of my penance.' Harishchandra trembled with fear and said- 'O lord! Please wait a little more.' Vishwamitra said- 'Now only, a quarter of the day remains. I will wait only for this period and not more.' Saying this, Vishwamitra went away. With stooped face, Harishchandra once again said addressing the crowd- 'Now I am available for sale. Whoever wishes to buy me, please come forward before sunset.' Dharma in the guise of a Chandaal stepped forward from the crowd. He had a huge stinking body. He said- 'I will buy you.' Harishchandra asked- 'Who are you?' The Chandaal said- 'I am a Chandaal. My name is Praveer and I am the resident of this very town.' Harishchandra thought- 'It is better to accept the curse than accepting the slavery of a Chandaal.' At the same time, Vishwamitra also arrived there and said angrily- 'This Chandaal is ready to pay you a lot of money. Why don't you then pay my Dakshina?' Harishchandra said- 'O lord! I am born in Suryavansh. Accepting the slavery of a Chandaal causes great pain for me. I have no money now. Since now onwards, I will be your slave and do whatever you will ask me to do.' Vishwamitra said- 'If you are my slave and ready to obey me, then I sell you to this Chandaal for 1000 gold coins. Go and become his slave.' The Chandaal then presented many villages that were spread over an area of 100 Yojans to Vishwamitra and tying Harishchandra with a rope dragged him to his town. In the Chandaal's house, Harishchandra contemplated- 'The queen must be thinking that I would soon get her freed from the slavery of the old Brahmin after paying his dues. But she does not know that I myself have become the slave of a Chandaal.' After a few days, the Chandaal appointed Harishchandra as the supervisor of the cremation place and instructed him to be there present all the time and to cremate each dead body only after thorough investigation. He also instructed him to collect the toll for cremating every dead body and divide it in such a way that one sixth part of the toll goes to the king and from the remaining five parts, three parts should be reserved for him he should take only the remaining two parts as his remuneration. Since that day, Harishchandra began to live in the cremation ground. He always remembered the glorious days of his kingdom, his queen and his son. He had great regret that just because of the anger of Vishwamitra, he lost everything. Very soon, his new found occupation began to show on his appearance. His hair grew long and was unkempt, his body dry and stinking. In this guise, he began to roam in the cremation ground always carrying a stick in his hand. His whole day passed in the assessment of the cremation toll and its division among the various claimants. He had lost his mental stature as he even forgot the count of the days and could not distinguish between the day and night. One day, a snake bit Rohit as a result of which, he died. Shaivya brought Rohit, crying and wailing to the cremation ground. Even in the unkempt guise, she recognised Harishchandra. Hearing her wailing, Harishchandra went near her expecting to get the clothes of the deceased. There he saw a woman carrying a dead boy wrapped in a black cloth. He could not recognise queen Shaivya but the royal appearance of the boy forced him to think- 'To which royal family did this unfortunate boy belong to? How pitiable, the cruel Kaal did not even spare this boy. My son Rohit would have attained the same age by now.' His silence further hurt the queen who said- 'O lord! O king! How come, you have been living here without caring for your wife and son? We have already lost our kingdom. Now, we have lost our son also. O destiny! Did you not destroy everything of Harishchandra?' Harishchandra began to think who that woman could be and who that dead boy was? 'Isn't she my wife?' Thus recognising his wife and dead son, Harishchandra began to cry loudly and fainted. The queen after seeing her husband's condition fainted too. After sometime both of them regained their consciousness. Then the king took the dead boy in his lap and once again fainted. Queen Shaivya began to wonder why Harishchandra was staying in the cremation ground. For a moment, she forgot her sorrow and began to look at her fainted husband. Then she noticed the stick in Harishchandra's hand. Usually Chandaals used to carry that kind of stick. She became dejected with the thought that she had become the wife of a Chandaal. She then began to curse the destiny and began to wail embracing King Harishchandra and said- 'O king! I don't know whether I am dreaming or it is a reality. I have lost the power of thinking.' Hearing the words of the queen, the king opened his eyes and narrated the whole events that led to his becoming a Chandaal. Then the queen narrated her experiences and how their son Rohit died because of snakebite. Harishchandra fell on the ground and began to hug his dead son. He was wailing- 'How unfortunate I am that even my wishes are not under my control. Without the permission of the Chandaal, I cannot even commit self-immolation. But now, I will not differentiate between the sin and virtuosity. I will destroy my body in the pyre of my son.' The queen said- 'O king! I am also unable to bear the burden of sorrows. I will also commit immolation with you. Then all three of us will stay unitedly in the heaven. It won't matter to us even if we suffer the tortures of hell.' Then the king arranged a huge pyre and put his dead son on it. With the queen, he began to pray to God. Just then all the deities arrived there led by Dharma. Sage Vishwamitra also accompanied them. They praised Harishchandra. Then Dharma, Indra and Vishwamitra came closer to the king. Dharma said- 'O king! You have satisfied me with your merits like patience, endurance, truthfulness etc.' Indra said- 'Harishchandra, you are very fortunate. You have won our hearts along with your wife and son. You have even won the heaven with your action. I invite you to stay in heaven along with your wife and son.' Then Indra sprinkled ambrosia on the dead Rohit. Rohit got up and sat up in no time. Harishchandra, his wife and son Rohit were clad in divine clothes and garlands. Indra invited them to stay in the heaven forever but Harishchandra said- 'O king of the deities! Without the permission of this Chandaal, I cannot go anywhere. ' Dharma said- 'O king! I had learnt in advance about the miseries you would suffer in future. That's why I took the guise of a Chandaal and showed you all the grotesque action.' Indra once again invited them to heaven but once again, Harishchandra refused saying that in Koshal, people must have been living mournfully in his absence. 'I cannot leave them in that pitiable condition to enjoy the comforts of the heaven', said Harishchandra. Then, Indra, Dharma and Vishwamitra led Harishchandra to Ayodhya, the capital of Koshal. There they carried out the coronation of Rohit. Thereafter, they took Harishchandra and his queen Shaivya to the heaven. ", "next": "7.2.8", "prev": "7.2.6", "title": "King Harishchandra"}