{"index": "7.2.3", "image": "resized_images/Divine Plays of God.png", "text": " Sage Jaimini reached Vindhyachal and arrived before the birds as per Markandeya's instructions.\n He said- 'O birds! I am Jaimini, the disciple of Vedavyasa.\n I have come here with a desire to have your glimpse.\n' The birds welcomed him saying- 'It is our great fortune that you have arrived here.\n Your arrival has made us feel as if God himself has arrived.\n' Jaimini said- 'O learned birds! Kindly listen to the purpose of my visit.\n Sage Markandeya instructed me to come here and see you.\n You kindly answer my questions that I have in the context of Mahabharat.\n' The birds assured him of every possible explanation as per their knowledge.\n Sage Jaimini proceeded- 'Why did Lord take human incarnation even though He is the cause of the origin, perpetuation and destruction of the universe?\n How did Draupadi come to be the queen of five Pandavas?\n How did Balaram expiate for the sin of killing a Brahmin?\n How were Draupadi's sons attain martyrdom?\n Kindly narrate all these things in detail.\n' The birds say- 'The omnipotent, omniscient and the omnipresent Almighty God is worshipped even by the deities.\n We salute that Lord Vishnu who is the originator of this universe and who pervades everywhere.\n We salute Brahma from whose four mouths, the Vedas appeared and sanctified all the three worlds.\n We bow down at the feet of Mahadev.\n Those sages who have metaphysical knowledge assert that Narayan exists in four forms, which are both tangible and intangible.\n His first form is Vasudev, appearance of who is more imaginative in nature.\n This form exists everywhere and in every ages.\n The second form of Narayan is the one that bears the earth on his head.\n This form of god is known as Shesh.\n Being Taamasi in nature, this form has taken a serpent incarnation.\n The third form of God exhibits his divine power and plays.\n It fosters all the creatures, protects religion, and is known as Pradyumna.\n Yet another form of God known as Aniruddh rests on the serpent's bed in the abysmal depth of water.\n It carries out the task of creation.\n The third form of God destroys the irreligious demons.\n In the past, this same form rescued the earth from the abyss in the incarnation of a boar (Varaha avatar) and killed the demon King Hiranyakashipu in the form of Narsimha (lion face with human body).\n This same form of God has appeared now in Lord Krishna's incarnation. ", "next": "7.2.4", "prev": "7.2.2", "title": "Divine Plays of God"}