{"index": "7.2.6", "image": "resized_images/Killing of Draupadi’s Sons.png", "text": [" In Treta Yug, there was a king named Harishchandra.", " Once he was hunting in the Mahabaahu forest when suddenly, he heard loud cries of a woman- 'Save me! Save me!' It was followed by the cries of many women.", " Hearing those cries, King Harishchandra shouted loudly- 'Don't be afraid' and dashed in the direction of the cries.", " The cries however were an illusion created by Vighnaraj, the lord of the obstacles.", " At that time when King Harishchandra heard those cries, sage Vishwamitra was observing severe penance in the forest.", " In order to test Harishchandra's virtuosity, Vighnaraj entered his body.", " As soon as Vighnaraj entered Harishchandra's body, Harishchandra lost his temper and began to abuse Vishwamitra, which enraged him.", " His anger destroyed all the knowledge, he had acquired due to his severe penance.", " Seeing the angry Vishwamitra, King Harishchandra began to shiver.", " With folded hands, he begged Vishwamitra's pardon.", " He said- 'O great sage! It is my duty to protect the subjects.", " Kindly forgive me.", " Your wrath could greatly affect the performance of my duties as a king.", " Vishwamitra said- 'O king! If you are a true follower of religion, tell me, who should be given a donation?", " Who should be protected and who should be fought with?", "' Harishchandra answered- 'O great penancer! Donations should be made only to such a Brahmin who indulges in fast and religious actions.", " Protection should be extended to those who are afraid and battle should be fought with enemies.", "' Vishwamitra said- 'If you are a religious king, give me Dakshina (donation) as I am a Brahmin seeking salvation.", "' Harishchandra said- 'Tell me your desire.", " I am ready to grant it.", " Vishwamitra said- 'O king! Just presume that I have received whatever you would donate me.", " Now, give me Dakshina for the Rajsuya Yagya.", "' Harishchandra said- 'Ask me whatever you wish to have as the Dakshina of Rajsuya Yagya.", "' Vishwamitra said- 'O king! Give me all you have except your own body, your wife and child.", "' Feeling pleased, King Harishchandra granted what Vishwamitra desired.", " Vishwamitra said- 'O king! Tell me, who is the lord of your kingdom?", "' Harishchandra said- 'Since the moment I have presented this kingdom to you, you are its master.", "' Vishwamitra said- 'If I am the master of this kingdom, what are you doing here?", " Leave at once! But before leaving, remove all your clothes, ornaments and other royal insignia and go out wearing tree's bark only.", "' Thus after losing his kingdom, King Harishchandra got ready to leave with his wife Shaivya and son Rohit.", " Vishwamitra then intercepted him and said- 'Where are you going without paying a Dakshina for Rajsuya Yagya.", " Harishchandra said- 'O lord! I have donated my whole kingdom.", " Now only our bodies remain with us.", " What can I give you now?", "' Vishwamitra said- 'You cannot leave without paying a Dakshina because you have promised me.", "' Harishchandra said- 'Don't be angry, O Brahmin! I have nothing at present in my position but I will definitely pay you your Dakshina in due time.", "' Vishwamitra said angrily- 'Specify the time period within which you will give me my Dakshina or else be ready to get cursed by me.", "' Harishchandra said- 'I will pay the Dakshina within a month.", "' Thereafter, Harishchandra started to live in seclusion with his wife and children.", " Seeing the king's pitiable condition, his entire subjects began to follow him.", " Seeing their condition, Harishchandra halted and took a look on his subjects.", " At the same time, sage Vishwamitra also arrived there and began to curse Harishchandra for having attachment towards his subjects.", " Hearing the harsh words of Vishwamitra, Harishchandra left the kingdom with his wife Shaivya and son Rohit.", " To drive the king away as soon as possible, Vishwamitra began to beat the queen's back with a stick.", " Vishwamitra's abhorrent action enraged the five guardian deities of the directions and they condemned him.", " Enraged Vishwamitra cursed them- 'O sinners! Go and take birth as human beings.", "' This curse of Vishwamitra frightened the deities.", " They begged his pardon.", " Pleased by their prayers, Vishwamitra said- 'My words cannot be undone.", " But despite having incarnation of human beings, you will remain bachelors throughout your life.", " You will never feel attachment and allurement for anybody.", "' Thus due to Vishwamitra's curse, those five guardian deities took birth as the five sons of Draupadi.", " Dronacharya's son, Ashwatthama, ultimately killed them. "], "next": "7.2.7", "prev": "7.2.5", "title": "Killing of Draupadi’s Sons"}