{"index": "7.2.2", "image": "resized_images/Birds Migrate to Vindhyachal.png", "text": [" Sage Shami thereafter began to foster the chicks in his hermitage.", " With time, the chicks grew feathers and began to fly here and there.", " But every time the birds went out, they returned to the hermitage by evening.", " The birds also gained Vedic knowledge by hearing the discourses, which sage Shami used to give daily to his disciples.", " One day, when sage Shami was preaching his disciples, the birds arrived there and said- 'O great sage! You are like our father because you have protected us.", " You are our teacher also because we have gained knowledge from you.", " Now we have grown up, kindly tell us what should we do?", "'.", " The birds speaking like learned people amazed the sage as well as his disciple.", " He asked the birds- 'Tell us, how did you speak so clearly and is there any curse behind your present condition?", "'.", " The birds replied- 'O sage! Long ago, there used to live a sage, Vipulasvan.", " He had two sons- Sukrish and Tumbaru.", " In our previous birth, we were the sons of Sukrish.", " When our father and uncle performed Yagya, we brought them all the required materials.", " One day, Indra arrived at our hermitage disguised as an aged bird.", " The aged bird was starving, hence we requested our father to provide him with some food.", " Upon enquiring by our father, the bird expressed his desire to eat human flesh.", " Our father tried to dissuade the bird but it did not give up its insistence.", " Then our father called us and said that he had promised the bird to feed it with human flesh.", " So, we were asked to donate our body in order to satisfy the bird's hunger.", " But being frightened, we expressed our inability to meet the demand of the starving bird.", " This infuriated our father for we were violating his promise that he had made to the bird.", " He then cursed us to take birth as birds in our next life and himself got ready to donate his body.", " As our father was breathing his last, Indra resumed his real self and said- 'O great sage! I took this guise only to test your character.", " Kindly forgive me and tell me what you desire now?", "' Indra blessed our father to have divine knowledge and penance free from all obstacles.", " Thereafter we also fell at our father's feet and begged for his pardon.", " We requested him to take back his words but he said that his words would not go futile.", " But still he blessed us to have supreme knowledge even in the form of birds.", "' Concluding their talk, the birds said- 'O lord! Thus controlled by destiny, our father cursed us.", " After sometime, we took birth in bird form in the battlefield where you found us and fostered us in your hermitage.", " Now we are strong enough to fly long distances.", " So kindly free us from your obligation.", "' Hearing the words of the birds, sage Shami said to his disciples- 'Look! I had already told you that these birds were no ordinary creatures.", " They even survived the battle of Mahabharat.", " It shows their greatness.", "' Then sage Shami granted them permission to migrate to the Vindhyachal.", " The birds decided to pass their time by studying the Vedas and doing penance as long as they stayed there. "], "next": "7.2.3", "prev": "7.2.1", "title": "Birds Migrate to Vindhyachal"}