{"index": "7.3.4", "image": "resized_images/Attenuation of Sins.png", "text": " Yamadoot says- As a result of accepting money from a degraded person, a Brahmin takes birth as an ass.\n A Brahmin who carries out Yagya for a degraded person takes birth as worm after undergoing severe sufferings in different types of hell.\n A person takes birth as an ass or an inferior bird as a result of abusing his parents.\n A person who does not worship his tutelary god before eating takes birth as a monkey.\n Traitors take birth as fish.\n Those who steal cereals take birth as mice.\n A Shudra, who manages to establish intimacy with a Brahmin woman, takes birth as a worm.\n Similarly, killers of woman and children also take birth as worms.\n Ungrateful people take birth as worm, insects, grasshoppers, scorpion, crows etc.\n Encroacher of land takes birth as grass shrubs, creepers and inferior trees.\n Butchers who kill bulls take birth as eunuchs.\n Thus a person has to face the result of his Karma according to the gravity of his sins.\n Sumati says- As Yamadoot began to push the king ahead, all the creatures in hell gave a loud cry- 'O king! Please stay here for few more moments.\n The wind that blows towards us after touching your body gives us immense joy.\n This wind has ended our sufferings and pains.\n Have pity on us.\n' The king asked the Yamadoot- 'Why are these people so joyous by my presence?\n Yamadoot said- 'O king! Initially, you used to sustain your body by the leftovers of the deities, ancestors, guests and ascetics.\n This is the reason why the wind that blows touching your body causing such pleasure to these people.\n ' The king said- 'If I can eliminate the sufferings of these sinners merely by standing here, I will definitely stay here.\n' Yamadoot said- 'No, you cannot stay here.\n It is a place for the sinners only.\n Come with us.\n You will have to enjoy the pleasure of your pious action.\n' The king said- 'No, I will not go anywhere leaving these poor people in this pitiable condition.\n' Yamadoot said- 'O king! Look, Dharma and Indra have themselves arrived to escort you to the heaven.\n ' Dharma said- 'O king! You have worshipped me.\n Hence follow me to the heaven.\n' The king replied- 'No, I will not go anywhere leaving these thousands of people in the hell.\n' Indra said- 'Everyone has to taste the fruits of his Karmas.\n You cannot help them.\n' The king said- 'O Indra! Tell me, how virtuous was I in my previous life?\n' Dharma said- ' Though your pious actions are fathomless, be sure that their significance are not much than drops of water in an ocean, the stars in the sky.\n The kindness you have shown towards these sinners has further enhanced your virtuosity.\n' The king said- 'If it is so, may all these people be released from their sufferings by the virtue of my good Karmas.\n' Indra said- 'O king! By your words, your pious action has increased like the height of the mountain and these sinners have also been released from their sufferings.' ", "next": "7.4", "prev": "7.3.3", "title": "Attenuation of Sins"}