{"index": "7.3.3", "image": "resized_images/Description of Tortures in Hell.png", "text": " Thus asked by the gentleman, Yamadoots replied politely- 'O king! You once deliberately prevented your wife Pivari from conceiving because you were more attracted to your second wife- Sushobhana.\n It is because of that action that you have been brought here to undergo severe torture.\n' The religious minded king said- ' I am willing to go where ever you want to take me, but before doing that I would like to have answers to my questions.\n I see many people undergoing severe tortures in this hell.\n Big and frightening crows prick their eyes.\n Tell me, for what sin they are facing such tortures.\n' Yamadoot said- 'O king! Humans suffer or enjoy according to their Karmas.\n The effect of their Karmas diminishes in proportion to their sufferings.\n These crows are pricking the eyes of such people who had seduced other women and deceitfully acquired others' wealth.\n These people will suffer for the same number of years as their eyes blinked during the leering.\n These crows prick the tongues of those people who had criticised Vedas, deities, Brahmins and teachers.\n Those who caused differences between friends, husband-wives, father and sons and relatives, or killed the performer of the Yagyas are suffering under the saw.\n Those who insulted their parents and teachers have been thrown in the pit of pus, faeces and other excretions with their head down.\n Those who had food before offering it to the deities, guests, servants, father and elders, fire and birds, stay in a pit of pus.\n Iron nails are hammered into the ears of those people who gleefully heard the criticism of creatures, deities, Brahmins and Vedas.\n Those who remarried their daughters to another person despite her former husband being alive are cut into pieces and thrown into saline river.\n Those who betrayed their friends are tied tightly with a rope.\n Worms, scorpion, crows and owls then bite their bodies.\n Those who enjoyed carnal intimacy during daytime or had illicit relations with women are hammered with nails to a prickly Bombax tree.\n Those who insulted Vedas and fire are thrown from the lofty peaks of mountain.\n O king! Those who steal gold, those who kill Brahmin, those who drink wine and those who rape the wife of their teacher are burnt in fire.' ", "next": "7.3.4", "prev": "7.3.2", "title": "Description of Tortures in Hell"}