{"index": "7.4.1", "image": "resized_images/Greatness of Being Chaste (and birth of Durvasa, Dattatreya, Chandrama).png", "text": " Brahmin says- O son! Tell me, what should I do now? Sumati says- Now, you should become a Vanprasthi and lead a life of a Bhikshu by having control over your senses. You will attain that rare Yoga, which helps a man to unite with the almighty after freeing him from the cycles of birth, death and re-birth. Brahmin says- O son! Now explain to me about this Yoga, which bestows liberation to a man. Sumati says- I am now describing to you, the same text related with Yoga that was once narrated by Dattatreya to Alark. The Brahmin asked Sumati- Who was Dattatreya's father? How did he acquire the knowledge of Yoga? Who was Alark? Sumati says- In ancient Pratisthanpur (modern Paithan) there lived a Brahmin. He was inflicted by leprosy because of the sins he had committed in his previous birth. The Brahmin was very short-tempered and used to scoff at his wife frequently. But his wife was very chaste in character and worshipped him like a deity. One day, the Brahmin ordered his wife to carry him to the prostitute's house, as he had become too weak and feeble. Being chaste, the wife collected some money and began to carry the Brahmin on her shoulders to the home of the prostitute. On their way, they reached a place where sage Maandavya was hanged but still was alive. In the darkness, the woman could not see the things clearly and the Brahmin who was riding her shoulders happened to touch the sage. The sage cursed angrily that whoever had touched him would die before sunrise. Hearing the words of the sage, the Brahmin's wife thundered that there would be no sunrise tomorrow. Words of the woman came to be true as next morning, the Sun did not rise. Thus the whole world was shrouded in darkness as a result of which, the deities became worried. The deities apprehended that without the occurrence of sunrise, the whole universe might be destroyed. They were also worried that without the differentiation of day and night, how could the months be calculated and the seasons known. Even the calculation of year would be impossible. The chastity of Brahmins wife had forced even the mighty sun to eschew its daily routine. As a result of this, religious activities like Havan, Yagya etc. also came to a halt. Seeing them perplexed, Brahma advised the deities to eulogise Ansuya, the wife of sage Atri. All the deities then pleased Ansuya who assured them to convince the wife of the Brahmin to retract her words. After that, Ansuya reached the Brahmin's hut and said to his wife- 'O fortunate one! May you always serve your husband with full dedication. A chaste woman enjoys half the virtues of her husband, which he earns by his religious activities.' Brahmini said- 'I am blessed today that the deities have at last glanced at me. Now, tell me, what should I do?' Ansuya said- 'O Saadhvi! In the absence of the day, all the religious activities have ceased to exist. The world is on the verge of extinction. Only your wish can protect the world from imminent calamity. Hence, be pleased now and allow the Sun to rise as usual.' Brahmini said- 'O fortunate one! Sage Maandavya had cursed that my husband would die with sunrise. I cannot afford to lose my husband.' Ansuya said- 'Don't worry, O chaste woman! I will resurrect your husband. So, kindly allow the Sun to rise now.' Then, Ansuya invoked the Sun by offering water as an oblation. However, the leper-inflicted Brahmin died as soon as the Sun rose. Then by the powers of her penance, Ansuya resurrected the Brahmin and transformed him into a disease- free handsome young man. She also blessed the couple to live for hundred years. The deities were pleased with Ansuya and asked her to seek a boon. Ansuya expressed her desire to give birth to the trinity of Brahma, Vishnu and Mahesh as her sons. The trinity blessed her with this boon. In due course of time, Brahma, Vishnu and Mahesh took birth as Chandrama, Dattatreya and Durvaasa from Ansuya. ", "next": "7.4.2", "prev": "7.4", "title": "Greatness of Being Chaste (and birth of Durvasa, Dattatreya, Chandrama)"}