{"index": "7.4.6", "image": "resized_images/Madalasa is Reborn.png", "text": " When prince Ritudhwaj reached the capital, everyone expressed his pleasure with surprise. Ritudhwaj met everyone happily and went to the palace of his parents. Though the king and the queen blessed him but sad expression on their face surprised the prince. Upon enquiry, the king related the entire incident and also how his wife Madalasa had died. The news of Madalsa's death shocked Ritudhwaj. Then consoled by his parents and friends, prince Ritudhwaj carried out the necessary consecrations to pacify the soul of his dead wife. He had decided never to marry again. The sons of the Naag said- 'O father! Now prince Ritudhwaj lives like an ascetic. He never casts his eyes on women and only indulges in playing with people of his age. Hence all we can do for him is to keep him happy.' Hearing the entire tale, Naagraj fell in deep thought. After sometime he said to his sons with a laughter- 'O sons! Now I will do such a thing that will bring back the smile of Ritudhwaj.' Saying this, Naagraj Ashwatar reached Plakshaavataran, a place of pilgrimage at the foothills of Himalayas along with his brother Kambal. There they began to do severe penance to please Goddess Saraswati. At last, Saraswati appeared before them and asked them to seek a boon. Ashwatar requested her to bless both of them with a sweet and melodious voice. After granting them this boon, Goddess Saraswati disappeared. By her blessings, Ashwatar and his brother, Kambal became famous singers. Then they began worshipping Lord Shiva singing sweet and melodious hymns. Pleased by their prayers, Lord Shankar also asked them to seek a boon. At that Ashwatar said- 'O lord! I wish that Ritudhwaj's wife Madalasa takes birth as my daughter.' Lord Shankar said- 'With my blessings, your wish shall come true. During the Shraadh period, you yourself take the middle portion of the Pind (food offered to dead ancestors) and contemplating on me, offer oblations to your ancestors. Madalasa will emerge from your 'middle-hood'. Bowing before Lord Shiva thereafter, both the brothers returned to their kingdom in Paatal loka. Ashwatar organised a Shraadh in the same way as told by the Lord and consumed the middle portion of the food offered to the ancestors. Then contemplating on the desired object, he let out a deep sigh. Instantaneously, Madalasa emerged from his 'middle-hood'. Ashwatar did not reveal this fact to anybody and made adequate arrangements so that she could live in secrecy. Thereafter one day, he instructed his sons to bring their friend Ritudhwaj to the palace. Both the sons once again joined the company of Ritudhwaj. One day while playing, they insisted him to visit their palace. The prince gladly accompanied them. In Paatal loka, he was amazed to see his Brahmin friends getting transformed into serpents. They took Ritudhwaj through the streets and lanes of their kingdom. Ultimately they reached the palace of Ashwatar. Introducing Ritudhwaj, the serpent princes said- 'O father! This is our brave friend, Ritudhwaj.' Ritudhwaj greeted Ashwatar respectfully and received his blessings. Ashwatar said to him- 'Long live O prince! My sons always sing praise of your divine virtues. I request you to stay with us for a few months and enjoy the pleasures of Paatal loka.' ", "next": "7.4.7", "prev": "7.4.5", "title": "Madalasa is Reborn"}