{"index": "7.4.3", "image": "resized_images/Kuvalayashva and the Horse Kuvalaya.png", "text": " Sumati says- O father! Now listen to the tale of a Brahmin named Alark.\n Long ago, there lived a king named Shatrujit who had a meritorious son, Ritudhwaj.\n Prince Ritudhwaj had many friends with whom he used to play with.\n In course of time, two sons of Ashwatar, the king of Nagas became his friends in the guise of Brahmin boys.\n Both of them were young and good-looking.\n Both of them used to pass the entire day in the company of Ritudhwaj.\n They would return to their abode in Paatal loka only at night.\n On being enquired by their father, they revealed the reason about their late arrival at home.\n They said- 'O father! Up there on the land, there is a prince named Ritudhwaj.\n He is the son of King Shatrujit.\n He is very handsome, gentle, brave, truthful, knowledgeous and meritorious.\n We enjoy his company.\n' Ashwatar said- 'Prince Ritudhwaj is really blessed for even the meritorious people like you praise him.\n But have you done anything to make him happy?\n' His sons asked- 'What can we do for his pleasure?\n We find ourselves incapable of pleasing such a person whose riches are even rare for Paatal loka.\n' Ashwatar said- 'Even then, I wish to hear about the characteristics of your new friend.\n' The sons said- O father! Once the prince narrated us a tale, we are going to relate it now.\n A Brahmin named Gaalav lived in King Shatrujit's kingdom.\n One day, he arrived in the court of the king riding on a horse and said- 'O king! For the past many months, a wretched demon has been tormenting me and causing severe disturbances in my daily rituals.\n He is capable of taking any guise at will.\n Disguising as an elephant, lion, tiger, wolf and many other wild animals, he terrorises me.\n It has become very difficult for me to do my meditation.\n One day in my frustration, I let out a deep sigh.\n As soon as I did so, this divine horse descended from the sky.\n I heard a heavenly voice, which said- 'O Brahmin! This horse is capable of circumambulating the entire earth without getting tired.\n It can climb lofty mountains effortlessly and can also run in all the three worlds with the same speed.\n Hence, this horse shall be renowned as Kuvalaya.\n Riding it, the son of King Shatrujit will kill the demon that torments you day and night.\n 'O king! That is the reason that I have arrived in your court with this horse.\n Kindly accept it and instruct your son to ride it and kill the demon.\n' King Shatrujit saw his son Ritudhwaj off with the Brahmin riding that divine horse. ", "next": "7.4.4", "prev": "7.4.2", "title": "Kuvalayashva and the Horse Kuvalaya"}