{"index": "7.4.4", "image": "resized_images/Kuvalaya goes to Patal Loka, Killing of Demon Patal Ketu and Marriage with Madalasa.png", "text": " Prince Ritudhwaj stayed in the hermitage of sage Gaalav and helped him to perform his Yagyas without any problem by clearing all the minor obstacles.\n The demons were not aware of his arrival in the hermitage.\n One day, a demon arrived in the hermitage disguised as a wild boar and began to rub his bushy head against the body of sage Gaalav.\n Seeing this, his disciples began to scream.\n Prince Ritudhwaj at once rode the horse and wielding a weapon dashed after the boar.\n The prince injured the boar with an arrow, which was sickle- shaped.\n The demons fled from the scene.\n Prince Ritudhwaj followed the boar everywhere it went on the mountains, in the forests and on the riverbank.\n He was determined to slay the demon that had been disturbing the sage for long.\n Ultimately, the boar jumped into a pit.\n Ritudhwaj also followed it but could not see the boar anywhere in the pit.\n Instead he saw a beautiful town which could have matched even the abode of Indra.\n He entered the town where he saw an extremely pretty girl who was walking briskly.\n Ritudhwaj tried to know about her destination but she ignored him and climbed the stairs of a palace.\n Ritudhwaj also followed her and in the palace, he saw a beautiful girl sitting on a bedstead.\n As soon as the girl saw him, she fainted.\n Her beauty attracted even Ritudhwaj.\n He assured her that there was nothing to be afraid about.\n Then the same girl whom Ritudhwaj had sighted earlier came there and began to fan the fainted lady.\n The prince enquired about the reason of her unconsciousness.\n But the girl did not say anything.\n Instead she whispered something in the ears of her friend who then said- 'O stranger! This is the daughter of Vishwavasu, the king of Gandharvas.\n Her name is Madalasa.\n One day, while she was playing in her garden, a demon Paatalketu abducted her.\n Since then she stays here in his captivity.\n On the coming thirteenth day of this month that demon will marry her.\n But he doesn't deserve to be her husband.\n Yesterday, she was ready to commit suicide but the cow Surabhi, assured her that a man from the earth would come and kill the demon.\n Only he would be suitable for my friend.\n I am her friend.\n My name is Kundala.\n I am the daughter of Vindhyavan and wife of Pushkarmali.\n My husband had been killed by the demon Shumbh.\n Since then I have been touring various places of pilgrimage in order to receive salvation.\n That wretched Paatalketu had taken the guise of a boar but a brave man has injured him with his arrow.\n I have arrived here only to investigate who is that man.\n Do not worry about my friend's unconsciousness.\n She has fainted because of your infatuating handsomeness.\n She has begun to love you but her problem is that only that man can marry her who has injured the boar.\n This thought has caused her to lose her consciousness.\n Now reveal your identity.\n' Ritudhwaj said- 'I am the son of King Shatrujit.\n I have been staying in the hermitage of sage Gaalav to protect the sages.\n Just a few days back, a boar arrived in the hermitage and began to torment the sages.\n I have injured that boar with my arrow.\n Now I have arrived here following that boar and happened to see you.\n' Hearing the words of Ritudhwaj, Madalasa felt shy as well as extreme joy.\n Kundala then said to her friend- 'The prince speaks the truth.\n Words of Surabhi cannot go wrong.\n' She then said to Ritudhwaj- 'O brave man! Doubtlessly you have killed the demon, Paatalketu.\n My friend Madalasa is blessed now.\n Now its your duty to marry my friend and take her home as your bride.\n' Ritudhwaj said- 'How can I marry your friend without the permission of my father.\n I am still not fully independent.\n' Kundala said- 'Please do not say this.\n My friend is a divine beauty.\n Marry her right now.\n' Prince Ritudhwaj then agreed to marry Madalasa then and there.\n Madalasa happily remembered their family priest Tumbaru who arrived there instantaneously.\n In the presence of sacred fire, Tumbaru carried out the rituals of marriage and tied them in nuptial knot.\n Thereafter blessing the newly wed couple, Tumbaru and Kundala took to their respective paths.\n On the other hand, when Ritudhwaj and Madalasa started off riding the horse, Kuvalaya, demons' army surrounded them.\n A fierce battle followed.\n In no time, prince Ritudhwaj slayed the entire army and reached his kingdom.\n There he narrated the whole incident to his father Shatrujit.\n King Shatrujit felt very much pleased by the prowess of his son and blessed them heartily.\n Thereafter, Ritudhwaj came to his palace with his wife Madalasa. They then began to live happily. ", "next": "7.4.5", "prev": "7.4.3", "title": "Kuvalaya goes to Patal Loka, Killing of Demon Patal Ketu and Marriage with Madalasa"}