{"index": "7.4.5", "image": "resized_images/Separation of Madalasa.png", "text": " The newly-wed couple had hardly spent few months together when King Shatrujit once again instructed Ritudhwaj to travel across the entire earth and see whether the Brahmins were performing their religious duties without any obstacles.\n Ritudhwaj obeyed the dictates of his father.\n He used to scale vast distances for the whole day and returned to his wife only at night.\n One day he noticed that a sage was staying at the bank of river Yamuna.\n He was in fact Taalketu, the younger brother of Paatalketu.\n But the prince could not recognise him.\n That sage approached Ritudhwaj and requested him to extend his protection over his hermitage, as he was about to start Yagyas.\n He also begged for the precious necklace of the prince on the pretext that he had nothing to pay as Dakshina.\n The gullible prince gave his necklace to the sage.\n Then instructing the prince to guard the hermitage and promising to return soon, the sage left.\n In fact, the sage who was actually a demon arrived in the court of King Shatrujit.\n Madalasa was also present in the court.\n He said- 'Prince Ritudhwaj sacrificed his life fighting with the demon while protecting my hermitage.\n Before his death, he gave me his necklace.\n His horse has been captured by the demon.\n I have brought this necklace to you to inform you about that sad incident.\n' After giving the necklace to Madalasa, the demon returned to the hermitage.\n Hearing the news of her husband's death, Madalasa also gave up her life.\n Mourning soon enveloped the entire palace.\n Seeing the death of his daughter-in- law, Madalasa, King Shatrujit was in a dilemma as for whose death should he mourn.\n A little contemplation led him to the conclusion that it would be futile to mourn his son- Ritudhwaj's death because he had died for a noble cause.\n But his daughter-in-law had followed the steps of her husband, so her death should be mourned for.\n The queen also supported the king.\n Thereafter the king performed the last rites of both of them.\n When Taalketu returned to his hermitage, he found Ritudhwaj still standing alert.\n In a sweet tone, Taalketu said- 'I am obliged by you, O prince! Staying here with unwavering mind, you have executed my desired task.\n I have met my objective, so you may go now.\n' Prince Ritudhwaj then returned to his palace riding his horse. ", "next": "7.4.6", "prev": "7.4.4", "title": "Separation of Madalasa"}