{"index": "7.5.2", "image": "resized_images/Duties of a Grihastha (Householder).png", "text": [" Alark says- What are the duties of a married man by discharging which he becomes free from all kinds of bondage and attains salvation.", " Kindly tell me about these things.", " Madalasa says- O son! Those people who discharge their duties as a householder by fostering all the living beings attain to the heaven automatically.", " All the living creatures of the world including the deities and the dead ancestors are dependent on their nurturing on the householder.", " They always look at the face of the married man for their living.", " In fact, Grihasthashram can be compared to a cow that fosters others with her milk.", " All the four Vedas are present in this 'cow' that is Grihasthashram.", " Entire universe is reflected in this Ashram.", " Daily after the bath in the morning, a Grihastha must perform oblations to the deities, to the sages, Prajapati and ancestors by offering water to them.", " Then he should perform a Yagya and offer cereals in the sacrificial fire.", " There are certain places in the house, which are reserved for specific deities and where offerings are made to them.", " Sacrifice to Brahmaji should be offered in the central part of the home, to Vishwadeva in the eastern side of the home, to Dhanvantari in the northern side, to Indra again in the eastern side, to Yama in the southern side, to Varun in the western side and to Soma in the northern side of the home.", " At the threshold of the house, sacrifice should be offered to Dhaata and Vidhaata.", " One must sit facing the south while offering sacrifice to his dead ancestors.", " For the dogs and birds, sacrifices should be given on the ground in the morning and evening.", " At the arrival of a guest, a Grihastha must worship him by offering water, cereals, flowers etc.", " as per his financial condition.", " If possible, a Grihastha should feed one or more Brahmins in order to pacify his ancestors.", " He should give alms to a beggar and a celibate.", " Without giving alms, a Grihastha must not proceed to dine.", " He should also feed starving and diseased people first.", " Such kind of living definitely benefits a Grihastha. "], "next": "7.6", "prev": "7.5.1", "title": "Duties of a Grihastha (Householder)"}