{"index": "7.5.1", "image": "resized_images/Varnashram Dharma.png", "text": " Alark says- 'Tell me about the duties of the different classes and stages of life.\n' Madalasa says- 'Donation, study and Yagya, these three are the religion of a Brahmin.\n Performing Yagya for others, teaching and accepting donation are the three vocations of Brahmin.\n Donation, study and Yagya are also the religious duties of Kshatriyas.\n Protection of land and using weapons are vocation for Kshatriyas.\n Religious duties of a Vaishya are also same like that of the Brahmins such as donation, study and Yagya.\n For a living, Vaishya may take up animal rearing, agriculture and trade as profession.\n Serving all these three above mentioned castes as well as making donations and performing Yagya are the religious duties of a Shudra.\n Tilling the earth, serving Brahmins, feeding animals, selling and purchasing items are professions of a Shudra.\n A person belonging to Dwij class may relatively enjoy freedom until his sacred thread ceremony has not been performed.\n After the sacred thread ceremony, he should come to stay at the home of his teacher and observe celibacy strictly while studying scriptures.\n There he is expected to serve the Guru sincerely.\n At the completion of education, he should pay Dakshina to his Guru.\n He may get married and start the second stage of his life that is Grihasthashram.\n He should then subsequently opt for Vanprastha and Sanyaas respectively.\n After the completion of education and paying all the dues, the disciple is ready to start second stage of his life that is Grihasthashram.\n For this he should first find a suitable girl from his caste and get married.\n Grihasthashram is considered as the best stage of life.\n It is in itself a complete Yagya.\n As a householder, he is expected to foster those who are dependent on him.\n During this stage of his life, he should earn his livelihood by occupations ascribed for his caste.\n He should please the deities by performing Yagyas, his ancestors by making oblations, Prajapatis by producing children, spectres by offering sacrifices of cereals and society by showering love.\n Even the ascetic and celibates depend on married people for their daily bread.\n Hence married life or Grihasthashram is stated to be superior among all the Ashrams.\n A Grihastha must welcome and treat even his unexpected guests with great warmth.\n A householder who fails to satisfy his guest never succeeds in religious matters.\n The Yagyas that are offered in such households go futile.\n Hence it is not proper for the householder to show ego and abuse a guest otherwise he will have to expiate for it later.\n When the children of the householder grow up and his body becomes senile, he should go to the forest after relinquishing the world.\n There, he should pass his time by indulging himself in austerities and religious activities.\n This stage is known as Vanprasthashram and is most necessary for the sanctification of his soul.\n This stage is followed by Sanyaasashram- the stage, which requires complete renunciation, celibacy, control of senses and anger etc.\n The virtues like truthfulness, sanctity, non-violence, tolerance, forgiveness, kindness, generosity and contentment are the religious merits applicable to all the Ashrams equally.\n Those who abide by their religion stay in the abode of Brahmaji till the reign of fourteen Indras.\n The king punishes those who violate this religious code.\n If the king doesn't punish them, he is himself destroyed.\n Hence a king must first of all abide by the duties as prescribed for different Ashrams in his life and only then he has the right to punish those people who violate these dictates. ' ", "next": "7.5.2", "prev": "7.5", "title": "Varnashram Dharma"}