{"index": "7.6.4", "image": "resized_images/Forbidden and Permitted Items.png", "text": " Madalasa says- O son! Now, I will tell you the do's and don'ts for healthy living. Stale cereals, oil and fats stored over a prolonged period of time, items prepared from wheat and barley and food items which is not prepared from pure ghee or milk should not be consumed. Flesh of turtle, porcupine etc. is worth eating whereas flesh of village pigs and cocks should not be consumed. Brahmin can eat flesh offered to him in a Shraadh. Things like conch, stone, gold, pearl etc. are purified simply by washing in water. Cereals either touched or washed by unwarranted people is not fit for any purpose. Flesh of animals killed by Chandaal or killed for the purpose of oblation in Shraadh is also considered pure. Seat, bed, vehicle, boat, grass, rays of the Sun and Moon and air are naturally pure things. Touch by a woman who is in her menses, dog, jackal, a mother who has recently given birth to a child, a Chandaal, carriers of the brier etc. is defiling in nature. A person however can become pure once again by taking bath if touched by any of these people and animals. One should not neglect the appearance of blood and cough. Excretions and water collected after washing the feet should be thrown out of the home at once. Getting touched by the people who criticize deities, ancestors, Yagya, mantra etc. is also defiling. Sighting of the Sun however purifies the defiled person. Duties of the woman: Different male and female deities dwell at the threshold of the home. Hence this portion of the home should be worshipped properly everyday. At dawn, the threshold should not be left vacant or it may have adverse effect on one's lineage. The whole area inside the home should be plastered with cow dung daily or washed with pure water. All these activities should be carried out by the better half of the householder. Those women, who prepare food during the last quarter of the night, suffer from infertility in future births. Those women, who do not sweep their home in the evening, remain unmarried and are bereft of wealth in future births. Such women also lose their wealth, life-span and reputation. Kicking the following things like broom, hearth and mortar etc. or touching them with feet also leads to the loss of progeny and wealth. The householder should not use broken seat, board and black blanket for sitting purpose. He should not comb his hair while facing south. Those who do not dine, perform Havan or make donations at the appropriate time are no better than eunuchs. Those who shun these activities despite having wealth are worse than mice. Those who do not respect the deities, teachers, wife of the teacher, cow, Brahmin etc. are boycotted by the society. Naked are those who are devoid of Vedas, other religious scriptures and rituals. Such a house is really contemptible, which is boycotted by the Brahmins and where daily routines are not followed regularly. After birth or death in the family, a Brahmin becomes purified in ten days. During this period of ten days, he should avoid all the religious activities. In similar conditions, a Kshatriya gets purified in twelve days after a birth or death in his family, a Vaishya in fifteen days and a Shudra in one month. Dead body of a person should be cremated outside the boundaries of the village. His family members should offer oblation of water to pacify his soul on the first, fourth, seventh and ninth days after the cremation. Ashes should be collected from the fourth day. In case of deaths caused by a snake bite or poisoning family members may get purified after a day. There is no impurity in case of the death of a child, an immigrant and the one who has renounced everything. Even their cremation is not carried out nor oblation of water is made. If one more death occurs in the family while the mourning period of the earlier death is still continuing, impurity of the second death lasts as long as that of the first one. Similar rules are applied to the impurity caused by the birth. Thus abiding by these norms, the householder can easily attain the four objectives of life that is Dharma, Arth, Kama and Moksha. ", "next": "7.7", "prev": "7.6.3", "title": "Forbidden and Permitted Items"}