{"index": "7.6.1", "image": "resized_images/Regular and Causal Duties.png", "text": " Madalasa says- O son! A Grihastha has three kinds of duties- regular, causal and a combination of both. Rituals, which are connected with oblations and carried out daily, are called regular duties. Rituals and consecrations performed at the birth of a child are called causal duties. Yearly performance of Shraadh for the dead ancestors is a combination of regular and causal duties. Now listen about the causal duties. At the time of a child's birth, different kinds of rituals and consecrations are carried out in the household. During the time of marriage ceremony also, many more rituals are carried out. At the time of marriage however, performance of the Shraadh named Naandimukh is a must. During the Shraadh, the host should sit facing the north or the east and offer a loaf made of barley flour and yoghurt. Then he should circumambulate around two Brahmins and worship them. Rituals and Shraadh carried out in the household after the occurrence of any death in the household comes under the category of causal duties. During the Shraadh period, all kinds of sacred activities are forbidden. Only the use of Kusha grass is permitted. Donation of 'Pind' comprising of barley flour, yoghurt, honey etc. is made for only one time to pacify the soul of the dead person. Then oblation of water with sesame seeds should be offered in the name of the dead person. This ritual should continue for a year- once every month. After a year, Shraadh is organised in which one, three or five Brahmins are fed. Thereafter, every year, during the darker phase of Ashwin month, a Shraadh should be carried out for the dead ancestors. This ritual is a combination of regular and causal duties. Sages have made provision for appeasement of dead ancestors up to the last seven generations. Cereals, which the people offer in the name of their dead ancestors, pacify those souls who stay in Pishaach Yoni. Water falling on the earth at the time of wringing the clothes after one's bath pacifies those souls, who have taken the form of vegetation after their death. Water falling during the bath satisfies those souls who have attained the status of deities. Cereals that fall during the lifting of Pind satisfy those souls who are in lower life forms. The cereals that scatter here and there and swept aside satisfy souls of those people, who had died in their childhood before the accomplishment of any consecration. The waste water falling down while Brahmin washes his hands after dining and pacifies all the other souls. Every month, during the waning phase of the Moon or on the day of Amavasya, Shraadh should be carried out. Besides it, eighth day of darker phase in the month of Paush is also good for carrying out Shraadh. If a virtuous Brahmin is available, time of solar and lunar eclipses is also good for Shraadh. The time when the Sun crosses the equator during its northward and southward journey is also good for Shraadh. Apart from these above mentioned situations, one can also organise Shraadh in the following circumstances- at the time of great calamity, availability of items suitable for Shraadh, after a nightmare, during the period of birth Nakshatra and during the period of unfavourable stars etc. On the first day of the Shraadh, a virtuous Brahmin should be invited while the host must observe total restraint. It is said that such a man, who indulges in sexual intercourse on the same day after carrying out Shraadh or eating food of Shraadh, causes his dead ancestors to sleep in semen for one month. Ancestors of such a man, who performs Shraadh immediately after having a sexual intercourse, drink urine and semen for one month. Hence a virtuous Brahmin, whom the host is intending to feed, should be informed about the Shraadh one day earlier in advance. If a Brahmin is not available, a true celibate can be fed on the day of Shraadh. After the Brahmin has carried out all the necessary rituals, Havan, oblation etc., he must be formally insisted to dine. All kinds of edible items that a Brahmin may wish to eat should be offered. While reciting the Rakshodhn mantra, grains of sesame and mustard should be scattered on the ground. After the Brahmin has dined, he should be offered with water to wash his hands and some cereals that should be scattered on the ground with his permission. Then sitting on the seat of Kusha grass, the host should offer a Pind made of sesame seeds, barley flour, sugar, ghee etc. An oblation of water should follow it. At the end, the Brahmin should be seen off with proper Dakshina. Only then the host is free to dine himself along with other invited guests and family members. ", "next": "7.6.2", "prev": "7.6", "title": "Regular and Causal Duties"}