{"index": "7.6.2", "image": "resized_images/Dos and Don’t During a Shraadha.png", "text": " Madalasa says- O son! I am now narrating about the do's and don'ts to be followed during Shraadh. Many kinds of edible items can be offered in the Shraadh. These include cereals like barley, wheat, rice, millet, corn, etc., fish, flesh of deer, rabbit, bird, wild boar, goat and Neelgai (antelope). All these kinds of items are capable of pacifying the soul of dead ancestors for different period of time depending on the nature of offerings being made. Likewise cereals offered in sacred fire cause satisfaction for one month. Fish causes satisfaction for two months. Flesh of deer causes satisfaction for three months. Flesh of rabbit causes satisfaction for four months. Flesh of bird causes satisfaction for five months. Flesh of wild boar causes satisfaction for six months. Flesh of goat causes satisfaction for seven months. Flesh of different types of deer and antelope causes satisfaction for eight, nine and ten months respectively. Food items made of cow's milk and ghee and kheer cause satisfaction to the dead ancestors for one year. Different varieties of rice, barley, millet, wheat, sesame, moong dal, mustard etc. are extremely satisfying food for the ancestors. Different types of pulses and corn can also be offered. Use of garlic, carrot, onion, radish, refined salt, red gum, gourd etc. is prohibited. Water that is stinking, frothy, stale or otherwise incapable of quenching a cow's thirst should also be discarded. Milk of doe, camel, goat, buffalo and other one-hoof animals, yak and such a cow that was milked for the past ten days is also forbidden for use in Shraadh. Soil that is infested with insects, dry, baked with fire, stinking or collected from an unholy place should not be used. Similarly, such people who are violent, wretched, killers of Brahmins, impotent or have fiendish characters should not be involved in the Shraadh. Cocks and pigs should also be kept away from the place of Shraadh. This is the reason why sesame seeds are scattered at the site of Shraadh secretly. The host must not see a woman in menses. It is also not necessary to feed a host of Brahmins. Instead it is sufficient to feed only one meritorious Brahmin with complete devotion and respect. It is enough to appease the dead ancestors. Appeasement of ancestors automatically lead to appeasement of the deities, planets, Nakshatras and all whose blessings can transform the living condition of the person. ", "next": "7.6.3", "prev": "7.6.1", "title": "Dos and Don’t During a Shraadha"}