{"index": "7.6.3", "image": "resized_images/Auspicious Days and Months.png", "text": " Madalasa says- Shraadh can be performed on any day during the dark lunar phase in the Hindu month of Ashwin i.e. from the first day to the Amavasya. Performing of Shraadh on any of these days brings the following benefits- Performing Shraadh on the first day or Pratipada brings monetary gain. Shraadh performed on the second day brings prosperity, Shraadh performed on the third day blesses the performer with a boon. Performing Shraadh on the fourth day leads to the destruction of enemies. Performing Shraadh on the fifth day gives benefit from a woman; Shraadh performed on the sixth day helps a man to acquire respect in the society. Shraadh performed on the seventh day makes the performer an able leader; Shraadh performed on the eighth day enhances the intelligence. Shraadh performed on the ninth day brings the company of the attractive women. Shraadh performed on the tenth day leads to the fulfilment of all the desires. Performing Shraadh on the eleventh day helps him to attain the knowledge of Vedas. Shraadh performed on the twelfth day makes the performer victorious. Shraadh performed on the thirteenth day leads to long life and luxuries. Shraadh performed on the fourteenth day and Amavasya lead to the fulfilment of all the desires. Fruits of Shraadh performed during different Nakshatras: NAKSHATRA RESULT: KRITIKA Abode in heaven ROHINI Increase in progeny MRIGSHIRA Radiance ARDRA Bravery PUNARVASU Increase in land property PUSHYA Improvement in health ASHLESHA Sons MAGHA Help from relatives PURVAPHALGUNI Good fortune UTTARAPHALGUNI Increase in the virtues HASTA Increase in greatness CHITRA Beauty and handsome personality SWATI Increase in trade VISHAAKHA Increase in progeny and fulfilment of desires ANURADHA Respect JYESHTHA Dominance MOOLA Disease-free life PURVAASARHA Popularity UTTARASARHA Freedom from sorrows SHRAVAN Attainment of auspicious abode DHANISHTHA Immense wealth ABHIJIT Knowledge of Vedas ABHIJIT Knowledge of medical science SHATABHISHA Increase in animal wealth PURVABHADRAPAD Increase in knowledge and cattle UTTARABHADRAPAD Receiving of precious metals like gold and silver REVATI Receiving of horses ASHWINI Increase in average life BHARANI Prosperity and increase in comforts ", "next": "7.6.4", "prev": "7.6.2", "title": "Auspicious Days and Months"}