{"index": "7.7.8", "image": "resized_images/Description of Disastrous Traps.png", "text": [" Dattatreya says- A person who is unable to see the path of the deities, or the heavenly bodies like- Dhruv, Shukra (Venus), Soma (Moon), or his own shadow or Goddess Arundhati, must understand that his death is near.", " For those people to whom, the Sun appears without radiance but fire appears as the Sun, die within eleven months.", " Sighting of gold and silver in urine or stools signifies death within ten months.", " Those who see ghosts, Gandharvas and gold tree in the dreams live for nine months only.", " Those who become fat or thin suddenly live for eight months more.", " Those Yogis whose heels appear cracked while walking on sand or mud die within seven months.", " Getting perched on the body by volatile birds like vulture, pigeon, owl, crow etc.", " indicates that the concerned person will live for only six months.", " Those who see their shadow in opposite direction live for four or five months more only.", " Those who sight lightning without clouds or rainbow during the night time, in their dream live for two or three months more.", " Those who cannot see their reflection in ghee, oil, water and mirror die within a month.", " A person whose body smells like a cadaver die within fifteen days.", " Those whose hands and feet remain dry even after taking bath and dry even after taking light refreshments live only for ten days.", " Those who sight hair, cinders, ash, snakes and dried rivers in the dream, die on the eleventh day.", " Those who feel hungry even after eating to their fill also die soon.", " O king! There are many more disastrous symptoms that indicate death.", " A Yogi must always be alert regarding these signs.", " Whenever a Yogi perceives the appearance of all or some of these disastrous symptoms, he must at once take to Yoga to minimise the effects.", " Brahmagyan- A Yogi experiences extreme joy when he meditates while doing Yoga.", " Only then can he experience Brahma.", " Physical body is ephemeral;", " hence a true Yogi does not mourn over the loss of physical body.", " Hence, a Yogi must train his mind in Yoga ignoring sorrow or affection.", " This is indeed a difficult task to achieve.", " Alark says- O Brahmin! By your blessings, my ignorance has ended.", " Now I will do everything so that ignorance does not grip me once again.", " Then taking Dattatreya's permission, Alark went back to the king of Kashi and said- 'O king! You have a desire for the kingdom, so take this kingdom and enjoy its luxuries yourself or give it to Subahu.", "' The king of Kashi asked Alark as to why he was renouncing the kingdom without fighting a war.", " He also tried to instigate Alark by saying that his conduct did not suit the Kshatriyas.", " Alark said- 'Only Brahma is truth, all the other things are false.", " Now controlling my senses, I will attain perfection in Yoga.' "], "next": "7.7.9", "prev": "7.7.7", "title": "Description of Disastrous Traps"}