{"index": "7.7.9", "image": "resized_images/Alark Masters Yoga and Penance of Jada and his Father.png", "text": " Words of Alark pleased the king of Kashi.\n Even, Subahu got up gladly and after embracing Alark said to the king of Kashi- \"O king, I had taken your refuge to win the kingdom.\n Now, I have got it without fighting a war and without a drop of blood being shed.\n But, I am leaving now, renouncing everything.\n\" The king of Kashi said- \"Subahu, why had you taken refuge in me?\n What have you received now?\n\" Subahu said- \"O king! My younger brother Alark had been so far indulging in luxuries despite having metaphysical knowledge.\n He was in fact experiencing miseries in his household.\n When the miseries cross all limits, only then renunciation arises in the mind, as is the case with Alark.\n That was why I had taken your refuge.\n My job is finished now.\n So I am leaving to attain perfection in Yoga.\n O king, I regard those people who ignore their near and dear ones in their miseries as heartless.\n Such people are degraded from their position of Dharma, Arth, Kama and Moksha and are criticised everywhere.\n\" The king of Kashi said- \"O Subahu, You have salved your brother Alark.\n Now kindly salve me also.\n\" Subahu said- \"Attainment of Dharma, Arth, Kama and Moksha are the four major objectives for the attainment of which humans have been created.\n You have already attained Dharma, Artha and Kama.\n Only Moksha remains to be attained now.\n 'It is mine', 'It is me' etc.\n are expressions of ego.\n Guarding the self from these thoughts is the true knowledge.\n A man must know 'What is to be known?\n 'Who is to know?\n' and 'Who is he?\n' A knowledge of these automatically leads to the knowledge of all.\n\" Saying these words, Subahu left the palace.\n The king of Kashi too returned to his kingdom.\n Alark crowned his elder son as the new king and he began to practice Yoga in a forest.\n After many years of rigorous practice, Alark attained salvation and his abode in Brahma loka.\n The Brahmin's son said- \"O father! Now you too must take refuge in Yoga in order to attain Brahma.\n I too will try to attain salvation.\n\" The birds say- \"O Brahmin! Thus the father and son began their penance and attained salvation. ", "next": "7.8", "prev": "7.7.8", "title": "Alark Masters Yoga and Penance of Jada and his Father"}