{"index": "7.8.3", "image": "resized_images/Natural and Flawed Creations.png", "text": " Kraustuki asked curiously- 'Tell me how Brahma did his creations?' Markandeya replied- 'When Brahma got up from his sleep after the end of dissolution (Pralay) named Padrama, he found a void all around himself. He remembered Narayana who is also known by the name of Nastanu i.e. one who dwells in water. Narayana was engrossed in his eternal sleep. After waking up, he rescued the earth, submerged in the ocean just like he had done in the previous Kalpas by taking the forms of a boar, a fish and tortoise etc. But even after the earth was brought up from the seabed and was established above the ocean, it was still swinging like a boat. Narayana then created the mountains to stop the earth from swinging. But the mountains were burnt down by Agni (fire) named Samvartak. The mountains submerged into the ocean. The mountains after having displaced the water had become fixed at their respective places. Therefore, Narayana divided the whole earth into seven islands and created the four lokas just like before. After that, five Avidyas came into being. This way, the whole creation established themselves in five ways. The whole creation was hidden in darkness till this period. After this, Narayana created the ignorant animals, which symbolised the Tamo guna. After the animals the deities who symbolised the Satva guna were created.' 'Brahma was extremely satisfied by the creations of Narayana. But he was desirous of creating even more superior creatures. As a result a group of Sadhakas named Arvaksrota came into being. These Sadhakas were humans who possessed Rajo guna. The fifth creation of Anugraha was itself sub-divided into four parts- Viparyaya, Siddhi, Shanti and Shrishti. The sixth creation was of those special people who had the knowledge of past and present events. These people had wives, enjoyed life in a balanced way but were of evil nature. These people were known as Bhutadik.' 'The first creation was related with the manifestation of lord Brahma himself. This great creation was known as the Maha Shrishti. The second creation related with the part of Brahma is called Bhutsarga. The third creation is called Prakrit and which consists of creatures possessing intelligence and flawed sensual perceptions. The fourth creation consists of the Sthawars who are unable to move (e.g. Vegetation). The fifth creation consists of four-footed animals. The sixth creation consists of the deities whereas the seventh creation that of human beings which originates from Arvaksrota. The eighth creation is known as Anugraha. The ninth creation of Brahmaji is known as Prakrit (natural) and Vikari (flawed). These are the nine types of creation of Brahma. The root causes of this universe are Prakrit and Vikari.' ", "next": "7.8.4", "prev": "7.8.2", "title": "Natural and Flawed Creations"}