{"index": "7.8.1", "image": "resized_images/The Origin of the Universe.png", "text": " Jaimini thanked the birds for enlightening him with self-knowledge.\n But he was still not satisfied.\n There were many questions to which he had no answers.\n He asked the birds- 'How did this universe come into being?\n What will happen to it during the time of final annihilation?\n How did the deities, the sages, the ancestors and the living creatures originate?\n How did the Manvantaras arrive?\n I am anxious to know about all these things.\n' The birds replied- 'O Jaimini! We salute the same Jagannath who creates in the form of lord Brahma, nurtures the world as Lord Vishnu and ultimately annihilates the world as Lord Shiva in his most terrifying form.\n We will now reveal the knowledge which was once narrated by sage Markandeya.\n' The birds then narrated the following tale as was originally told by sage Markandeya.\n 'In the beginning of creation, as soon as lord Brahma manifested himself, all the four Vedas and eighteen Puranas came out from his four mouths.\n Lord Brahma then created the Saptarishis merely by wishing, who took all the Vedas and Puranas in their possession.\n' 'Later on, sage Chyavan got the Puranas from one of the Saptarishis- sage Bhrigu and read out its contents to the assembled sages.\n The sages then retold the Puranas to Daksha.\n Daksha narrated the contents of the Puranas to me (Markandeya).\n The virtues of listening to Puranas are capable of destroying all sins of a man.\n Now I am going to reveal to you that secret knowledge of Purana as was told to me by Daksha.\n' 'Brahma- the cause and effect of everything pervades the universe even after the final annihilation.\n All the three gunas are present in him.\n When the time is appropriate for commencing the process of creation, the whole atmosphere is covered by the great element (Mahatatva), which itself comprises of the three basic gunas- Satva (pure), Rajas (semi-pure) and Taamas (dark).\n' 'Ego manifests itself from the great element (Mahatatva).\n Even the ego remains covered by the great element.\n The ego then creates 'Shabda tanmatra' (subtle forms of matter related with sound).\n The sky which symbolizes the Shabda (sound) is created from this very Shabda tanmatra.\n' 'The ego then covers the whole sky.\n After that Sparsh tanmatra (subtle forms of matter related with touch) comes into being.\n Air, which signifies the quality of touch, then comes into being.\n After the creation of air, light is created without which the forms and appearance cannot be perceived.\n' 'The deformity of life results into the creation of Rasa matra.\n From this very Rasa matra, water comes into being.\n The water is enveloped by the Roop matra (subtle forms of appearance).\n The water then gets deformed and as a result Gandha matra comes into being, from which the earth is created.\n All the worlds are established in this earth.\n' 'First of all, the gunas enter into the atoms and create the seven basic elements which are a must for procreation.\n The seven basic elements then establish themselves in Purusha and Prakriti.\n The union of Purusha and Prakriti results into the creation of egg.\n This egg keeps expanding in its size while being in water.\n' 'Lord Brahma who is also known as Kshetragya and who is also the creator of all the souls dwells in that egg.\n' The same Brahma pervades all the three worlds.\n All the creatures of the world including the deities, demons and human beings along with islands, mountains, oceans, air and sky etc.\n are present inside the egg.\n' 'The Mother Nature along with the great element covers this egg.\n This way, the seven natural coverings envelop the egg.\n Beyond the Prakriti (nature) is established the Purusha (Almighty).\n' 'Now I am going to reveal the identity of Brahma to you.\n Just as drops of water fall down from the body of a wet man immersed in water, in the same way, Lord Brahma too discards off the egg in the end.\n The nature is nothing else but Kshetra (space, area) and Brahma is also known as Kshetragya.\n This way, the whole creation came into being just like lightning. ", "next": "7.8.2", "prev": "7.8", "title": "The Origin of the Universe"}