{"index": "7.8.6", "image": "resized_images/Daksha’s Lineage.png", "text": " Markandeya says- 'Brahma on seeing that inspite of all his creations the population was not increasing, he decided to create his Manasputras. These Manasputras were created merely by his wish. Their names were Bhrigu, Pulastya, Pulaha, Kratu, Angira, Marichi, Daksha, Atri and Vashishta. After this, he first created the ferocious Rudra and then Sankalpa and Dharma. But all these people were very virtuous, knowledgeable and unaffected by worldly desires. They showed their disinclination towards the purpose for which they have been created by Brahma i.e. increasing the population. Brahma became very furious in his anger and created an entity whose half portion resembled a man's body while the remaining half resembled that of a woman. Brahma instructed that entity to bisect his body into two distinct forms of a man and a woman. The entity followed Brahma's instruction and this way Swayambhu Manu and Shatrupa came into being. Manu accepted Shatrupa as his wife. Two sons were born to them- Priyavrata and Uttanpada. Apart from these two sons, two daughters were also born to them- Akuti and Prasuti. Prasuti was married to Daksha while Akuti was married to Ruchi. Twenty-four daughters were born to Daksha and Prasuti out of which thirteen of them were married to Dharma. The remaining eleven daughters were married to sages like Bhrigu, Mahadev, Marichi, Angira, Atri etc.' 'Dharma fathered Kama from Shraddha. Shri gave birth to Darpa, Dhriti and Niyama. Tushti gave birth to Santosh, Pushti to Lobha, Medha to Shrut, Kriya to Dand, Buddhi to Bodh, Lajja to Vinay, Vapra to Vyavasaay, Shanti to Kshema, Siddhi to Sukh and Kirti gave birth to Yash. Kama, the son of Dharma was the father of Atihrishta.' 'Himsa- the wife of Adharma gave birth to Anrita. Anrita was married to Nirriti. Two sons named Narak and Bhaya and two daughters named Maya and Vedana were born to them.' 'Maya gave birth to Mrityu, whereas Dukha was born as a result of Narak's marriage with Vedana. Five children were born to Mrityu- Vyadhi, Jara, Shoka, Trishna and Krodha. All of them were very irreligious by nature and they never got an opportunity get married and have progenies.' 'Mrityu's wife- Nirriti is also known by the name of Alakshmi. Altogether fourteen sons were born to them. All these fourteen sons of Mrityu dwell in the organs of human beings, during the time of destruction. Out of these fourteen sons, ten dwell in the sense organs of human beings and the eleventh son dwells in the mind. They influence the sense organs and the mind of a man in a negative way by means of attachment and anger. The twelfth son exists in the form of arrogance. The thirteenth son- Apar adversely affects the intelligence of a man. The fourteenth son- Duhsah resides in the house of males. Duhsah is naked, always hungry, his mouth facing downwards and caws like the crow. ", "next": "7.8.7", "prev": "7.8.5", "title": "Daksha’s Lineage"}