{"index": "7.8.4", "image": "resized_images/Creation of the Deities.png", "text": [" Kraustuki then asked Markandeya about the origin of the deities.", " Markandeya replied- 'With the objective of creating the deities, demons, ancestors and human beings, Brahma abandoned the part of his physical body in the ocean.", " The demons originated from the thighs of his abandoned body.", " Lord Brahma blessed the demons with physical bodies, which were Taamasik in nature.", " This part of Brahma's body became famous as Ratri (night).", " After that Brahma created the deities from his mouth with the help of Satva guna.", " The deities were given pure bodies.", " This part of Brahma's body which was Saatvik (pure) in nature became famous as day.", "' 'After this, Brahma acquired another physical body and created the ancestors.", " After creating the ancestors, he abandoned his body, which transformed itself in the evening.", " Brahmaji then acquired another body, which was affluent of Rajas qualities and thus was created human being.", " He again abandoned his body and from it was created Jyotsna- the transition period of day and night.", "' 'Jyotsna, evening and day contain the quality of Satva in themselves.", " Night has the quality of Taamas in itself.", " The deities, demons and human beings are most powerful during the day, night and Jyotsna period respectively.", " The ancestors are most powerful and invincible during the evening time.", "' 'Brahma then created creatures who had moustaches and beard on their face.", " Some creatures among them started attacking the others.", " Those who were being attacked and pleaded 'save us' were called the Rakshasas (demons).", " The attackers who thundered 'we would devour you up' were known as Yakshas (celestial beings).", " 'Brahma was very displeased by their tantrums.", " Some of his hair fell down on earth and thus were created the snakes.", " The flesh-eating Ganas were next to be created.", " These Ganas were extremely volatile in nature.", " After that, Brahma created the Gandharvas.", "' 'This way after having created these eight types of divine creation, Brahma created all the animals and birds from his body.", " He created the goat from his mouth, lamb from his heart, cow from his stomach and back, animals like horse, elephant, donkey, rabbit, deer, camel and mule were created by Brahma from both his legs.", " Variety of vegetation and medicinal plants were created from the hair of his body.", "' 'Brahma then created the following things from the first of his four mouths- Gayatri, Tri- rik, tri- vrit, Saam, Rathantar and Agnishtom.", " From his mouth facing south, he created Yajuh, Traishtumchhand, Panchadasha-stom, Vrihatsaam and Uktha.", " From his mouth facing west, he created Shaam, Jagatichhand, Panchadasha-stom, Vairoop and Atiraatra.", " From his mouth facing north, he created twenty-one Atharva, Aaptoryaam, Aanushtubha and Vairaaj.", "' 'In the beginning of Kalpa, Brahma created the natural things like lightning, Vajra, cloud, rainbow and birds.", " After that he created the deities etc.", " He then created stable things like mountains, living creatures that could move, demons, birds, animals and snakes etc.", " All these living creatures take birth and re-births, reap the fruits of the past Karmas done in their previous life.", " This is the way Brahma had done creation at the end of the dissolution period.' "], "next": "7.8.5", "prev": "7.8.3", "title": "Creation of the Deities"}