{"index": "7.8.8", "image": "resized_images/The Creation of Rudras.png", "text": " Markandeya says- 'Now I am going to tell you about Rudrasarga.\n One of the eight sons of Brahma started wailing after being created from his (Brahma) body.\n Brahma asked him as to why he was crying.\n The crying child requested Brahma to give him a name.\n Brahma named him as Rudra since he was wailing at the time of his birth.\n But even after getting his name, the child's wailing did not stop.\n He wailed for seven times and as a result seven more children were manifested from his cries.\n Brahma named these seven children as Bhava, Sharva, Ishaan, Pashupati, Bheem, Ugra and Mahadev.\n He also gave them abodes so that they could live.\n The following eight things respectively symbolize the forms of all these eight rudras- Sun, water, earth, fire, air, sky, Dikshit Brahmin and Soma.\n All these eight rudras were also given their respective wives who were Suvarchala, Uma, Vikeshi, Swadha, Swaha, Dik, Diksha and Rohini.\n' 'The eight sons of all the eight rudras are Shanaishwar, Shukra, Lohitaang, Manojav, Skand, Sarg, Santaan and Buddh respectively.\n' 'Rudra had accepted Sati as his wife.\n Sati gave up her life because her father Daksha had shown disrespect to her husband- Rudra.\n Sati took her second birth as Parvati, the daughter of Himavaan.\n Mainak was her brother.\n Bhava married Parvati.\n Khyaati was Bhrigu's wife.\n They had two children- Dhata and Vidhaata.\n Lakshmi was the consort of Narayana.\n Meru had two daughters- Aayati and Niyati.\n Both of them were married to Dhata and Vidhaata respectively.\n Each one of them had two sons.\n Aayati had named her son as Pran while Niyati named her son as Mrikandu.\n The same Mrikandu is my (Markandeya) father.\n My mother's name is Manaswini and my son's name is Vedashira.\n' 'Sambhuti- the wife of Marichi gave birth to Paurnmaas.\n Smriti- the wife of Marichi gave birth to four daughters- Siniwali, Kuhu, Raka and Anumati.\n' 'Ansuya, the wife of sage Atri gave birth to three sons- Soma, Durvaasa and Dattatreya.\n Dutt and Dambholi were born to Preeti, the wife of Pulastya.\n He became famous as Agastya during the time of Swayambhuva Manavantar.\n' 'Three sons- Kardam, Arvaveera and Sahishnu were born to Kshama, the wife of Pulaha.\n Sannati, the wife of Ritu gave birth to 60,000 Balkhilyaganas.\n Urja- the wife of Vashishta gave birth to seven sons- Raja, Gatra, Urdhwabahu, Sabal, Anagh, Sutapa and Shukra.\n These seven are famous as the Saptarishis.\n' 'Agni was married to Swaha.\n Three sons were born to them- Paavak, Pavaman and Shuchi.' ", "next": "7.9", "prev": "7.8.7", "title": "The Creation of Rudras"}