{"index": "7.8.2", "image": "resized_images/Lord Brahma’s Life Span.png", "text": [" Kraustuki said- 'Tell me! O lord! How were the living beings created as the period of final annihilation was approaching its end.", "' Markandeya replied- 'When the nature establishes herself in the soul of the Purusha (supreme Almighty), all the created matter gets annihilated.", " Prakriti and Purusha are established in the mode of parallelism.", " During that period, Satva and Tama become neutrally balanced.", " Even the quality of Rajas establishes itself within the qualities of Satva and Tama.", "' 'The life span of Brahma consists of Dwiparardha.", " The day and night of Brahma are of equal duration.", " Brahma is the origin of this universe.", " He is the inconceivable soul- the supreme lord and the cause of all the events.", " He is beyond the reach of activities.", " He enters into Prakriti and Purusha- excites both of them to get unified.", " When Prakriti gets excited, the Supreme Lord manifests Himself in the egg as Brahma.", " He then commences his creation.", " The same Brahma attains the form of Vishnu due to the effect of his Satva guna and nurtures the whole creation.", " Under the influence of Tamo guna, He attains the form of Rudra and finally annihilates the whole creation.", " He then goes into hibernation.", "' 'This way, the same Almighty God in his three different forms of Brahma, Vishnu and Mahesh performs his duties of creation, nurturing and annihilation respectively.", " The life span of Brahma consists of one hundred years.", " The division of time is as follows- One Kashtha consists of fifteen Nimeshas.", " One Kala consists of thirty Kashthas whereas thirty Kalas make one Muhurta.", " One day and night of this material world consists of thirty Muhurtas.", " Thirty days and nights are equivalent to one month or two fortnights (Pakshas).", "' 'Six months make one Ayan.", " Two Ayans make a year.", " A day and night of the deities are equivalent to one year of this material world.", " Similarly twelve thousand years of the deities make the four Yugas.", " Satya Yuga consists of the four thousand years of the deities.", " Treta Yuga consists of three thousand years of the deities.", " Dwapar Yuga consists of two thousand years of the deities whereas Kali Yuga consists of one thousand years of the deities.", " Similarly Sandhya (evening) period of Satya Yuga consists of four hundred years and Sandhyansh (part of evening) consists of the same period that is four hundred years.", " Thus the total number of years that Satya Yuga has come up to 4000+400+400= 4800 years.", " In the same way, the Sandhya and Sandhyansh of Treta Yuga consist of 300 years each.", " Thus, the total number of years in Treta Yuga comes up to 3000+300+300= 3600 years.", " Sandhya and Sandhyansh period of Dwapar Yuga is of 200 years each.", " Thus the total number of years in Dwapar Yuga comes up to 2000+200+200= 2400 years.", " Sandhya and Sandhyansh period of Kali Yuga are of 100 years each.", " Thus the total number of years in Kali Yuga comes up to 1000+100+100= 1200 years.", " A day of Brahma consists of thousand times of the twelve thousand years of the deities.", " Fourteen Manus appear in succession during the whole day of Brahma.", " Each Manavantar comprises of a Manu and his progenies, Indra and the other deities, Saptarishis ganas and Nripati ganas etc.", " A Manavantar consists of seventy-one Chatur Yugas.", " On the basis of the years of this material world, a Manavantar consists of 30,67,20,000 years or 8,52,000 years of the deities.", " A Brahma's day consists of 4,29,40,00,000 years of this world or 1,19,28,000 years of the deities.", " The dissolution, which occurs at the end of the day of Brahma, is also known as causal dissolution (Naimittik Pralay).", " During the time of causal dissolution, all the residents of Bhur, Bhuva and Swarga lokas temporarily go to Mahar loka.", " The residents of Mahar loka shift their base to Jana loka.", " The entire universe is submerged in the ocean during the time of causal dissolution and this is the time for Brahma to take rest i.", "e.", " at night.", " Brahma starts his creation at the end of the night.", " This way, after the completion of three hundred and sixty years of Brahma, his one-year is complete.", " One hundred such years of Brahma make one Para and five hundred such years make one Parardha.", " One Parardha of Brahma has already passed at the end of which Padrama Mahakalpa occurred.", " The present period, which falls under the second Parardha, is also known as Varaha Kalpa. "], "next": "7.8.3", "prev": "7.8.1", "title": "Lord Brahma’s Life Span"}