{"index": "7.9.8", "image": "resized_images/The Sages of Saavarnik Manavantar.png", "text": " This Section contains 13 sub-sections. Kraustuki says- 'O revered sage! You have already enlightened me by revealing the names of seven different Manus of each Manavantar. You have also told me about the deities, the kings and the sages who existed during each Manavantar. Now, I am curious to know about the seven Manus, the deities and the sages of this Kalpa.' Markandeya says- 'Saavarni, the son of Sangya's shadow would be the eighth Manu. The Saptarishis of Saavarni Manavantar would be Rama, Vyasa, Gaalav, Diptimaan, Krip, Rishyashring and Drauni (Ashwatthama). The three main categories of deities existing during this Manavantar would be Sutapa, Amitabh and Mukhya. Each of them is the master of 20 Ganas. Among these, the Ganas- Prabhakar, Prabhas, Dathita, Dharma, Tejah, Rashmi and Vakratu come under the authority of the deity, Sutapa. Similarly, the deity Amitabh is the master of the Ganas like Prabhu, Vibhu and Vibhaas etc. The deity Mukhya is the lord of Ganas like Dama, Daant, Rit, Soma and Vint. All of them are the offspring of sage Kashyap. They will become famous as the deities of Saavarni Manavantar. Bali, the son of Virochan would hold the post of Indra during this Manavantar. Virja, Arvaveera, Nirmoha, Satyavaak, Kriti and Vishnu will be the sons of Saavarni Manu.' 7.9.8.1 Killing of Madhu Kaitabha Markandeya says- 'King Surath was the descendant of Chaitra. He was defeated in the battle against King Kolvidhvansi. All his wealth was deceitfully taken over by his cunning ministers. King Surath fled to the forest to save his life where he met a sage named Medha. He stayed with him at his hermitage but after a while, the thought of his lost kingdom began to torment him. One day, while he was roaming near the hermitage, he met a Vaishya named Samadhi. Samadhi narrated his woeful story as to how his sons had driven him out of his home after taking all his wealth. But inspite of this, his love for them remained intact. Both Surath and Samadhi went to sage Medha and told him that- 'Inspite of our miserable condition, we are unable to understand why we still have affection and love for our near and dear ones even though they have cheated us.' Sage Medha replied- 'O king! Due to the illusions of this world, human beings are deeply influenced by attachments. So, there is nothing to be amazed. Goddess Mahamaaya influences the mind of each human being. She does not spare even the most learned one. When she becomes pleased, she bestows liberation.' The king asked- 'Who is this Mahamaaya? Please tell us about her.' Sage Medha then told them about Mahamaaya- 'O king! Goddess Mahamaaya is beyond the reach of origin and destruction. When the whole earth was submerged in water at the end of the Kalpa, Lord Vishnu took refuge of Yoganidra. While He was sleeping, two demons, Madhu and Kaitabh manifested from the wax of his ears. The demons wanted to attack Brahma. Lord Brahma got scared and sought help from Goddess Nidra. She manifested from the body of Lord Vishnu and appeared before Lord Brahma. Lord Vishnu woke up from his sleep. He saw that the demons were trying to kill Lord Brahma. He fought with both the demons for 5,000 years. Goddess Mahamaaya influenced the demons' minds as a result of which, they asked some boons from Lord Vishnu. Lord Vishnu granted the boons to them and said- 'Both of you will get killed by me.' The demons said- 'We are ready to get killed on the condition that you kill us only in such a place where there is no water.' As the whole earth was submerged in water, so the demons thought that Lord Vishnu would not be able to get a base to kill them. But Lord Vishnu severed their heads after making them sit on His thighs. 7.9.8.2 The Destruction of Mahishasura’s Army Markandeya says- 'During ancient times, the deities and the demons fought a fierce battle which lasted for a hundred years. The deities were defeated in this battle. Mahishasura drove out the deities from heaven and ascended the throne of Indra. The defeated deities went to seek the help of Lord Brahma, Vishnu and Mahadev. They narrated their woeful tale to all the three deities. Brahma, Vishnu and Mahadev became furious at the demons' cruelty. A powerful effulgence appeared from the mouth of Brahma, Vishnu and Mahadev. Similar effulgence appeared from the bodies of all the deities. The super effulgence was created from the unison of all these effulgence and a Goddess manifested from it. The deities were very pleased. All the deities presented their weapons to the Goddess. After this, they hailed her name in a loud voice by chanting- 'Victory be to her.' The Goddess laughed loudly. Her laughter shook the whole earth violently. When Mahishasura heard her laughter, he proceeded towards her accompanied by a huge army. When he reached there, he was amazed at the appearance of the goddess. He attacked her with his army, which boasted of mighty warriors like Chaamar, Chikshur, Udagra, Asilom, Mahaahanu, Vaashkal, Parivaarit, Vidaal and Kaal. These demons had dangerous weapons like Tomar, Shakti, axe, mace etc. One by one, the Goddess destroyed all the demons' weapons and launched an attack on them. The deep exhalations made during the battle resulted into the creation of numerous Ganas. These Ganas joined the Goddess in the battle. Ultimately, the Goddess succeeded in killing all the demons. The battlefield was covered by demons' corpses as well as carcasses of elephants and horses. The deities were pleased by the outcome of this battle. 7.9.8.3 The Deities Eulogize Goddess Bhagwati Markandeya says- 'After the killing of Mahishasura, all the deities including Indra eulogised Goddess Bhagwati and said- 'We make salutations to her who has manifested herself as a result of the unison of the powers of all the deities, one who is revered by all the deities and the sages. May she bless us. We make salutations to that Goddess whose powers are indescribable even by Lord Brahma, Vishnu and Mahesh. O goddess! Please nurture the whole world with your love and care. We find ourselves incapable of describing your grandeur and magnificence.' Goddess Bhagwati became very pleased with their devotion and asked them to demand any boon. But the deities replied- 'O goddess! By killing Mahishasura, you have already fulfilled our aspirations. If you really want to bless us, then please appear before us at the time of our need. The goddess blessed them by saying- 'So be it'. Markandeya says- 'Now, I am going to tell you how Goddess Bhagwati protected the deities by killing the demons- Shumbh and Nishumbh.' 7.9.8.4 Goddess Parvati and Shumbh’s Messenger Markandeya says- 'During ancient times, the demons- Shumbh and Nishumbh had captured all the three worlds after defeating the deities. The deities went to Goddess Parvati and eulogised her by saying- 'O goddess! You had promised us that you would come to our help at the time of our need. The time has arrived.' As the deities were busy eulogising Goddess Parvati, she was preparing to go for her bath. She came near the deities and asked them as to who were they eulogising. Suddenly, a divine entity manifested from her body and answered on behalf of the deities- 'These deities are eulogising me.' This divine entity was none other than Goddess Shivaa. As Shivaa had manifested from the cell (Koshika) of Parvati's body, she was also known as Kaushiki. Kaushiki possessed divine beauty. The demons, Chand and Mund happened to see her. Both of them went to Shumbh and described to him about Kaushiki's beauty. Shumbh wanted to marry her. He sent a messenger named Sugreev to Kaushiki to inform her about his intentions. Sugreev went to Kaushiki and said- 'You are so beautiful. You are fit to marry a mighty demon king like Shumbh who rules over all the three worlds.' The goddess laughed and said- 'O messenger! I am ready to marry Shumbh or Nishumbh because I know they are very powerful but there is one problem. As I have taken a vow that I would marry only such a person who defeats me in a battle.' The messenger replied- 'O beautiful lady! How can you fight the mighty Shumbh who has defeated even the deities and who is the master of all the three worlds?' Sugreev made persistent requests but the goddess refused to go along with him. She instructed him to inform Shumbh and Nishumbh about her vow. 7.9.8.5 Killing of Dhumralochan Markandeya says- 'Sugreev went back to Shumbh and narrated the whole story. Shumbh became very furious and instructed Dhumralochan to bring her by force. Dhumralochan went to Goddess Bhagwati accompanied by 60,000 demons. Initially, he requested her to come along with him. He also threatened to take her forcibly if she did not accept her proposal. Goddess Bhagwati refused to go along with him. Dhumralochan angrily ran towards her. The Goddess made a loud roar as a result of which, Dhumralochan's body was reduced to ashes. After his death, Dhumralochan's army attacked Goddess Bhagwati. The mount of the Goddess- Simha killed all the demons. When Shumbh got the news of Dhumralochan's death, his anger knew no bounds. He instructed Chand and Mund to go and bring Goddess Bhagwati after capturing her. 7.9.8.6 Killing of Chand and Mund Chand and Mund proceeded with a huge army. At that time, Goddess Bhagwati had positioned herself at the peak of Himachal Mountain. She was mounted on the back of Simha and was smiling sweetly. Chand and Mund tried to enslave her but suddenly, Goddess Kali appeared from her mouth and ferociously attacked the demons. She devoured some of them and killed the rest. After seeing his huge army vanquished, Chand angrily ran towards Goddess Kali. Mund attacked her with a range of arrows, which infuriated Goddess Kali and she pulled Chand by his hair and severed his head by a sword. Seeing him fall to the ground, Mund ran towards Goddess Kali but even he was killed. The rest of the army retreated. After killing Chand and Mund, Goddess Kali told Goddess Bhagwati- 'I have done my duty. I have killed Chand and Mund. Now you should do the same by killing Shumbh and Nishumbh.' Goddess Bhagwati replied- 'Since you have killed the demons, Chand and Mund from now onwards, you will also become famous as Chandika.' 7.9.8.7 Killing of Raktabeej Markandeya says- 'When Shumbh got the news of Chand and Mund' s death, he became very furious. He proceeded to fight Goddess Bhagwati accompanied by numerous mighty warriors like Udayudh, Kambu, Kotiveerya, Dhumravanshajaat, Kaalak, Kaalkeya etc. When Goddess Chandika saw them coming, she made a loud sound by pulling the bowstring. The demons came near and surrounded Goddess Chandika and Goddess Bhagwati from all the sides. Lord Brahma, Lord Shiva and Lord Vishnu became anxious. They created divine entities with the help of effulgence emanating from their bodies. These divine entities resembled Goddess Chandika. They instructed these divine entities to kill all the demons. Goddess Chandika requested Lord Shiva to approach Shumbh and Nishumbh as her messenger and inform him that they should either take refuge in the Paatal loka or be ready to die. Lord Mahadev went to the place where Katyayani was fighting the demons. The demons attacked her with different weapons but Chandika gave them a befitting reply. Unable to face the assault of the goddesses, the demons started fleeing. Seeing this, Raktabeej came forward to fight. Raktabeej was blessed with a boon that was if a single drop of his blood fell on the ground, this drop would create another form of his. This way, in a very short time, thousands of Raktabeejas covered the battlefield. The deities became afraid. Seeing the frightened deities, Bhagwati said to Kali- 'O Chamunda! Open your mouth and drink each drop of blood coming out from the injuries of Raktabeej.' After saying this, Goddess Bhagwati attacked Raktabeej with her trident. Goddess Kali drank all the blood coming out from his wound. At last, Raktabeej was killed. The deities were pleased. Goddess Kali started to dance with ferocity due to the intoxication caused by drinking of the blood. 7.9.8.8 Killing of Nishumbh Markandeya says- 'When Shumbh and Nishumbh heard about Raktabeej's death, they were infuriated. Nishumbh attacked the goddess with a huge army. Shumbh attacked from the other side. In the fierce battle, Goddess Bhagwati broke the sword as well as the shield of Nishumbh. Nishumbh then attacked Goddess Bhagwati with his weapon- Shakti. Goddess Bhagwati broke it with her Chakra. At last, she attacked him with her arrows at him and as a result, Nishumbh got injured and fell. ' When Shumbh saw Nishumbh, injured and unconscious, he ran towards Goddess Bhagwati to kill her. Goddess Bhagwati blew her conch and made a thunderous noise by pulling the bowstring. Shumbh released the dangerous weapon- Ugradipti in the direction of Goddess Bhagwati. But her weapon Maholkanaamni destroyed it. Shumbh thundered loudly and attacked Goddess Bhagwati with a volley of arrows but none could cause any harm to her. Finally, Goddess Bhagwati attacked Shumbh with her trident. Shumbh fell down unconscious. After sometime, he regained his consciousness and attacked Goddess Bhagwati with his arrows. But she destroyed all the arrows. In the meantime, Nishumbh had regained his consciousness. He got up and attacked Goddess Bhagwati with his trident. In the end, Goddess Bhagwati killed Nishumbh by piercing her trident in his heart. As Nishumbh was dying, an another demon manifested from his body. Even he was killed by her. Her mount Simha devoured all the dead demons. 7.9.8.9 Killing of Shumbh Markandeya says- 'Shumbh became angry at the death of his brother- Nishumbh. He furiously told the goddess- 'O wicked lady! Do not be proud of your strength borrowed from others.' Goddess Bhagwati replied- 'O wicked demon! I am the only power of this whole universe. I am the origin of cause and effect. Look! All the divinities are entering into my body.' The next moment, all the divine entities, which had earlier manifested from the bodies of the deities united with the goddess. Now, the goddess was alone. A tremendous battle was fought between Goddess Bhagwati and Shumbh. Ambika attacked him with numerous divine weapons. But, Shumbh neutralised her attack with his own weapons. Shumbh covered the whole body of Goddess Bhagwati with his arrows. She broke his bow. After this, Shumbh attacked her with his weapon named Shakti, which was broken into pieces by her Chakra. Now, Shumbh took out his sword and attacked her with it. She broke his shield and sword with her arrows. Shumbh then attacked her with his mace. Even his mace was broken into pieces. Shumbh had no more weapons left with him. He attacked the goddess on her breast with his clenched fist. She slapped him on his face because of which he fell down. The next moment, he got up and manifested himself in the sky. Now, a tremendous duel was fought between them in the sky. In the end, she dashed him on the ground and pierced the trident in his heart. Shumbh was instantly killed. After the killing of Shumbh, all the deities became pleased. The Gandharvas and the deities rejoiced. The Apsaras danced. The whole atmosphere echoed with the sound- 'SHANTI SHANTI' (Let there be peace). 7.9.8.10 Devi Stotra Markandeya says- After goddess Bhagwati had killed Shumbh, all the deities under the leadership of Indra and Agni started eulogising her- 'O Goddess! Be pleased up on us! Protect the whole world, as you are the goddess of this whole universe. You appear in the form of this earth- the base on which everything is situated. Your light illuminates all the living creatures. You are the only power through which creation, nurturing and annihilation takes place. You are the Brahmani, Maheshwari and the Kaumari. We salute you because you have protected us from the terror of the demons. We need your protection from all the calamities of this world.' Goddess Bhagwati was extremely pleased by their eulogy. She asked them for any wish. The deities said- 'O Akhileshwari! We need your protection. Clear all the obstacles from our path. Eliminate our enemies.' Goddess Bhagwati replied- 'During Vaivasvat Manavantar, I will take incarnation from Yashoda's womb- the wife of Nand, to kill the demons Shumbh and Nishumbh. After that, I will kill the demon- Vaiprachit in my most aggressive form. One hundred years later, I will manifest myself and would be known as Satakshi because of my hundred eyes. My next incarnation would be known as Shakambhari because I would nurture the whole world during the period of drought. I will kill the demon Durgam during that drought period. I will kill the demon Arun- the tormentor of all the three worlds by appearing in the form of a bee. Due to this, I will be known as Bhramari. I will take incarnations every time the demons torment the world. 7.9.8.11 Goddess Bhagwati Blesses the Deities Goddess Bhagwati says- I will clear all the obstacles from the path of such a man who worships me. A devotee who listens to the great tales of how I killed Mahishasura, Shumbh and Nishumbh, on the eighth, ninth and fourteenth days of any month, would be liberated from all sins and poverty. He would become free from fear. A devotee must listen to my divine tales during all the religious ceremonies like making sacrifice, worship and performing Yagya. By doing this, all his enemies will be eliminated. A man who remembers me when faced with dangerous situation remains protected by me.' After blessing the deities, Goddess Bhagwati disappeared from their sight. All the demons, which had survived after the killings of Shumbh and Nishumbh, went to the nether world to save their lives. 7.9.8.12 Goddess Bhagwati Blesses Surath and the Vaishya The sage says- 'O king! I have described in detail about the greatness of Goddess Bhagwati who is the creator of this universe. She is the one who bestows the knowledge of self to us. She is the Maya (illusion) by whom the whole world is influenced. You must take her refuge. You can achieve all the pleasures of this world, heaven, as well as liberation.' King Surath and the Vaishya went to do their penance. While doing their penance, they chanted the mantras of Devi Sukta. They made an earthen idol of Bhagwati and worshipped it by offering flowers, Dhup etc. They did an austere penance for three years implying various modes of worship. Sometimes, they observed fast, the other time, they offered their own blood to please Goddess Bhagwati. At last, the goddess was pleased and appeared before them. She said- 'I am pleased with both of you. I will fulfil whatever you wish.' King Surath sought her blessings in regaining his kingdom from the clutches of his enemies. He also requested her to bless him with an undivided kingdom in his next life. The Vaishya requested her to make him free from all kinds of attachments. Goddess Bhagwati said- 'O king! Very soon, you will be able to regain your whole kingdom from your enemies. In your next birth, you would be born as Saavarni Manu, the son of Surya. You will also attain self-knowledge and become free from all kinds of attachments.' After blessing both of them, Goddess Bhagwati disappeared. 7.9.8.13 Savarna Manavantar Markandeya says- 'O great sage! Now I am going to tell you about the Manavantar of Saavarn, which will be the ninth Manavantar. Saavarn was the son of Daksha. During this Manavantar, there will be three prominent groups (Ganas) of deities. Each group would comprise of twelve deities. During this Manavantar, Indra would be known as Adbhut. The names of the Saptarishis of this Manavantar would be Medhatithi, Vasu, Satya, Jyotishmaan, Dyutimaan, Sabal and Hatyavaahan. Saavarn will have eight sons- Dhrishtketu, Barhaketu, Panchahasta, Niraamay, Prithushravah, Achishmaan, Bhuridruymna and Bhrihadmay.' The tenth Manavantar will be named after the tenth Manasputra of Lord Brahma. During this Manavantar, the names of two prominent groups of deities will be Sukhasin and Niruddha. The total population during this Manavantar will be hundred people. The total number of deities during this Manavantar will also be of the same number. The name of Indra during this tenth Manavantar would be Shanti and the names of the Saptarishis during this tenth Manavantar would be Aapomurti, Havishmaan, Sukrit, Satya, Naabhaag, Apratim and Vashishta. The tenth Manu would have ten sons- Sukshetra, Uttamoja, Bhurishen, Veeryavaan, Shataanik, Vrishabh, Anmitra, Jayadrath, Bhuridruymna and Suparva. The eleventh Manavantar will be named after Saavarn, the son of Dharma. During this Manavantar, there will be three prominent groups of deities- Vihangam, Kaamag and Nirmaanpati. Each group would comprise of 30 deities. Indra would be known by the name of Vrishakhya. The name of the Saptarishis of this Manavantar would be Havishmaan, Varishtha, Nischar, Anagh, Vishti, Agnidev etc. The eleventh Manu would have six sons- Sarvatrag, Susharma, Devaneek, Purudwaha, Hemdhanva and Dhridhayu. The twelfth Manavantar will be named after Saavarn, the son of Rudra. The names of the five prominent groups of deities of this Manavantar will be Sudharma, Sumana, Harit, Rohit and Suvarn. Each group will comprise of ten deities. During this Manavantar, Indra would be known by the name of Kratadhaama. The names of the Saptarishis during this Manavantar would be Dyuti, Tapasvi, Sutava, Tapomurti, Taponidhi, Taporati and Tapodhiti. The Manu of this Manavantar would have six sons- Devavaan, Upadev, Devashrestha, Vidurath, Mitravaan and Mitravinda. Rauchya would be the Manu during the thirteen Manavantar. Three prominent groups of deities would be Sudharma, Sukarma and Susharma. During this Manavantar, Indra would be known by the name of Divaspati. The name of the Saptarishis of this Manavantar will be Dhritimaan, Avyay, Tatvadarshi, Nirutsuk, Nirmoha, Sutapa and Nishkamp. During this Manavantar, Manu would have eight sons- Chitrasen, Vichitra, Niyati, Nirbhay, Dhridh, Sunetra, Kshatrabuddhi and Suvrat. ", "next": "7.9.9", "prev": "7.9.7", "title": "The Sages of Saavarnik Manavantar"}