{"index": "7.9.4", "image": "resized_images/Tamas Manavantar.png", "text": " Markandeya says- 'There used to live a king named Swarashtra. The deity Surya had blessed him with a long life. The king had one hundred wives, but they were not as lucky as he was as far as enjoying a long life was concerned. One by one, all of them died. A king from the neighbouring state named Vimard defeated him in a battle. After being defeated, Swarashtra went at the bank of river Vitastaa and started doing penance. One day, it rained heavily and the king was swept by the ferocious current. The drowning king saw a doe and held her tail to save his life. The doe told the king that she was aware about the lust of the king. She also told her that her pregnancy was causing hindrance in making love. The king was amazed. He asked as to how she could speak like a human being despite of being an animal. The doe replied that she was his most beloved queen Mahishi in her previous life. She had killed a pair of deer while they were making love. The doe had died but the deer survived. He had cursed her to become a doe in her next life. The deer also revealed to the queen that she would give birth to the mighty Lola. The same Lola would later on become famous as Manu after defeating his father's enemies. The king was very pleased at this. In due course of time, the doe gave birth to a son after which she went to the heaven. The sages named the son Taamas. When Taamas became young, he did penance to please Surya. Surya gave him many weapons by the help of which Taamas was able to defeat all his enemies. He brought all the enemies in front of his father but Swarashtra forgave everybody. He gave his kingdom to Taamas. Markandeya says- 'Taamas ruled over the whole earth. Four types of deities were famous during this Manavantar- Satya Gana, Sudhi Gana, Surup Gana and Hari Gana. Indra was known as Shikhi during this Manavantar. The names of these Saptarishis who lived during this Manavantar were Jyotirdharma, Prithu, Kaavya, Chaitra, Agni, Balak and Peevar. The sons of Taamas Manu were very mighty. Their names were Nar, Kshanti, Shant, Daant, Jahnu and Jangha etc. ", "next": "7.9.5", "prev": "7.9.3", "title": "Tamas Manavantar"}