{"index": "7.9.7", "image": "resized_images/Vaivasvat Manavantar.png", "text": " The Birth of Ashwini Kumars and Revant: Markandeya says- 'The Manu of Vaivasvat Manavantar was famously known as Vaivasvat as he was the son of Vivasvaan (Surya). Surya was married to Sangya- the daughter of Vishwakarma. Although, she had borne two sons (Vaivasvat and Yama) and a daughter (Yami) from Surya, yet the radiance of Surya was too much for her to bear. So, one day, she created a shadow identity of herself and requested it to act as if she was the real Sangya. She said to the shadow- 'As long as your identity remains unknown, I would not reveal myself.' After this Sangya went back to her father's home and ultimately to Uttarkuru where she started doing penance in the guise of a mare. Surya on the other hand was not aware of Sangya's doings. In due course of time, the shadow of Sangya gave birth to many children. Though she loved her own children, she never had the same attitude towards the three sons of Sangya. Seeing her discriminatory attitude, Yama tried to kick her with his leg. The shadow of Sangya became furious. She cursed Yama's leg to get severed from his body. Yama became very scared. He went to his father Surya accompanied by Vaivasvat and Yami. He told Surya- 'A mother can never curse her own child. So, this woman is certainly not our mother because she has cursed me.' Surya called the shadow of Sangya and asked about her true identity but Sangya's shadow kept mum. Seeing her quiet, Surya became very angry and he held her by her hair and was just about to curse her when, out of fear, she revealed the whole story. Surya went to the place of his father-in-law, Vishwakarma and asked about Sangya. Vishwakarma feigned ignorance. He said- 'She did come but she had returned to your place after staying here for a while.' Vishwakarma knew the reason why Sangya had abandoned her husband. So, he subdued the radiance of Surya. ", "next": "7.9.8", "prev": "7.9.6", "title": "Vaivasvat Manavantar"}