{"index": "7.9.10", "image": "resized_images/The Beginning of Bhautya Manavantar.png", "text": " This Section contains 1 sub-section. Markandeya says- 'Now I am going to tell you about the origin of Bhautya Manavantar. Sage Angira had a disciple named Bhuti. He was short tempered in nature and used to curse anybody at the earliest opportunity. Everybody including the deities like Indra, Vayu, Surya etc. were scared of him. Nobody went against his wishes and followed his commands.' Bhuti had no children and commenced a rigorous penance to achieve one. But still, his aspiration remained unfulfilled. He decided to quit doing penance. His brother named Suvarcha invited him to the Yagya he was performing. Bhuti left the hermitage after entrusting his disciple- Shanti to look after its affairs. Shanti tried his best to perform his duties according to the instructions of his teacher- Bhuti. Yet, one day, the sacrificial fire got extinguished somehow. Shanti became scared at the prospect of facing his preceptor's wrath. He was certain of being cursed by Bhuti. Finding no other option, he went to Agni named Jaativeda and sought his help. He tried to please him by chanting Agni Stotra. He eulogised Agni in many ways. He said- 'O Agni! The first of all creations, I need your blessings. Without you, the Yagya cannot be performed. All the Vedas are full of praise for you. The deities as well as the demons try to pacify you by making offerings to you.' The deity Agni became extremely pleased by Shanti's eulogy and appeared before him. He asked Shanti to express his desire. Shanti requested Agni to re- ignite the sacrificial fire, which had gone off, so that he does not have to face the wrath of his Guru. He then requested Agni to bless his Guru with a son having all the good qualities. Agni was very much pleased by Shanti's devotion towards his Guru. He said- 'Your Guru Bhuti would have a son named Bhautya after whom the Manavantar would be named.' After blessing him, Agni disappeared. Shanti returned to his hermitage and was very pleased to see the sacrificial fire burning. In the meantime, his Guru Bhuti arrived. His Guru was very pleased with the sincerity of Shanti with which he performed his duties in his absence. Bhuti said- 'O son! I don't understand the reason why my heart is overwhelmed with love. Love is alien to my nature. If you are cognisant of the reason, please tell me.' Then Shanti narrated the whole story. Bhuti was very pleased by his devotion. He taught all the Vedas to Shanti. In course of time, Bhautya was born to him. He was the Manu of the Bhautya Manavantar. During this Manavantar, there would be five prominent groups of deities- Chaakshush, Kanishth, Pavitra, Bhrajir and Dharavrit. During this Manavantar, Indra would be known as Shuchi. The names of the Saptarishis would be Agnigh, Agnibaahu, Suchi, Mukt, Maadhav, Shukra and Ajit. Bhautya Manu would have ten sons- Guh, Gambhir, Brahna, Bharat, Anugraha, Shrimaani, Prateer, Vishnu, Sankraman and Subal. A man who listens to the tales of all the fourteen Manvantaras is not only blessed but becomes liberated from all his sins. 7.9.10.1 Birth of Martandadev Lord Brahma had created Daksha from the thumb of his right hand. Daksha's wife was created from the thumb of Brahma's left hand. Daksha had a daughter named Aditi. Maartandadev was the son of Aditi and his father was Kashyap. Kraustuki asked- 'O lord! Tell me the reason why Vivasvaan Surya took birth as the son of Kashyap.' Markandeya says- 'During the initial phase of creation, when nothing existed, except a large egg. Lord Brahma manifested inside that egg. Subsequently, he came out from that egg. At that time, a loud sound of OM came out from his mouth. From this sound of Omkar, were created Bhur, Bhuvah and in the end Swah. These three mystic words are the forms of Surya. After that, three more mystic words were created- Mahah, Jan and Tapah, each of the former word being grosser than the latter one. In the end, the word Satya was created, which was the grossest of all. These seven mystic words related with the Omkar illustrate the gross and the subtle forms of Vivasvaan. ", "next": "7.10", "prev": "7.9.9", "title": "The Beginning of Bhautya Manavantar"}