{"index": "7.9.2", "image": "resized_images/The Beginning of Swarochish Manavantar.png", "text": [" This Section contains 6 sub-sections.", " Conversation between the Brahmin and Varudhini:", " Kraustuki asked Markandeya- 'O great sage! Now tell me something about Swarochish Manavantar?", "' Markandeya replied- 'Once upon a time, there lived a Brahmin at the bank of river Varuna.", " One day, a guest arrived at his place.", " The Brahmin treated his guest with due respect.", " After formal introduction, the Brahmin became aware that his guest was not an ordinary person.", " He had travelled around the world with the help of some special mantras he knew and medicinal herbs, which he had in his possession.", " The Brahmin was quite impressed.", " He too wanted to see the whole earth.", " He requested his guest to give the mantra and the medicinal herb so that he could travel around the world just like him.", " The guest applied some medicinal solution on his legs.", " After this the Brahmin went to see the Himalaya Mountain.", " While wandering there, the solution, which had been applied on his legs, got washed away.", " As a result, he now became immobile.", " He started looking all around himself.", " He found numerous Apsaras entertaining the Kinnars, Gandharvas and deities.", " The Brahmin was very much pleased to see the happy atmosphere prevailing all around Himalaya.", " He thought of going back to his place but was unsuccessful, as the medicinal solution had been washed.", " He became very sad.", " An Apsara by the name of Varudhini saw him in a miserable condition.", " She became infatuated by him.", " When she went near him, he asked- 'Who are you?", " Who is your husband?", " What are you doing here?", "' After this, he narrated his own story and said- 'I had come from Aruna nagar to see the Himalaya.", " But I am unable to return home as the medicinal solution, which was applied on my legs has been washed.", " Varudhini told the Brahmin that she was an Apsara.", " She also expressed her deep love towards the Brahmin.", " She requested the Brahmin to stay there and not to go back home.", " She assured him if he did, as per her instructions then he would enjoy an eternal youth.", " He would never become old.", " Varudhini forcibly tried to embrace the Brahmin.", " This made the Brahmin very angry.", " He said- 'Varudhini! The sacred scriptures prohibit a Brahmin from indulging in sensual pleasures because it gives sorrow not only in this world but also after his death.", "' But Varudhini was not satisfied by his answers.", " She threatened to give up her life if the Brahmin did not marry her.", " The Brahmin did not agree.", " The Brahmin purified himself by performing Aachaman and began worshipping Agni.", " He said- 'O Agni! You are the root cause of all Karmas.", " The deities bless us with rain only after you are pleased.", " O Agni! I need your blessings.", " I want to go back home.", "' 7.", "9.", "2.", "1 Varudhini’s Modesty Breached Markandeya says- 'Agni became pleased by the Brahmin's devotion.", " Agni entered into his body.", " The Brahmin's body illuminated due to Agni's radiance.", " When Varudhini saw this, she was fascinated by the Brahmin's appearance.", " The Brahmin proceeded towards his home.", " Feeling helpless, Varudhini cursed her fate.", "' Varudhini had once insulted a Gandharva named Kali sometime in the past.", " Chancing upon the opportunity, Kali went to Varudhini take his revenge.", " He had disguised himself as a Brahmin.", " When she saw him, she said- 'I need your protection if you heed to my request then you will certainly attain virtuosity.", " Kali did not want her to know about his real identity, so he replied- 'If you really want my protection, then you must have your eyes closed while having copulation.", "' Varudhini agreed.", " 7.", "9.", "2.", "2 His Marriage with Manorama In due course of time, Varudhini became pregnant.", " She gave birth to a child who was named Swarochi.", " The child was extra-ordinary.", " In a very short time, he became proficient in all the scriptures.", " One day, young Swarochi saw a terrified girl near the Mandaar Mountain.", " When the girl saw Swarochi, she pleaded for help.", " Swarochi assured her and asked about her identity.", " She said- 'My name is Manorama.", " Once I had made fun of a sage who was doing penance near the Kailash Mountain.", " At that time, two of my companions- Vibhaavari and Kalavati were also present with me.", " The sage cursed all three of us.", " Vibhaavari and Kalavati got inflicted with leprosy and tuberculosis due to his curse.", " Even I was not spared.", " I am being chased by a ferocious demon since then.", " I need your protection from that demon.", " I am giving you this very powerful weapon with which you can successfully kill the demon.", "' Swarochi took the weapon.", " During the conversation between Swarochi and Manorama, a demon arrived just then.", " The demon wanted to devour Manorama.", " Swarochi was confused, as he did not want the sage's curse to go futile.", " He allowed the demon to get hold of Manorama, who then started wailing.", " Hearing her wail, Swarochi thought of killing the demon.", " Becoming afraid, the demon released Manorama from his clutches and pleaded Swarochi to spare his life.", " He then narrated his own story.", " He said- 'You have rescued me from sage Brahmamitra's curse.", " Actually, my name is Indivaraaksha.", " I had requested Brahmamitra to teach him the nuances of Ayurveda, which he refused.", " I decided to learn Ayurveda while sage Brahmamitra taught his disciples by hiding myself.", " One day, the sage came to know of this.", " He cursed me to become a demon.", " I begged for his forgiveness.", " He said- 'Whatever I have said will definitely come true.", " You will certainly become a demon.", " After becoming a demon, you will try to devour your own daughter but would regain your original form of Gandharva due to the touch of Astraanal weapon with which you would be attacked.", " O great soul! Since you have liberated me from the curse, therefore, I hand over this girl to you.", " Accept her as your wife.", " I will also bestow the knowledge of Ayurveda, which I had learnt from sage Brahmamitra.", "' Manorama requested Swarochi to cure her companions from the diseases they were suffering from.", " Swarochi assured Manorama that he would certainly cure her companions with the help of Ayurveda, which the demon had taught him.", " Both Swarochi and Manorama got married.", " Swarochi then went to her companions and cured them from their diseases.", " 7.", "9.", "2.", "3 Swarochi’s Other Marriages Markandeya says- 'After getting cured from their respective diseases, both the companions of Manorama expressed their gratitude to Swarochi.", " Swarochi married both Vibhaavari as well as Kalavati.", " To show her gratitude, Vibhaavari taught Swarochi, a special art that helped him to understand the language of all the living creatures.", " Kalavati on the other hand while narrating her tale, said- 'A demon named Ali had asked my hand in marriage from my father but my father refused.", " The demon got angry and killed my father.", " I wanted to commit suicide but Sati;", " the wife of Shambhu prevented me from doing so by saying- ' You would be fortunate to become a wife of great soul Swarochi.", "' 7.", "9.", "2.", "4 Swarochi’s Reproachment Markandeya says- After getting married, Swarochi started living happily along with all his three wives at Malaya Mountain.", " One day, impressed by the mutual love, Swarochi and his wives had for each other, a female ruddy goose told another one- 'Very rarely are found such couples who have love for each other.", "' But the other female ruddy goose did not agree.", " She replied- 'You are wrong.", " Swarochi is not a blessed man.", " Actually, he deceives all of his three wives.", " Even his love for all the three wives is varied.", " When one wife is desirous of his love, he embraces the other wife.", " So where is the question of having mutual love for one another?", " In comparison, my husband and I are blessed because we have mutual love and respect for each other.", "' Swarochi, who was listening to their conversation, realised how true the ruddy goose was.", " But still, he did not change his ways and continued to live with his wives for 100 years.", " One day while wandering, Swarochi saw a deer surrounded by a herd of doe.", " One of the doe on having a desire to copulate with the deer started sniffing him in anticipation.", " But the deer became angry and said- 'Do you think I am as shameless as Swarochi?", " A man, who is sought by numerous beauties, his condition becomes laughable.", " Not only does the daily routine of such a man gets disturbed, but also his behaviour is never fair towards his wives.", "' 7.", "9.", "2.", "5 The Origin of Swarochish Manu Markandeya says- 'Swarochi became very sad after hearing the deer's utterances.", " He realised how lowly and mean he had become.", " He decided to renounce life after abandoning his wives.", " But this did not happen because as soon as he met them, he forgot everything about renunciation.", " He continued to live with his wives.", " In due course of time, Swarochi begot three sons- Vijay, Merunand and Prabhaav.", " Swarochi ordered the construction of three cities for his sons, which he donated to each of them.", " The city situated towards the east was given to Vijay while the city situated towards the north named Nandvati was given to Merunand.", " The city named Taal, which was situated in the south, was given to Prabhaav.", " Swarochi then lived happily with his wives.", " One day, Swarochi had gone for hunting.", " He saw a wild boar and adjusted his arrow on the bowstring to kill it.", " Just then, a doe arrived and requested him to kill her instead of killing that boar.", " She said- 'Kill me with your arrow so that I get liberated from my sorrows.", " I don't want to live because I have become infatuated with such a 'person' whose heart lies somewhere else.", " My aspirations remain unfulfilled.", " So death is my only refuge.", "' Swarochi was very much amazed.", " He asked- 'Who is that fellow?", "' The doe replied- 'It is nobody than you.", "' Swarochi was puzzled, 'How can this be?", " I am a man whereas you are an animal.", "' The doe then requested Swarochi to embrace her, which Swarochi agreed to do.", " As soon as Swarochi embraced that doe, she got transformed into a beautiful lady.", " Swarochi was very much astonished but the doe said that- 'Don't get puzzled.", " I am the presiding deity of this forest.", " I have come to seek your help on the request of the deities.", " It is your duty to help me in giving birth to a son named Manu.", " Swarochi married her and in course of time, she gave birth to a son.", " The whole atmosphere became joyous and happy at the birth of that child.", " Gandharvas started singing songs and the Apsaras danced.", " The deities showered flowers from heaven.", " The child was so radiant that all the four directions became illuminated by his brilliance.", " Swarochi named this child as Dyutimaan.", " This child was later on also known as Swarochish, the son of Swarochi.", " One day, while wandering, Swarochi saw a swan who was telling his wife- 'Now, we have become old, so what is the use of remaining attached to each other.", " Its time, we must seriously start thinking of renouncing life.", "' But his wife said- 'This world is meant for enjoying sensual pleasures.", " Even the Brahmins perform Yagyas with that purpose in their mind.", " All the virtuous people indulge in virtuous activities with the sole desire of experiencing the pleasures of life.", " How come the idea of renunciation has entered your mind?", "' The swan replied- 'One who is not attracted towards sensual pleasures is totally devoted to God.", " One who is attached by worldly matters can never reach God.", " Have you not seen the state of Swarochi?", " How can he be liberated from the sorrows of the world if he is not even willing to shun the attachments?", " I am not like Swarochi.", " I know that after enjoying a fully satisfied life, this is the time to renounce everything.", "' After hearing this, Swarochi was very much ashamed of himself.", " He decided to do penance.", " His wives also accompanied him.", " All of them ultimately went to heaven by the virtue of their penance.", " 7.", "9.", "2.", "6 Swarochish Manavantar Markandeya says- 'During this Swarochish Manavantar, Indra was famously known as Vipaschit.", " The other deities were known as Paaraavat and Tushit.", " The names of the Saptarishis who lived during this Manavantar were Urja, Stamb, Pran, Dutt, Ali, Rishabh, Nischar and Arvaveera.", " Swarochish Manu had seven sons who were very mighty and brave.", " Chaitra and Kimpurush were two of them.", " The descendants of Swarochish ruled the earth till the end of this Manavantar.", " Kraustuki asked- 'O lord! Tell me about the treasures of this world.", "' Markandeya replied- 'Goddess Lakshmi is the presiding deity of learning (Vidya) called Padmini.", " After getting perfection in this Vidya, a man becomes the master of eight types of treasures- Padma, Mahapadma, Makar, Kacchupp, Mukunda, Nandak, Neel and Shankh.", " The treasure called Padma is pure in nature.", " A man who becomes the master of this treasure mainly deals in things like gold and silver etc.", " Not only he, but also his descendants derive benefits from this particular treasure.", " A person who is the master of Mahapadma deals in things like pearls, corals etc.", " This particular treasure does not abandon a man till his seventh generation.", " The treasure called Makar is Taamasik in nature.", " A man who is the master of this particular treasure is basically Taamasik by nature.", " Such a man has mastery in handling over various weapons like swords, bows and arrows etc.", " This particular wealth remains with a man only for one generation.", " The treasure called Kacchupp is also Taamasik in nature.", " A master of this particular treasure enjoys all the pleasure of this world and he does not trust any person easily.", " This treasure also remains with a man only for one generation.", " The treasure called Mukunda comprises of Rajas quality.", " A master of this treasure becomes proficient in four types of musical instruments like Veena, Venu, Mridang etc.", " Such a man earns lot of money by exhibiting his art.", " The treasure called Nandak is a combination of Rajas and Taamas qualities.", " A man who gets influences by this treasure becomes immobile.", " Such a man deals in things like metals, jewels, cereals etc.", " The master of this treasure is very benevolent and kind hearted.", " This particular treasure remains with a man till the seventh generation.", " The treasure called Neel is also a combination of Rajas and Satva qualities.", " A master of this treasure deals in things like clothes, cotton, pearls, fruits, flowers and things made from wood.", " This particular treasure remains with a man till three generations.", " A possessor of this treasure is a great social worker and constructs bridge, ponds etc.", " The treasure called Shankh comprises of Rajas and Taamas qualities.", " Only one person can master this particular treasure. Such a man enjoys good food and is fond of wearing expensive clothes. Normally, this type of man does not give shelter to other people and is constantly thinking of his own betterment. ' "], "next": "7.9.3", "prev": "7.9.1", "title": "The Beginning of Swarochish Manavantar"}