{"index": "7.9.3", "image": "resized_images/Auttam Manavantar Begins.png", "text": [" This Section contains 5 sub-sections:", " 7.", "9.", "3.", "1 King Uttam Abandons his Wife Kraustuki says- 'O lord! Now tell me about the Auttam Manavantar.", "' Markandeya replied- 'Uttanpada and Suruchi had a son named Uttam.", " Uttam was married to Bahula.", " Bahula did not love Uttam and always showed disrespect towards him.", " One day, while both of them were sitting in the court, watching the proceedings, Uttam offered a betel leaf to Bahula which she refused, King Uttam felt dishonoured.", " He ordered his attendant to abandon the queen in the forest.", " Bahula too was very happy, thinking that now she will not have to be in the company of Uttam.", " This way, Bahula was taken to the forest.", " One day, a sad Brahmin came to Uttam and said- 'O king! Somebody has abducted my wife.", " I need your help in finding out my lost wife.", " Uttam asked the Brahmin about the nature, physical construction and about the age of his wife.", " The Brahmin revealed all the facts related with his wife.", " The king was not impressed.", " The facts, which the Brahmin had furnished, went to prove that his wife was not a chaste lady.", " The king expressed his view about his wife in so many words.", " He said- 'What is the use of having such a wicked wife?", " Forget about her.", " I will give you another one with all the good qualities.", "' The Brahmin replied- 'O king! It is one's duty to protect one's wife no matter how wicked she may be.", " By protecting your wife, your children also get protected.", " A man who does not protect his wife, has a son of hybrid class.", " His ancestors are degraded from the heaven because of such type of sons.", " I am not able to perform my religious obligations because of the absence of my wife.", " O king! Please help me.", "' While searching the Brahmin's wife, King Uttam saw a sage at a secluded place.", " When the sage saw King Uttam, he wanted to offer some Ardhya (some type of offering) to him, which his disciples prohibited him from doing.", " Then, the sage changed his mind and offered his seat to the king.", " The king asked about the reason why he changed his mind of offering the Ardhya.", " The sage replied- 'Though you are the descendant of Swayambhu Manu, but since you have committed a grave sin by abandoning your wife, I decided that you are not fit to be offered the Ardhya.", " No matter how mean your wife is, it is your duty to protect her at all costs.", "' King Uttam was very ashamed of himself.", " He asked the sage about the whereabouts of the Brahmin's wife.", " The sage replied- 'His wife has been abducted by the demon, Balaak- the son of Adri.", " He has kept her in the forest called Utpalaavat.", " Go and help the Brahmin to meet his wife so that he doesn't commit a grave sin like you.", " 7.", "9.", "3.", "2 Brahmin’s Wife Returns Home Markandeya says- 'When King Uttam reached Utpalaavat forest, he saw a woman eating a Shriphal fruit.", " The king asked that woman whether she was the wife of that Brahmin- Susharma.", " The woman replied in the affirmative and said- 'The demon abducted me while I was sleeping.", " Since that day, he has kept me here.", " I am very afraid of that demon.", "' The king then asked the woman about the demon's whereabouts.", " The woman pointed towards the direction of the demon's path.", " The king went in that direction.", " When the demon saw the king approaching him, he bowed down in reverence and said- 'O king! What can I do for you?", "' The king asked- 'Why have you abducted the wife of this Brahmin.", "' The demon replied- 'I am not the demon who devours human beings.", " I devour their 'flaws'.", " I have many beautiful wives.", " So where is the need of aspiring for another woman?", " Actually, the Brahmin is a very learned man and has mastered the mantras.", " By chanting Rakshodna mantras during oblations, he has increased my hunger by making incantations.", " Therefore, I have abducted his wife to prevent him from accomplishing any Yagya.", "' The king became very sad.", " He thought- 'What a grave sin I have committed by abandoning my wife! Earlier, that sage too did not find me fit for giving Ardhya.", " Now, this demon is also aware of the importance of one's wife in religious ceremonies.", " How cruel I have been to my wife.", "' The demon told the king- 'O king! What should I do for you?", "' The king replied- 'Devour the flaws of this woman so that she becomes humble.", " After that, carry her back home.", " The demon acted as per the instructions of King Uttam.", " As a result, the Brahmin's wife became very humble.", " She said to the king- 'It seems, there is no fault of this demon.", " Perhaps, I must have caused separation between a husband and wife, in my previous life and for that very reason, I was forced to suffer this separation with my husband in this present life.", " The demon said- 'O king! What else do you want from me?", " The king said- 'You must be present before me whenever I remember you.", "' The demon agreed.", " He carried the Brahmin's wife to her home.", " 7.", "9.", "3.", "3 The Sage and King Uttam Markandeya says- 'King Uttam wondered as to what should he do to get liberated from the sins of abandoning his wife.", " He requested the sage to help him in this regard.", " The sage informed the king that his wife was living at Ranatal.", " The king of the serpents- Kapotak is looking after her.", " Kapotak has a daughter named Nanda.", " Being concerned about her mother's future, Nanda had hidden your wife.", " The sage became very furious and cursed her.", " As a result, she became dumb.", " Uttam, your wife was always a chaste woman.", " It was only due to evil influences of the planets that she was not paying adequate attention to you.", " Now, you should go and take her back to your home.", " Uttam returned back to his palace.", "' 7.", "9.", "3.", "4 The Birth of Auttam Manu Markandeya says- 'Uttam met the Brahmin and told him that now as he had reunited with his wife, it was now his turn to help him (king) to re-unite with his wife.", " The Brahmin assured Uttam that he would perform a Yagya named Mitravinda, which would help him to achieve his goal.", " He requested Uttam to bring his wife so that the Yagya could be performed.", " Uttam remembered Nisachar, a demon and requested him to bring his wife.", " Nisachar went to Pataal loka and brought his wife.", " The queen was very happy to see her husband once again.", " She requested him to cure Nanda who had become dumb for no fault of hers.", " Saraswat Japa was chanted to cure Nanda.", " When Nanda regained her voice, she came to the oblation site and after embracing the queen, blessed her by saying that she would become a proud mother of a very famous son named Manu.", " After that, she went back to Pataal loka.", " In due course of time, the queen gave birth to a son who was named Auttam by the sages.", " ' 7.", "9.", "3.", "5 Auttam Manavantar Markandeya says- 'O sage! The following Ganas who reigned during Auttam Manavantar are very famous.", " They are the first Gana- Swadhama.", " The second Gana- Satya was related with the deities.", " The third Gana was Shiva, the fourth was named Pratardan and the fifth Gana was Vashvarti.", " Each of the Ganas are the master of twelve deities.", " Indra by the name of Sushaanti rules all the three worlds by the virtue of accomplishing one hundred Ashwamedha Yagyas.", " He along with Shiva and Satya etc.", " bestows peace to the world.", " The descendants of Auttam ruled the whole earth for the full period of Auttam Manavantar.", " The Saptarishis during this Auttam Manavantar were the sons of sage Mahatapa.", " The description of this third Manavantar is now complete. Now I am going to tell you about the fourth Manavantar, which is also known as Taamas Manavantar. ' "], "next": "7.9.4", "prev": "7.9.2", "title": "Auttam Manavantar Begins"}