{"index": "7.9.5", "image": "resized_images/Raivat Manavantar.png", "text": " Markandeya says- 'Now I am going to tell you about Raivat Manu.\n His father was Ritvaak.\n Raivat was born in Revati Nakshatra.\n Later on, he became infamous for his loose character.\n His father was very worried about him.\n Ritvaak asked sage Garg as to how such a mean child had been born to him.\n Sage Garg replied- 'The negative qualities of your son is due to his birth in Revati Nakshatra.\n Ritvaak became very furious with Revati Nakshatra and cursed it as a result of which, Revati Nakshatra fell down on Kumud Mountain.\n All the four directions became illuminated and a reservoir was created.\n A girl manifested from that reservoir.\n A sage named Pramuchi brought that girl to his hermitage and named her as Revati.\n When the girl became young, the sage was very worried about her marriage.\n One day, Hutaashan revealed to him that she would get married to Durgam, the eldest son of Swayambhu Manu.\n One day Durgam arrived at Pramuchi's hermitage.\n He saw Revati and asked her- 'O beautiful lady! Can you tell me where sage Pramuchi is?\n I have come here to pay my obeisance to him.\n At that time, sage Pramuchi was busy performing his Yagya.\n Hearing his voice, he came out.\n Seeing Durgam at his hermitage, he instructed his disciple, Gautam to bring Ardhya for him.\n The sage said- 'Durgam is not only a king but also my son-in-law.\n' Durgam was very surprised at what sage Pramuchi had said.\n He asked sage Pramuchi as to how could he be his son-in-law and who was his wife?\n The sage replied- 'Your wife is none other than the girl whom you met sometime earlier.\n Her name is Revati.\n Then the sage narrated the whole story how sage Garg had prophesised about Revati's marriage with Durgam.\n' Durgam started contemplating on this peculiar situation.\n Sage Pramuchi started to make arrangements for the marriage.\n When Revati saw the arrangements being made for her marriage, she requested him to get her married in Revati Nakshatra.\n Sage Pramuchi revealed to her that this particular Nakshatra did not exist in the sky any more.\n Revati then requested him to establish this Nakshatra in the sky.\n Sage Pramuchi re-established Revati Nakshatra in the sky by the help of his divine powers.\n Thus, Revati and Durgam got married.\n After getting married, Durgam requested the sage to bless him with a mighty son.\n Sage Pramuchi blessed him.\n After sometime, Revati gave birth to Raivat Manu.\n Raivat Manu was proficient in all the scriptures.\n The chief Ganas of Raivat Manavantar were Sumedha, Bhupati, Vaikunth and Amitabhaichar.\n There were fourteen deities present in each of the Ganas.\n The presiding deity of these deities was Indra by the name of Vibhu.\n The Saptarishis present during this Manavantar were Hiranyaroma, Vedshri, Urdhvabaahu, Vedbaahu, Sudhaama, Mahamuni, Paryanya and Vashishta.\n Raivat Manu had four sons- Balabandhu, Mahaveerya, Suyastanya and Satyak. ", "next": "7.9.6", "prev": "7.9.4", "title": "Raivat Manavantar"}