{"index": "7.9.1", "image": "resized_images/Swayambhuva Manavantar.png", "text": [" This Section contains 6 sub-sections.", " Markandeya says- 'Swayambhuva Manu had ten sons.", " He had divided the whole earth into seven continents.", " In the beginning of Treta Yuga, the sons of Priyavrata had done the same.", " Prajavati- the daughter of Kardam Prajapati had ten sons and two daughters from Priyavrata.", " Names of these ten sons were- Agnighna, Medhatithi, Vayushmaan, Jyotishmaan, Dyutimaan, Bhatya, Savan, Medha, Agnibaahu and Mitra.", " Among all these ten sons, the last three never ruled any kingdom.", " The remaining seven sons were made the rulers of all the seven continents by Priyavrata.", " Agnighna was made the ruler of Jambudweep, Medhatithi that of Plakshdweep.", " Vayushmaan was given Shaalmalidweep whereas Jyotishmaan was made the ruler of Kushdweep.", " Similarly, Dyutimaan was given Kraunchdweep to rule while Bhatya was given Shaakdweep.", " The seventh son, Savan was made the ruler of Pushkardweep.", " Savan had two sons- Medhaavi and Dhaataki.", " Savan sub-divided the Pushkardweep into two parts and each part was given to each of the sons.", " Bhatya had seven sons- Jalad, Kumar, Sukumar, Marnaavak, Kushottar, Medhaavi and Mahadrum.", " Bhatya too sub- divided the Shaakdweep into seven parts and distributed them among all his sons.", " Similarly, Dyutimaan too had seven sons to whom were distributed his kingdom Kraunchdweep after sub-dividing it into seven parts.", " Jyotishmaan, Vayushmaan and Medhatithi made their respective sons the rulers after giving them kingdoms.", " Agnighna was the ruler of Jambudweep.", " He had nine sons.", " His kingdom was equally distributed among all of them.", " Naabhi- the son of Agnighna was the father of Rishabh.", " Bharat was the son of Rishabh.", " Bharat was given the southern part of Rishabh's kingdom.", " Our country is named after Bharat.", "' 7.", "9.", "1.", "1 Jambudveep Markandeya says that the total area of Jambudweep comprises of one lakh Yojan while the area of Plakshdweep is twice the area of Jambudweep i.", "e.", " two lakh Yojans.", " Similarly, Shaalmali is twice the area of Plaksh while Kusha is twice the area of Shaalmali.", " The area of Kraunchdweep is twice the area of Kushdweep whereas the area of Shaakdweep is twice the area of Kraunchdweep.", " The island of Pushkar is twice the area of Shaak.", " Seven mountains are situated in all these seven islands.", " They are Himavaan, Hemkut, Rishabh, Meru, Neel, Shwet and Shringi.", " Ilavrit is situated in the middle of six mountains, which themselves are situated in the middle of the ocean surrounding all the seven islands named earlier.", " Sumeru Mountain is situated in the central part of Ilavrit.", " People belonging to all the four castes- Brahmin, Kshatriya, Vaishya and Shudra reside in Ilavrit.", " Just above Ilavrit are the dwelling places of Lokpals like Indra etc.", " Lord Brahma's assembly is situated at the center.", " Beneath Ilavrit are situated the four mountains- Mandaar, Gandhmaadan, Vipul and Supaarshva.", " These four mountains are situated in each of the four directions.", " The Great Mountain Nishadh is situated towards the west of Meru, while the Great Mountain Pariyatra is situated just behind it.", " Towards the south of Meru are situated the great mountains, Kailash and Himavaan.", " The mountains Shringvaan and Jaarudhi are situated towards the north of Meru Mountain.", " River Jambu flows all around the Meru Mountain in a circular path.", " 7.", "9.", "1.", "2 The Origin of the Ganga Markandeya says- 'River Ganga originates from a place named Dhruvaadhar.", " This particular place is related with Narayana.", " River Ganga, then falls on the Sumeru Mountain and gets distributed into four main streams.", " One of these streams flows towards Chaitrartha forest.", " The name of this particular stream is Sita.", " The same Sita Ganga enters into the Varunoda reservoir and from there, it moves towards the ocean and again changes its course to get submerge into that stream of Ganga, which has fallen on the Gandhmaadan Mountain and which is known as Alaknanda.", " Alaknanda after submerging into Mansarovar subsequently entered the Mahadri Himalaya where Lord Shankar held her in His locks of hair.", " He released river Ganga only at the request of sage Bhagirath.", " After being released, river Ganga got sub-divided into seven streams and ultimately, all those seven streams submerged into the ocean.", " The stream of Ganga which originates from the west of Sumeru Mountain is known as Suchakshu.", " This stream gets submerged in the ocean towards the south, after passing through many mountains.", " The fourth stream reaches Savita forest after passing through two mountains- Suparshu and Meru.", " This particular stream is famously known as Bhadrasoma.", " Bhadrasoma Ganga ultimately get submerged into the ocean after passing through mountains like Shankhkoot and Vrishabh etc.", " 7.", "9.", "1.", "3 A Description of Bharat-Varsha Kraustuki asked Markandeya- 'O lord! Please describe about Bharatvarsha.", "' Markandeya replied- 'Bharatvarsha is surrounded by oceans on all its three sides.", " People living towards the east of Bharatvarsha are known as Kiraat while people living towards the west are called Yavan.", " The central part of Bharatvarsha is inhabited by all the four castes- Brahmin, Kshatriya, Vaishya and Shudra.", " The seven mountains are situated in the central part of Bharatvarsha.", " They are Mahendra, Malaya, Sahaya, Shaktimaan, Riksh, Vindhya and Pariyatra.", " There are thousands of hills situated in the vicinity of these seven mountains.", " The central part of Bharatvarsha is sub-divided into Janpadas.", " The residents of these Janpadas are known as Mlechha and Arya.", " All the major rivers of Bharatvarsha like Ganga, Saraswati, Sindhu, Chandrabhaaga, Yamuna, Shatadru, Vitastaa, Irawati, Gomti, Vipaasha and Gandki etc.", " originate from the mountains situated in the central parts.", " The names of the prominent Janpadas situated in the central part of Bharatvarsha are Matsya, Ashwakoot, Kulya, Kuntal, Kashi, Koshal, Arbuda, Kalinga, Malak, Vrik etc.", " River Godavari flows towards the north of Sahya Mountain.", " A city named Govardhan is situated near this mountain.", " Some other prominent places situated in the vicinity of this mountain are Bahalik, Vaataghaan, Aamir and Kaaltoyak.", " Kshatriya, Vaishya and Shudras live in the following states- Shudra, Pahalav, Charmakhandika, Gandhaar, Yavan, Sindhu, Sauveer, Bhadrak, Shatadruj, Paarad and Kekaya.", " The following states are situated in the north of Bharatvarsha- Taamas, Hansmarg, Kashmir, Shulik, Kuhak, Urna, Darva etc.", " States like Abhrarak, Mudgarak, Antagiri, Plawang, Mal, Daamal, Vartik, Uttarbrahma, Praagjyotish, Madra, Videha, Tamraliptak, Malla and Magadh are situated in the east of Bharatvarsha.", " States situated in the south of Bharatvarsha are Paandya, Kerala, Chola, Maharashtra, Maahishik, Kalinga and Aamir.", " These are the Janpadas where Shabar live.", "' 'Janpadas situated in the west of Bharatvarsha are Suryarak, Kaalibala, Durg, Kaha, Pulind, Toshal and Koshal etc.", " Bharatvarsha is the only country in the whole world where all the four Yugas- Satya, Treta, Dwapar, and Kali occur in a cyclic way.", " Bharatvarsha is the root of all forms of divinity where deities reside and almighty God takes incarnation.", "' 7.", "9.", "1.", "4 Tortoise Incarnation Kraustuki asked Markandeya- 'O lord! How does Shri Hari live in the form of a tortoise?", "' Markandeya replied- 'Shri Hari in the form of a tortoise sits facing east.", " States situated in the central portion of his body are Vedi, Madra, Maandavya, Shaalva, Khaasa, Saraswat, Matsya etc.", " States which are situated in the mouth of the tortoise are Vrishadhwaj, Anjan, Kasha, Magadh, Praagjyotish, Mithila, Koshal etc.", " In the right foot of the tortoise are situated states like Kalinga, Banga etc.", " Vindhya Mountain is also situated in the right foot.", " States which are situated in the tail of the tortoise are Manimegha, Kshuradri, Khanj, Konkan, Panchmad, Vaman, Sharkar, Chulik, Ashwakesha etc.", " Mandakya, Chandarwar, Ashwa, Kaland, Ghor, Ghuratwadi are the states that are situated in the left foot of the tortoise.", " Janpadas like Kailash, Himalaya, Kraunch, Kaikaya, Takshashila, Gandhar, Kharas, Yaudheya and Rajanya etc.", " are situated in the left side of the tortoise's abdomen.", "' Narayana in the form of tortoise is that inconceivable soul in which reside all the lords of deities and constellations.", " 7.", "9.", "1.", "5 The Descriptions of Bhadrashva Markandeya says- 'Bhadraashva Varsh is situated towards the east of the great mountain Devakut.", " Five more mountains are situated within its area- Kauranj, Shwetaparna, Neela, Shaiwaal and Parnashaalagra.", " Bhadraashva consists of thousands of Janpadas.", " Numerous rivers like Sita, Shankhavali, Bhadra and Chakravarta flows there.", " People living in Bhadraashva Varsh are full of radiance and they live for 1000 years.", " Narayana dwells in Bhadraashva in his incarnation of Hayagreev.", "' 'Now I am going to tell about Ketumaal Varsh which has seven mountains within its area- Vishaal, Kambal, Krishna, Jayant, Hariparvat, Vishoka, and Vardhamaan.", " There are thousands of smaller hills apart from these seven major mountains where people live.", " The names of the rivers flowing at Ketumaal Varsh are Vankshuyama, Swakambha, Amogha, Kamini, Shyama etc.", " Narayana dwells in Ketumaal Varsh in his incarnation of a boar (Varaha).", "' 'Now listen about Uttarkurudesha.", " There are thousands of trees, which are fruit laden in all the seasons.", " Apparels are made from the bark of the trees and ornaments from its fruits.", " After being degraded, the residents of Devaloka take birth here.", " Uttarkuru has two mountains- Chandrakant and Suryakant.", " The river- Bhadrasoma flows between these two mountains.", " Narayana in his incarnation of Matsya (fish) lives at Uttarkuru.", " Chandradweep and Bhadradweep are the two famous islands situated at Uttarkuru.", "' 7.", "9.", "1.", "6 The Description of Kimpurush-Varsha Markandeya says- 'The people residing in Kimpurush Varsh enjoy a long life.", " They live for 10,000 years.", " They are never bothered by any kind of disease or sorrow.", " Just behind Kimpurush Varsh is situated Hari Varsh.", " The residents of Hari Varsh enjoy an eternally youthful life because of the sugarcane juice they intake.", " Meru Varsh, which is situated near Hari Varsh, is also known as Ilavrit.", " It is devoid of the light of the Sun but gets sufficient light from the radiant Sumeru Mountain.", " It is so bright that even the Sun gets overshadowed.", " People living in Meru Varsh enjoy a very long life for 30,000 years.", " Similarly people living in Ramyak Varsh sustain themselves by drinking fruit juice.", " They live for 10,000 years.", " Hiranyamay Varsh is situated towards the north of Ramyak Varsh where the river Hiranvati flows. The residents of Hiranyamay are powerful, rich and handsome in appearance. "], "next": "7.9.2", "prev": "7.9", "title": "Swayambhuva Manavantar"}