{"index": "7.9.6", "image": "resized_images/Chakshush Manavantar.png", "text": [" Chaakshush had manifested from the eye (Chakshu) of Lord Brahma in his previous birth.", " For this reason, he was known as Chaakshush.", " Chaakshush was born to Anmitra and Giribhadra.", " After taking birth, he was abducted by Jaathaarini and exchanged with the son of King Vikrant who was sleeping besides his mother.", " Being unaware of this event, Vikrant considered him as his own son and named him as Anand.", " When Anand grew up, once, his Guru instructed him to make salutations to his mother.", " Anand replied- \"To whom should I make salutations?", " The one who has given birth to me or to the one who has brought me up and nurtured me?", " The Guru was surprised by his reply.", " He said- \"O son! Haimini, the wife of Vikrant has given birth to you and so, she is your mother.", " But Anand replied back- \"This woman is not my mother.", " I have taken birth from somebody else's womb.", " This woman is the mother of Chaitra.", " I am the son of Anmitra and Giribhadra.", " Jaathaarini had abducted me and brought me here.", " She had also carried Chaitra to Punarva's place and kept him over there.", " Jaathaarini had devoured the son of Punarva.", " Now tell me, who is my mother and to whom should I make salutations?", "\" The Guru became confused, so were the king and the queen.", " Anand went to the forest and started doing penance.", " Prajapati became pleased by his tremendous penance and appeared before him.", " He said- \"O son! What makes you undertake such a severe penance?", " Anand replied- \"O lord! I am doing this penance with the purpose of becoming free from all the bondage of my Karma and to purify myself.", " Brahmaji said- \"Only the mortal men are fit to become liberated because they are bound by their Karmas but you being a virtuous person are not bound by your Karmas.", " With my blessings, you would become the sixth Manu.", " There is no need for you to do penance.", " Lord Brahma named him as Chaakshush.", " Later on, he became famous as Chaakshush Manu.", " When Chaakshush Manu attained marriageable age, he married Vidarbha, the daughter of Ugra.", " Markandeya says- \"Aapya was the most prominent Gana of Chaakshush Manavantar.", " He was the master of eight deities.", " The second Gana was called Prasoot.", " He too was the master of eight deities.", " Similarly, there were two more Ganas- Bhatyakhya and Uthaga.", " Each of them was the master of eight deities.", " The presiding deity of these deities was Indra by the name of Manojav.", " The Saptarishis present during this Manavantar were Sumedha, Viraja, Havishmaan, Unnat, Madhu, Ati and Sahishnu.", " Chaakshush had many mighty sons like Uru, Kuru, Shatadryumna etc.", " Now I am going to tell you about the seventh Manu who was called Vaivasvat.\" "], "next": "7.9.7", "prev": "7.9.5", "title": "Chakshush Manavantar"}