{"index": "7.9.9", "image": "resized_images/Rauchya Manavantar.png", "text": " This Section contains 4 sub-sections.\n 7.\n9.\n9.\n1 Birth of Rauchya Manu Markandeya says- 'As soon as the ancestors departed, a beautiful Apsara came near Ruchi.\n Her name was Pramlocha.\n She said to him- 'O great sage! I have a daughter named Maalini.\n The name of my husband is Pushkar.\n I want to get her betrothed to you.\n Please accept her as your wife.\n In course of time, she would give birth to Manu.\n Ruchi accepted her proposal.\n Ruchi married Maalini in the presence of sages.\n In course of time, Maalini gave birth to a son who was named Rauchya.\n Rauchya Manavantar was named after him.\n 7.\n9.\n9.\n2 Ruchi Advised to get Married Markandeya says- 'During ancient times, the ancestors of Ruchi were not pleased by his unmarried status.\n He was a sage of high degree and used to have food once a day.\n The ancestors asked him- 'O son! Why didn't you get married?\n Grihasthashram holds a very important place in the life of a man.\n It is only after paying his three debts (rina) that a man is entitled to become a householder.\n All your efforts in paying off your debts towards the deities and ancestors are useless unless you are married.\n Your aspirations of attaining the supreme abode would go in vain unless you have become a father.\n' Ruchi replied- 'Getting married is the root cause of all sorrows.\n It also obstructs the upward spiritual movement of a man.\n That is why I am not having any interest in getting married.\n Having self control helps a man to attain salvation.\n' The ancestors said- 'The path you have chosen would never lead you towards salvation.\n A man reaps the fruits of his Karmas committed in his previous lives in the form of happiness and sorrow.\n An intelligent man must act in such a manner that his soul remains aloof from his Karmas.\n' Ruchi replied- 'The path of actions (Karma) has been described as an Avidya in the Vedas.\n Why are you pushing me towards that path?\n' The ancestors replied- 'It is true what you have said.\n But at the same time, it can be proved wrong by one's Karmas because Karmas are the means by which a man attains self- knowledge.\n Your belief that your actions are purifying your soul is based on false notions.\n Actually, by not doing your Karma, you are only torturing your soul.\n Karma is very beneficial for a man's upliftment.\n So, you must get married to enjoy a blissful life.\n' Ruchi replied- 'O great ancestors! Who will give his daughter to a poor and an old man like me?\n' The ancestors warned Ruchi that if he went against their wishes, he would face degradation in every sphere of his life.\n After saying this, the ancestors disappeared.\n 7.\n9.\n9.\n3 Ruchi Eulogizes his Ancestors Markandeya says- 'After the departure of his ancestors, Ruchi started wandering here and there in his restlessness.\n After sometime, when he regained his composure, he decided to do penance to please Lord Brahma.\n His penance continued for one hundred years.\n After the accomplishment of his penance, Lord Brahma appeared before him and asked what he desired.\n Ruchi expressed his desire of getting married as per the aspirations of his ancestors.\n Lord Brahma blessed him and also instructed Ruchi to eulogise his ancestors so that his wishes could be fulfilled.\n' Ruchi eulogised his ancestors by chanting Stotras- 'I make salutations to my ancestors who preside over the ceremony of Shraadh, who are pacified even by the deities, by the chanting of Swaha, made during the ceremony of Shraadh.\n I make salutations to my ancestors who dwell in the space and in the heaven.\n May my ancestors accept the offerings, which I am making in the form of flowers, cereals, water, Dhup etc.\n' 7.\n9.\n9.\n4 Ancestors Bless Ruchi Markandeya says- 'Hardly had Ruchi accomplished his eulogy of the ancestors, a very bright effulgence appeared in front of him, who were in fact his ancestors.\n They said- 'Demand any boon.\n' Ruchi replied- 'Lord Brahma has instructed me to enhance the process of creation.\n So I need a wife for that purpose.\n The ancestors said- 'Here at this very place, you will find a very beautiful wife.\n She would give birth to Rauchya.\n You too would become very famous as Prajapati because of your numerous sons and you will attain salvation in the end.' After blessing Ruchi, the ancestors departed for heaven. ", "next": "7.9.10", "prev": "7.9.8", "title": "Rauchya Manavantar"}