{"index": "8.1.4", "image": "resized_images/King Vasu and Sage Raimya Unite with Sri Hari.png", "text": [" Prithvi was anxious to know about the effect sage Vrihaspati's discources had on King Vasu as well as sage Raimya.", "She asked lord Varah-\"What did both king Vasu and sage Raimya do after listening to the preachings of sage Vrihaspati?", "\" Lord Varah replied-\"King Vasu was so impressed by Vrihaspati's discources that he decided to spend the rest of his life in the service of lord Narayan.", "He appointed Viwasman-his eldest son as his successor and left for Pushkar teerth.", "He engaged himself in austere penance by chanting pundarikaksha stotra.", "One day,while Vasu was chanting pundarikaksha stotra,he experienced an amazing incident-an entity whose complexion was blue, manifested from his body and stood with folded hands.", "In his bewilderment,king Vasu requested the stranger to introduce himself.", " The entity narrated the following tale to him - \"O King,you were the ruler of Janasthan in your second previous birth.", "Once,while you had gone deep into the forest on a hunting spree,you were delighted to find a deer which in fact was none other but myself.", "In fact,I had disguised myself as a deer and was wandering in the forest.", "Being oblivious of this fact you had killed that dear.", "Later on,when you realized your mistake,you cursed yourself for having killed an innocent brahmin.", "To get absolved of this sin,you had observed a fast on Ekadashi and had donated a cow to please lord Narayan.", "But,inspite of all these austerities you did not attain liberation because at the time of your death you had chanted your wife's name whose name was Narayani instead of Narayan.", "This blunder of your's had stopped you from attaining to Vishnu loka for one complete kalpa.", "But,my revengeful soul continued to torture your soul till it was driven out by lord Narayan's escorts.", "It was only then that you were able to attain to Vishnu loka.", "\" \"In your next birth you were born as the king of Kashmir.", "I did not spare you even in that birth and possessed your body.", "You performed numerous yagyas to get rid of me but all your efforts went in vain as you had not chanted the holy name of lord Vishnu in any of the rituals that you had performed.", "But,now I was forced to abandon your body since you have been constantly chanting the sacrosanct pundarikaksha stotra.", "I have also become absolved of all my sin by the virtue of listening to the pundarikaksha stotra.", "\" King Vasu expressed his gratitude to the entity for shedding light on his previous births.", "Suddenly,a divine aircraft descended from the heaven and king Vasu left for Vishnuloka mounted on it.", "Meanwhile,sage Raimya got the news of Vasu's ascension to heaven to Vishnuloka,he wanted to emulate the feat of his friend.", "He reached Gaya and performed shraddh in the name of his ancestors.", "He then engaged himself in an austere penance.", "Sanat kumar-one of the manasputras became very pleased by Raimya's penance and appeared before him.", "He complimented Raimya for liberating his ancestors by performing shraddh at Gaya.", "He then described the virtues of performing shraddh at Gaya and narrated the following tale – \"There lived a king named Vishal who had no son.", "One day,he invited few brahmins to his palace and asked them how he could beget a son.", "All the brahmins revealed to him that he did not have son because of the curse of his ancestors.", "\"You have not performed their shraddh so, they are angry with you and you can never beget a son unless you performed shraddh rituals at Gaya.", "Vishal went to Gaya as per the instruction of the brahmins.", "He performed the shraddh rituals and offered pinda-daan in the name of his ancestors.", "While he was still performing the rituals,he was amazed to see three men descending from the sky-one of them was of fair complexion while the remaining two were of wheatish and dark complexion respectively.", "Vishal curiously asked them as to who they were.", "The fair-complexioned person replied- 'I am your father-'sit'.", "The person with wheatish complexion is my father and the third person amongst us is my grandfather.", "My father had committed grave sins while he was alive and killing a brahmin was one the gravest sin he had committed.", "My grandfather was even worst than my father and his dark complexion is nothing as compared to his grave sins.", "He had killed numerous innocent sages for no fault of theirs.", "All three of us have come to express our gratitude as we have become liberated from our sins by the virtue of the shraddh rituals you have performed.", "The water which you had offered to us while performing the rituals have given us the ability to communicate with you,even though we are spirits.", "' After finishing his tale, Sanat kumar told sage Raimya that Gaya was supreme among all the places of pilgrimage and the virtues of performing shraddh overthere is incomparable.", "Sage Raimya dedicated rest of his life to the worship of lord Gadadhar.", "At last,lord Gadadhar appeared before him.", "Sage Raimya requested the lord to give him a place in his abode which was dwelled by sages like Sanak and Sanandan.", "Lord Gadadhar blessed him by saying-'So be it.", "'This way,sage Raimya attained enlightenment with the blessings of the merciful lord Gadadhar and ultimately attained to the divine abode of lord Vishnu. "], "next": "8.1.5", "prev": "8.1.3", "title": "King Vasu and Sage Raimya Unite with Sri Hari"}