{"index": "8.1.1", "image": "resized_images/Prithvi’s Queries.png", "text": " Lord Vishnu, in his incarnation of Varah( a boar),had liberated Prithvi(Mother Earth) from the clutches of Hiranyaksha- the mighty demon who had abducted her to rasatal.\nAfter being rescued,Prithvi heaved a sigh of relief and looked at her saviour,who was smiling.\nShe curiously asked lord Varah- \"How does the process of creation begin in the beginning of each Kalpa?\n What is dissolution?\n How do you nurture the whole creation?\n In what order do all the four Yugas occur and how are they calculated?\nWhy do you take incarnation in each yuga?\n All these things puzzle me a lot and I request you to enlighten me on all these subjects.\n\" Lord Vishnu burst into laughter and the whole universe,including the deities became visible to Prithvi through his opened mouth.\nPrithvi became so frightened by this amazing sight that she started to tremble in fear.\nLord Vishnu then transformed his appearance and revealed his divine form to Prithvi so that she could become free from her fright.\nWhen Prithvi saw the divine form of lord Vishnu,who was in his meditative sleep taking rest on Sheshnag,all her fear vanished.\nShe was extremely pleased to see the divine appearance of lord Vishnu and thanked her good fortune.\nPrithvi,filled with extreme devotion eulogized lord Vishnu.\n Lord Vishnu was extremely pleased by her eulogy and said-\"The answers to the questions you have asked are not easy to understand,but still I Shall try to satisfy your curiosity.\nThe supreme Almighty is eternal.\nIn the biginning of creation,Ego(ahamkar) as well as the five basic elements- space,water,earth,air and fire manifest themselves from the supreme Almighty.\nSubsequently,the great element-mahattatva,nature and collective conciousness manifest themselves.\nThe collective conciousness then combines with each of the three basic qualities-satva(pure),rajas and tamas(dark) and exits in three different states.\nIt's combination with the dark quality results into the manifestation of Mahadbrahm which is also called prakriti or nature by the enlightened ones.\nKshetragya(soul) is considered to be more superior than the Prakriti.\nThis way the different permutations and combinations of all the three gunas with collective intelligence result into the creation of different \"tanmatras\"(subtle form of matters).\nFrom the tanmatras are created the \"Indrias\" or sense organs.\nThis is the way how the Universe comes into existence.\nI then create all the living creatures with the help of five basic elements.\n\" \"In the beginning there was nothing but empty space.\nSubsequently,various natural elements like \"shabda\"(sound),\"akash\"(ether),\"vayu\"(air),\"teja\"(light) and jal(water) came into being respectively - each of the latter manifesting from the former.\nThen,I Created you(earth)to provide base to all the living creatures.\nThe combination of earth and water resulted into an \"Egg\"(anda).\nAs the egg grew in size,I manifested myself as Narayan within it.\nDuring each kalpa a lotus manifests itself from my navel upon which is seated lord Brahma.\nI then request lord Brahma to commence creation.\nInspite of all his efforts, lord Brahma does not succeed in commencing his creation.\nAs a result he becomes furious and from his fury manifests a divine child who starts to wail incessantly.\nThe divine child is none other than Rudra who is requested by lord Brahma to begin creation but the child being incapable of doing that decides to acquire power by doing penance and enters into deep water.\n\" \"Lord Brahma then created Prajapati from his great toe of his right foot and Prajapati's consort from the great toe of his left foot.\nThe manifestation of Prajapati and his consort marks the beginning of copulative creation and thus Swayambhuva Manu is born.\nIn course of time population increases.\nThis is the way how creation takes place in each kalpa.\n\" Mother Earth requested lord Varah to shade some more light on the creational process as her curiosity had still not been totally satisfied.\nLord Varaha replied- \"At the end of the last kalpa,when the whole universe was engulfed in darkness,Narayan went into his yogic-sleep.\nAfter waking up he found the world devoid of any creature.\nNarayan,being the supreme Almighty-the creator,the nurturer as well as the annihilator,decided to commence creation.\nThe term Narayan means one who has his abode in the water- naar means water and ayan means abode.\nFirst of all five types of \"avidya\"(false knoledge) manifested from Narayan- tamas(darkness), moha(attachment),mahamoha(absolute attachment),tamisra(jealousy) and andhatamisra(anger).\nAfter the manifestation of these five \"avidyas\",came into existence immovable things like mountains,trees etc.\nThese being the primary creations came to be known as \"mukhya sarga\"(main creation).\nContinuing with his creations,lord Brahma created species that were superior to the earlier creation-animals.\nThis particular creation was called \"Tiryaksrota\"(quadruped).\nThis way Brahma did his creation.\nBrahma's sixth creation was called Satvik sarga which consisted of the deities who were all virtuous by nature.\nThe creation of human beings was seventh in order and was known as\"Arvaaksrota sarga.\nEven human beings were of three types -those who were predominantly virtuous possessed satva guna had radiant personality and never experienced sorrow but those who possessed rajas and tamas gunas experienced sorrows.\n\" \"Brahma's eighth creation was called \"Anugrah sarg\" in which he created the sages and the hermits for the benediction of the world.\nThe nineth creation of Lord Brahma was called \"Kaumar sarg\"(creation of adolescent beings).\nSo,these are the nine main types of creation through which Brahma creates.\nFirst of all Rudra and other deities manifested themselves and then came into being eternal adlescents like Sanak,Sanandan, etc.\nSubsequently,all the ten manasputras of Brahma manifested themselves-Marichi,Angira, Atri,Pulah,Kratu,Pulasya,Pracheta,Bhrigu,Narad and Vashishth.\n\" \"Lord Brahma's first creation-Rudra had manifested himself as Ardha narishwar(half male and half female).\n At the request of Brahma,Rudra dismembered his female part resulting into the creation of two distinct forms- one male and the other female.\nLater on,ten more Rudras manifested from the male form and all of them collectively came to be known as 'Eleven Rudras'.\" ", "next": "8.1.2", "prev": "8.1", "title": "Prithvi’s Queries"}