{"index": "8.1.3", "image": "resized_images/Ashvashira’s Unification with Lord Narayana.png", "text": " Prithvi asked lord Varah about the famous incident which described Ashvashira's unification with lord Narayan.\nLord Varah then narrated the following tale- \"During ancient times,there used to live a virtuous king named Ashvashira.\nHe had performed an ashwamedh yagya in which he had donated large amount of wealth.\nOnce,sage Kapil arrived at his palace acoompanied by sage Jaigishavya.\nKing Ashvashira received both his distinguished guests with due honour.\nAfter the formalities were over,he asked both his guests about the means by which lord Narayan could be pleased and also about the rituals pertaining to the worship of lord Narayan.\n\" Both the sages being enlightened souls realized that Ashvashira was asking this question out of his ignorance so,they decided to enlighten him on the omnipresent nature of Narayan and said-'What do you mean by pleasing Narayan?\n Can't you see two Narayans standing in front of you?\n' But,Ashvashira was unamused and unconvinced so he replied-'I don't deny that both of you possess supernatural powers and also that all your sins have destroyed on account of the virtues attained by doing penance.\nBut,I don't believe your claim to be Narayan.\nLord Narayan is the almighty God and the supreme deity.\nHe holds a conch,a chakra and a mace in his hands.\nHe wears pitambar and has Garuda as his mount.\nHis glory is indescribable and incomparable.\n' As Asvashira had raised valid points,sage Kapil transformed his appearance with the help of his divine powers.\nSimilarly,sage Jaigishavya transformed his appearance and became Garuda.\nBut,Ashvashira still remained unconvinced and said-'How can I accept you to be Narayan as there is no sign of lotus manifesting from your navel in which lord Brahma has his abode.\n' Sage Kapil then slightly transformed his appearance and created an illusion whereby a lotus flower emanating from his navel became visible to Ashvashira.\nSage Jaigishavya sat on that lotus flower in the guise of lord Brahma.\nNot only that,they also created an illusion due to which all types of living creatures inside the palace premise.\n Now,Ashvashira was really confused and requested both the sages to break the magic spell.\nBoth the sages decided not to test the limit of Ashvashira's patience and so,they trasformed their respective guises into their original appearances.\nBoth of them said- 'Narayan is one but can manifest himself in countless forms.\nThe whole universe is HIS creation and HE is present in every single creature.\nIt is impossible for a mortal being to bear the radiance of almighty Narayan and it is only when HE appears in his more gentle form that the enlightened person is able to see him.\nTherefore,you should engage yourself in the service of mankind,considering each human being to be the medium through which lord Narayan manifests himself.\n Ashvashira was satisfied by the explanation given by both the sages but there was still one question bothering him a lot so, he asked- 'Who is most likely to attain salvation-a knowledgeable person or a person who indulges in rightful deeds?\n' Sage Kapil narrated the following tale-'Once,sage Raimya and king Vasu had asked the same question to sage Vrihaspati.\nAt that time Vrihaspati had replied that anybody who performed his duties with a sense of detachment is sure to attain salvation and to prove his point he had narrated the following tale-'During ancient times,there lived a brahmin named Sanyaman.\nHe was the descendant of sage Atri.\nOne day,while he was going to take his bath he met Nishthoor-a fowler,who used to catch birds and animals for his livings.\n' Sanyaman reprimanded Nishthoor for his evil deeds and said- Why do you trap innocent birds and animals?\n Nishthoor replied-'The almighty God is present in each living creature.\nOne who is desirous of attaining salvation must under no circumstances allow his ego to dominate him.\nThe 'doer' is not the man but the supreme Almighty present in him.\nKeeping this fact in his mind a man should perform his duties with nonchallance and a sense of detachment.\nIf I earn my livelyhood by catching birds and animals then it is the will of almighty.\n' To prove his point,the fowler spread his iron-net and kept dry blocks of wood underneath it and then requested Sanyaman to ignite those blocks.\nSanyaman was surprised but burnt the wodden-logs as per the fowler's instruction.\nIn a short time all the wodden-blocks became ablaze and the flames startes coming out from the thousand of small holes of the iron-net.\nThe fowler then told Sanyaman that although the flames coming from each hole appeared to have distinct sources,yet the fact was that the flames manifested from the single source- wodden blocks that were burning beneath the iron-net.\n The fowler said-\"It was impossible to extinguish the fire untill and unless the source of the fire was extinguished.\nEach hole of the iron-net can be compared with an individual and the almighty God with the source of fire.\nA man does what God wills and he can never experience sorrow provided he constantly remembers the Almighty even while he is performing his daily chores.\n\" Sanyaman was very much impressed by the fowler's wisdom.\n Having finished his tale,sage Vrihaspati told Ramya-\"Now it must be evident to you that salvation is within the reach of any individual.\nIt does not make much difference whether the seeker of salvation is a householder or a hermit aspiring for knowledge.\n\" Continuing with the story of Ashvashira,lord Varah told Prithvi-\"King Ashvashira was so impressed by Kapil's preachings that he went to Naimisharanya and spent his rest of his life in the service of lord Narayan.\nOnce,while he was performing yagya,suddenly lord Vishnu manifested himself from the altar in the form of a brilliant effulgence and the identity of Ashvashira merged with it.\nThis way,Ashvashira got united with lord Vishnu by the virtue of his deep devotion. ", "next": "8.1.4", "prev": "8.1.2", "title": "Ashvashira’s Unification with Lord Narayana"}