{"index": "8.1.6", "image": "resized_images/King Durjay.png", "text": [" During satya yuga,there lived a king named Suprateek.", "Although he had two queens,yet none of them bore any son to him.", "One day,Suprateek went to meet sage Durvasa,who had his hermitage at the foothills of chitrakut mountain and engaged himself in the sevice of Durvasa.", "The sage blessed the king and prophesised that he would become a proud father of a mighty son named Durjay.", "Durvasa's prophesy came true and Suprateek's eldest queen- Vidyutprabha gave birth to a son.", "The child was named Durjay.", "In course of time Durjay grew up to become a worthy successor of Suprateek.", "Suprateek decided to spend rest of his life in the service of God,so he went to Chitrakut mountain to do penance.", " Mean while,Durjay being an ambitious king expanded his kingdom by subjugating all the neighbouring states.", "He conquered numerous mighty kingdoms and vanquished almost all the prominent warrior castes like- gandharvas,kinnars,demons and even the deities.", "Indra-the lord of the deities was defeated by Durjay and was forced to retreat towards east of Sumeru mountain alongwith the lokpals-various lords protecting different regions of the Universe.", "The whole world went into turmoil as the fallout of lokpal's power being snatched by Durjay.", "While Durjay was returning to his capital along with his victorious army,he met two asuras-Vidyut and Suvidyut, who had diguised themselves as sages.", "Both the impersonators requested Durjay to make some alternative arrangements so that the world could function smoothly.", "In reality,both of them harboured wishes of having the powers of lokpal's so they offered their services in this regard.", "Durjay,being unaware of their real identity agreed to appoint them as lokpal's and then proceeded towards his capital.", "While he was passing by the mandarachal mountain,he saw two beautiful women.", "Durjay was surprised to find them at such a deserted place.", "As he stood their wondering about their identity,he saw two hermits approaching him.", "Both the hermits asked Durjay-\"Who are you?", " What is the purpose of your arrival?", " Durjay introduced himself and told them that he was on his way to conquer the whole world.", "Now it was the turn of both the sages to introduce themselves-\"We are the sons of Swayambhuva Manu-Hetu and Prachetu.", "We had successfully defeated the deities and driven them out from their abode-Sumeru mountain.", "All the deities went to seek the help of lord Vishnu and were successful in getting his assurance.", "Lord Vishnu then attacked us and vanquished our army but he spared our lives.", "Then onwards we became ardent devotees of the merciful lord Vishnu.", " Hetu,then pointing towards one of the women said-\"She is my daughter- Sukeshi.", "The other woman you see is my brother- Prachetu's daughter and her name is Mishrakeshi.", "Please accept both these beautiful as your wives.", "\"Durjay readily agreed to marry both of them as they were really very beautiful.", "He then returned to his capital.", " Everything was going quite smoothly for Durjay,when on one fateful day he met his downfall because of his extreme greed.", "The incident happened as follows- Once,Durjay had gone into the forest on a hunting spree,where he met a sage named Gaurmukh.", "Gaurmukh had been blessed by lord Vishnu with a divine diamond named Chintamani which was capable of fulfilling all desires.", "Gaurmukh gave a royal treatment to Durjay with the help of wish- fulfilling diamond.", "He created an illusionary palace and offered variety delicacies to him as well as his whole army.", " Durjay wanted to have chintamani diamond at any cost and therefore sent his minister-Virochan to persuade Gaurmukh to part with that diamond.", "Gaurmukh became furious after coming to know about the evil intention of Durjay and told Virochan to ask Durjay to leave at once.", "But,Gaurmukh knew quite well that the greedy Durjay would not give up so easily and would definitely try to acquire chintamani by force.", "So, he requested chintamani diamond to create a huge army.", " Meanwhile,Durjay ordered his chief-commander,named Neel to bring chintamani at any cost.", "Neel proceeded with a large number of soldiers.", "A fierce battle took place between both the armies in which Neel was killed and his army got vanquished.", "Finally,Durjay himself came forward to fight but even he was defeated.", " In the meantime,Hetu and Prachetu got the news that their son- in-law was in trouble.", "Both of them proceeded with a huge army to help their so- in-law.", "But,they were no match for the might of their adversary and both of them eventually dieed in the ensuing battle.", " Meanwhile,sage Gaurmukh found Durjay standing at the entrance of his hermitage with a small number of surviving soldiers.", "He sought the help of lord Vishnu,who appeared within no time.", "Gaurmukh requested him to punish Durjay for his evil intention.", "Lord Vishnu severed Durjay's head with his sudarshan chakra.", "The place where Durjay was killed later on became famous as Naimisharanya.", "Sage Gaurmukh continued to live at Naimisharanya without any problem. "], "next": "8.2", "prev": "8.1.5", "title": "King Durjay"}