{"index": "8.1.2", "image": "resized_images/Priyavrata Attains to Heavenly Abode.png", "text": [" Describing the incident which enabled King Priyavrata to attain to heavenly abode Lord Varah told Prithvi- \"Swayambhuva Manu lived during the first kalpa.", "He had two sons-Priyavrata and Uttanpad.", "Priyavrata was extremely virtuous by nature.", "In course of time,he relinquished his throne and after distributing his kingdom among his sons went to Badrikashram to do penance.", "Once sage Narad paid a visit to his hermitage.", " Priyavrata received his esteemed guest with all the respect which made Narad extremely pleased.", "Priyavrata then requested Narad to narrate about some interesting incident which had occured in his life.", " Narad narrated about an interesting incident which had happened while he was on his way to meet Priyavrata- \"I experienced an amazing incident yesterday while I was passing by a lake in Shwetdweepa.", "I saw a divinely beautiful woman who was standing alone at the bank of that lake.", "I was surprised to find such a beautiful woman at such a lonely place.", "For a moment I became so infatuated by her beauty that I lost all control over my senses.", "My lust had made me devoid of all my knowledge and learning.", "Now,I became very worried and ashamed of my conduct-but the damage had already been made.", "I immediately realized that she was not an ordinary woman.", "To my surprise,I saw a form of a divine person visible clearly within her body.", "Within nextfew moments two other male forms revealed themselves.", "Suddenly,all three of them disappeared leaving behind just that divine lady.", "I was dumbstruck by this amazing incident.", "I asked her as to who she was.", "The divine lady disclosed to me that she was none other than goddess Savitri - the mother of all the Vedas and since I was unable to recognize her therefore all the knowledge had vanished from my memory.", "She also revealed to me that the three divine men which had manifested themselves within her body were in fact the three Vedas- Rigveda,Samveda and Yajurveda.", "After revealing these amazing facts to me goddess Savitri assured me that by taking a bath in that lake I would not only regain my memory of the Vedas but also of all my previous births.", "I eulogized goddess Savitri and thanked her for the blessings showered on me.", "I then bathed in that lake and to my pleasant surprise I now remembered everything of my past births as had been prophesised by goddess Savitri.", "\" Priyavrat was very surprised and requested Narad to describe some interesting incident related with his past birth.", "Narad narrated the following incident to him- \"In satyayuga,I was born in a brahmin family and was named Saraswat by my parents.", "I was very studious and grew up to become a renowned scholar.", "The almighty God had blessed me with immense riches and I never experienced scarcity of any kind in my life.", "But,very soon I got bored of my monotonous and routined life.", " It had become clear to me that there was more to life than just worrying about the gains and losses.", "So,I decided to do penance to attain salvation.", "I distributed all my wealth among my sons and went to the bank of river Saraswati,where I first performed the rituals of shraddh in the name of my ancestors and then performed yagyas.", "I also donated lot of wealth to poor people.", "Being satisfied,I then went to Pushkar teerth and did penance at the bank of river Saraswat by continuously chanting the sacred mantra\"om namo narayan\" and brahm paar stotra.", "Ultimately,lord Narayan became pleased and appeared before me.", "Lord Sri Hari asked me of my wish and I express my desire to get united with his divine form.", "But,lord Narayan told me that the world needed me and so this desire of mine could not be fulfilled.", "He blessed me and gave me my name- Narad because I had 'donated' water(naar) to my ancestors during the course of performing shraddh rituals.", "Although my wish of uniting with the divine form of Sri Hari had remain unfulfilled but still there was a consolation as I had been fortunate enough to see his divine form with my mortal eyes.", " Thereafter,I devoted my life to the worship of Sri Hari.", "After my death,I attained to brahmaloka- I had been adequately rewarded for my devotion toward lord Sri Hari.", "Later on,I manifested as one of the ten manasputras of lord Brahma when he commenced his creation.", "It was only because of the blessings of Sri Harithat I came to be regarded as 'lok guru' by the masses.", "So Priyavrat,if you are desire of attaining salvation then you should follow my example and devote your life in the name of Lord Srihari.", "\" Prithvi,who was listening to the tales narrated by Lord Varah with rapt attention asked him whether it was possible for anybody to see Lord Narayan with his/her mortal eyes.", "Lord Varah replied -\"Lord Narayan has taken ten incarnations in various forms such as matsya(fish),kachchap(tortoise),varah(boar),narsimh(half human and half lion),vaman(dwarf),parshuram,Ram,Krishna,Buddha and kalki.", "The last incarnation-Kalki is yet to take place.", "A man can realize Lord Narayan by having total devotion in any one of the ten incarnations.", " Even the deities are incapable of this divine experience-what to say about humans.", "Lord Brahma is the manifestation of all the three qualities of Sri Hari and actually it is He(Sri Hari) who creates in the form of Lord Brahma-it is He who manifests himself in various natural forms like earth,water,fire,air and sky-it is He who manifests himself in various abstract qualities like consciousness- He is omnipresent and the whole universe is pervaded by him.", "\" Prithvi was anxious to know whether Narad's sermons had any effect on Priyavrat and asked Lord Varah regarding this.", "Lord Varah replied- Priyavrat was so impressed by Narad's discourses that he relinquished his throne and went to do penance after equally distributing his kingdom among his sons.", "Ultimately,he did manage to attain to the abode of lord Sri Hari by the virtue of his total devotion. "], "next": "8.1.3", "prev": "8.1.1", "title": "Priyavrata Attains to Heavenly Abode"}