{"index": "8.10.4", "image": "resized_images/Liberation from Sins.png", "text": " Narad asked Yamaraj about the reason why joy was so elusive to human beings.\n He also wanted to know about the reasons for man's sorrows.\n Yamaraj replied---Man's destiny is defined by his own actions.\n He has to taste the fruits of his actions.\n He has to taste the fruits of his each and every actions.\n So when a man finds himself amidst sorrows he must realize that he is reaping the fruits of his past actions.\n If a man commits virtuous deeds then joy is experienced but sinful deeds invite sorrows and miseries.\n Desires force a man to take countless birth.\n A man takes birth on the basis of his past Karmas.\n God does not interfere in this matter.\n So, only foolish people curse God for their miseries.\nThey forget that their sorrows are of their own making.\n A man can liberate himself from sins by engaging in virtuous deeds and abstaining from sinful deeds.\n A man should perform his duties with a sense of detachment,because attachment results into the transmigration of the soul.\n Lord Brahma has declared that 'Shishumar chakra' is the symbolic expression of his own self.\n Anybody desirous of getting liberated from his sins must make an image of this chakra and worship it.\n One who visualises this chakra within his body, too, becomes liberated from his sins.\n Mental worship of various planets (Jupiter, Venus, Mercury, Saturn, Mars etc) Visualized at the various points of this chakra helps a man to become liberated from all the sins.\n Similarly, practising Pranayam for hundred times helps a man to become liberated from all the sins.\nThe most easiest way to become liberated from sins is by engaging oneself in the servitude of a cow.\n This deed is as virtuous as making pilgrimages to all the sacred places together.\n Observing fast on Ekadashi also helps a man to become liberated from his sins.\n\" Having finished his narrations, Nachiketa, looked at the sages, who were listening with rapt attention.\n The sages thanked Nachiketa for enlightening them on the sacred place called Yamapuri. ", "next": "8.11", "prev": "8.10.3", "title": "Liberation from Sins"}