{"index": "8.10.1", "image": "resized_images/Nachiketa’s Experience.png", "text": " Once, Janmejay asked Sage Vaishampayan about Yamrajpuri and it's location. He also wanted to know as to what should a man do so that he does not have to go there. Sage Vaishampayan narrated the tale of Nachiketa, one of the few blessed persons to have visited yamarajpuri with his mortal body--\"Long Long ago, there lived a Sage named Uddyalak. He had a son named Nachiketa. One day, while Uddyalak was performing a'Yagya', Nachiketa arrived there and disturbed him by repeatedly asking-'To whom will you give me?' Sage Uddyalak, in a fit of rage cursed Nachiketa to go to hell. But after he cooled down, he regretted for having cursed his dear son. Nachiketa being an obedient son was ready to go to hell. His father tried his best to convince him against doing this but to no avail. Nachiketa assured his father that he would return safely after visiting Yampuri.\" \"Thus, Nachiketa went to Yampuri and met Yamaraj---the lord of death. He stayed there for some days and witnessed all the events taking place over there. Ultimately he sought yamaraj's permission to return. When he returned home, his father was extremely delighted to find his son alive. Very soon, the place was thronged by many people and everybody was curious to know about his experiences during his stay in the hell. Nachiketa replied--Sinners like liars, greedy people, jealous people, caluminators, treacherers etc, go to hell. Similarly, one who kills a child or a woman, or kills a brahmin, or one who criticizes the Vedas, or lends money on interest, or one who abandons his parents or faithful wife, or one who ciritizes his guru, or one who sells liquor, or a brahmin who sells Vedas, goes to hell and tastes the fruits of his sinul actions.\" \"Yamapuri is made of gold and spread in the area of one thousand yojan. It is well fortified and it is impossible for anybody to tresspass its territory. I saw sinners experiencing unbearable torture over there. I also saw couple of rivers flowing there--Pushpodaka, at the bank of which there are trees in abundance and Vaivaswati, which flows through the central part of Yamapuri. Vaivaswati contains divine water which never dries up. Yamapuri has two entrances---one through which only virtuous souls like sages and hermits are allowed to enter and the second through which sinners enter Yamapuri. The former entrance is such that even heat loses its quality in its vicinity. The latter entrance is situated in the south and has a large iron gate. I also saw three large ditches called 'Audoombar', 'Avirchiman' and 'Uchchavach' which are meant for the sinners. Sinners are also forced to pass through the flames that continuously keep on errupting to the west of Yamapuri. \"I saw a grand assembly hall where truthful and virtuous people live. It is graced by the presence of sages like Manu, Vyas, Atri, Gautam, Angira, Bhrigu and others. There, I saw a goddess who is worshipped by Yamaraj. The goddess controls all the functions of the world. I also saw the ferocious Kala. He possesses extreme anger and is very powerful. Time does not have any influence on him as the result of which he enjoys eternal youth. I also saw various types of demons and giants in the hell.\" I saw many messengers of Yamaraj punishing the sinners. Some were beating the sinners with sticks in their hands while some sinners were being forced to enter fire. I saw all the sinner wailing and repenting for their sinful deeds. Many sinners were kept at a very dark place where there was no light. Those who had committed graver sins were put in boiling oil. I saw many sinners being given all sorts of severe punishment. I saw a place where iron nails were spread all around. This was the place where people who breached the modesty of women were given punishment.\" \"I saw ten different hells--Tapta, Mahatapt, Raurav, etc; Each of the latter is more ferocious than the former. The sinners are sent to all these hells on the basis of the gravity of their sins. Yamaraj himself instructs chitragupta on the punishment to be given to these sinners.\" ", "next": "8.10.2", "prev": "8.10", "title": "Nachiketa’s Experience"}