{"index": "8.11.5", "image": "resized_images/Prakriti and Purush.png", "text": " Once, Lord Shiva while describing about the incident when he had a divine glimpse of Lord Narayan, told Sage Agastya -- 'Purusha' is none other than Lord Narayan himself and Prakriti is the medium through which he manifests his powers. I have been fortunate to have a divine glimpse of this Purush. Lord Brahma after having created me, instructed me to create. But, I did not know how to create. So, I decided to do penance and went into the ocean. In the ocean, I saw an entity who was no more than the size of a thumb. He was purush himself and I immediately recognized him. I started meditating on the form of that almighty--Purush. Suddenly, eleven more entities emerged before me. They were all very radiant and the water had become hot on account of the heat emanating from their bodies. I asked them as to who they were but they did not give any reply and went out of my sight. The next moment, I saw an extremely handsome man. I asked him about his identity and also about the eleven entities whom I had seen few moments ago. Those entities were the eleven Aadityas and had gone to help Lord Brahma in the process of creation. Then he said--I am Narayana--the omnipresent lord. I am blessing you with 'divine vision' so that you can see my divine appearance.' When I fixed my glance at Narayan I was amazed to see the same thumb-sized Narayana standing before me. But, now He was no longer having the size of a thumb. On the contrary he had expanded his body to such an extent that He appeared like a giant. I also saw Lord Brahma sitting on a lotus flower emanating from his navel. I eulogized HIM with complete devotion. HE blessed me and said--'You are eternal and nothing is beyond your knowledge. You will be worshipped by the deities. I shall take twelve incarnations in the coming eras and shall worship you in each of my incarnation.' Having said this, Lord Narayana disappeared. This was how I saw the divine form of the 'Purush'--Lord Narayan. ", "next": "8.11.6", "prev": "8.11.4", "title": "Prakriti and Purush"}