{"index": "8.11.6", "image": "resized_images/Bhuvan-Kosh and the Islands.png", "text": " All the sages listened with rapt attention to the description Lord Shiva made of the Almighty Narayan.\n But, they had few more queries in store, so they asked Lord Shiva-- \"O Lord of Uma! please tell us about the expanse of the Earth- the situation of mountains and the prominent islands.\n\" Lord Shiva replied--\"Bhuloka is situated on the surface of the Earth, while the earth itself is based on Almighty's chest.\n With the desire of creating the three basic gunas---Sat, raj and Tama, the Almighty Narayan created water first of all and went into 'yoganidra'.\n Then a lotus flower manifested from HIS navel on which was seated Lord Brahma.\n Lord Brahma then created his manasputras-- Sanak, Sanandan, Sanatan and Sanatkumar all of whom were enlightened souls.\n Then Lord Brahma created sages like Daksha etc.\n Daksha's daughter Shatarupa was married to Manu from whom she had two sons--Priyavrata and Uttanpad.\n Priyavrat had ten sons--Aaghnighna, Agnibahu, Medh, Medhatithi, Dhruva, Jyotishman, Dyutiman, Havya, Vayushman and Savan.\n He had divided the earth into seven islands and presented them to each of his seven sons.\n Aaghnighna became the king of Jambudweepa whereas Medhatithi, Jyotishman, Dyutiman, Havya, Vayushman and Savan became the rulers of Shakadweepa, Kraunch dweepa, Shalmalidweepa, Gomeddweepa, Plakshdweepa and Pushkar dweepa respectively.\n\" \"Savan had two sons--Dhat and Mahaveeti, who were the rulers of 'Dhatki' and 'Kaumud provinces respectively.\n Similarly Dyutiman had three sons--Kush, Vaidyut and Jeemutvahan.\n Jyotishman had seven sons--Kushal, Manugavya, Peevar, Andhra, Andhakarak, Muni and Dundubhi.\n Kush had seven sons-- Udbhid, Venuman, Rathapal, Manu, Dhriti, Prabhakar and Papil.\n\" \"Medhatithi too had seven sons--Nabhi, Shantmaya, Shishir, Mukhodam, Nandshiva, Kshemak and Dhruv.\n Nabhi's wife was Merudevi, who had given birth to Rishabh.\n Rishabh was the father of Bharat upon whom the area lying south of Himalaya mountain is named.\n\" \"Sumati was the son of Bharat.\n Bharat, after appointing Sumati as his successor went into the forest to do penance.\n The names of some prominent kings coming from the lineage of Sumati were Tej, Satsut, Indradyumna, Parmeshthi, Pratiharta, Nikhat, Unmeta, Abhav-Udgata, Prastota, Vibhu, Prithu, Anant, Gaya, Naya, Virat, Mahavirya and Sudhiman.\n\" \"Sudhiman had one hundred sons.\n This way the population continued to grow.\n The four yugas--Satya yuga, Treta, dwapar and Kali occur in a cyclic order.\n Each of the latter follows the former.\n A manvantar comprises of 71 chaturyugas.\" ", "next": "8.11.7", "prev": "8.11.5", "title": "Bhuvan-Kosh and the Islands"}