{"index": "8.11.12", "image": "resized_images/Trishakti.png", "text": [" Describing the reason behind the manifestation of 'TriShakti' (Three goddesses manifesting from the bodies of Brahma Vishnu and Shiva), Lord Varah told Prithvi--- There lived a mighty demon named 'Andhak' who used to torment the deities.", " After being driven out of the heaven all the deities sought lord Brahma's help.", " Lord Brahma took them to Lord Shiva and requested him to find some solution to the miseries of the deities.", " Lord Brahma then meditated on the form of Vishnu who appeared instantly.", " The powers emanating from the eyes of all the three deities got combined and resulted into the manifestation of goddess Parmeshwari.", "On the request of the deities,goddess Parmeshwari created three more goddesses from her body- Brahmi,Vishnupriya and Rudrani.", "Goddess Brahmi was of fair complexion while Vishnupriya's complexion was wheatish.", "Goddess Rudrani appeared extremely ferocious in her dark complexion.", " Lord Brahma advised goddess Brahmi to do penance at Shwetgiri mountain.", "Similarly,Vishnupriya went to Mandarachal mountain to do her penance while Lord Shiva advised goddess Rudrani to go to Nilgiri mountain.", " While Vishnupriya was doing her penance at Mandarachal mountain, crores of goddesses manifested from her body prominent among whom were Vidyutprabha,Chandrakanti,Suryakanti,Gambhira,Vijaya,Jaya, Jayanti,Aparajita,etc.", "All these goddesses acted as the escorts of goddess Vishnupriya who is also called Vaishnavi.", " One day,sage Narad visited goddess Vaishnavi and was dumbstruck by her divine beauty.", "He had never seen such a beautiful woman in his life.", "On his return journey,Narad met Mahishasur-the mighty demon,who had been blessed by Brahma.", "Mahishasur had conquered all the three worlds.", "Narad praised the glory of Mahishasur but went on to add that his majesty was incomplete untill he married Vaishnavi.", " Narad said-\"I have never seen such a beautiful woman in my life.", " She is worshipped by all the sages,gandharvas,deities as well as other celestial beings.", "Although,you are worthy of becoming her husband yet the fact is that you can not have her as your wife untill you have conquered the deities and the gandharvas.", "\" After sowing a seed of lust in Mahishasur's mind,Narad went away.", " Mahishasur vowed to marry Vaishnavi at any cost.", " Lord Varah continued with the tale and said-\"After Narad went away,Mahishasur summoned his ministers-Praghas,Vighas,Shanku- karna,Vibhavasu,Vidyunmali,Sumali,Parjanya and Krura.", "When all the ministers arrived,he requested them to find out means so that he could marry Vaishnavi.", " Praghas-one of the ministers, was very intelligent.", "He warned Mahishasur against going ahead with his evil designs and said- 'This illegal abduction could become the cause for your destruction.", "'Vighas corroborated the statements of Praghas.", " Finally,everyone agreed that it would be better if Vaishnavi was persuaded to accept Mahishasur as her husband instead of forcefully abducting her.", " \"So all of them,finally came upon two conclusions-first was to send a messenger to persuade Vaishnavi into marrying Mahishasur and the second was to defeat the deities in a battle.", "A demon named Vidutprabha was sent to meet goddess Vaishnavi.", " Mahishasur then launched a fierce attack on the deities and defeated them.", "The deities were forced to flee the battle-field and seek refuge in brahma loka.", "\" \"Meanwhile,Vidutprabha had already reached Mandarachal mountain.", " Without showing any rspect to goddess Vaishnavi,he tried to impress her by narrating the amazing tale of Mahishasur's birth- 'During ancient times,there lived a sage named Suparshva.", "Once,he was doing penance and an ogress named Mahishmati alongwith her companions, arrived at his hermitage.", "Mahishmati was very much impressed by the grandeur of his hermitage and decided to occupy it.", "She changed her appearance and became a buffalo.", "She then started tormenting Suparshva,who was initially terrified but finally came to know about her real identity.", "Suparshva cursed her-'You deserve to remain as a buffalo for the rest of your life.", "' \"Now,Mahishmati became extremely terrified and begged for being pardoned.", "Finally,Suparshva took pity on her and said-'You will get liberated from my curse only after you give birth to a calf.", "' Thus,Mahishmati started wandering all over the places in the form of a buffalo.", "Once,while wandering, she reached the bank of river Narmada,where sage Sindhudweep was doing his penance.", " A significant incident had taken place just few minutes before her arrival-Sage Sindhudweep,being unable to control himself,had ejaculated sperms after infatuated by a beautiful ogress taking bath in river Narmada,which was flowing nearby.", "The sperms fell on a rock and was eventually washed off by the swift currents of Narmada.", "\" \"As Mahishmati was thirsty,she drank water from river Narmada.", " While quenching her thirst,she also consumed the sperms as the result of which she became pregnant.", "In course of time,she gave birth to Mahishasur,who grew up to be a mighty demon king.", "The same Mahishasur wants to marry you.", "\" After finishing his story, Vidutprabha waited for Vaishnavi's response.", " Goddess Vaishnavi burst into a loud laughter and all the the three worlds became visible to the messenger,through her opened mouth.", "Vidutprabha was scarred to the hilt as he realized that the woman was extraordinary and divine.", " Jaya-a dwarpalika of Vaishnavi,told him-'Our goddess has taken a vow of celibacy,hence your master's wish will remain unfulfilled.", "' At last,Vidutprabha went back empty handed.", "In the meantime,Narad arrived there and informed goddess Vaishnavi about the deities's defeat at the hands of Mahishasur and requested her to kill the demon.", " Goddess Vaishnavi ordered her escorts to get prepared for the battle.", " She then proceeded with a huge army to fight against the demons.", "In the ensuing battle,Mahishasur's army was severely humiliated.", "Most of the demons were killed and the survivors fled from the battlefield.", " A demon named Virupaksha informed Mahishasur of the death and destruction caused by goddess Vaishnavi.", "Mahishasur was infuriated and came forward to fight the goddess.", "Goddess Vaishnavi was aware of his might,so she manifested her divine form in all her glory.", " Now,she possessed ten arms and held lethal weapons like a sword, a bow,a shield,a mace,a trident,a chakra,etc.", "in each of them.", "She then remembered lord Shiva,who appeared within a moment.", "Goddess Vaishnavi requested him to be witness to the fierce battle,which was going to take place.", " A fierce battle commenced,which lasted for ten thousand divine years.", "Mahishasur ran helter and skelter,changing his disguise frequently,in order to protect his life but goddess Vaishnavi chased him wherever he went.", "Ultimately,she killed him at 'Shata- shring' mountain by severing his head.", "All the deities heaved a sigh of relief and praised the glory of goddess Vaishnavi.", " Similarly,goddess Rudrani,who had manifested from lord Shiva and had gone to Nilgiri mountain to do her penance had killed a mighty demon named 'Ruru'.", " Ruru was a very powerful demon king.", "He ruled over Ratnapuri, which was situated in the middle of the ocean.", "He had become invincible on account of a boon received from lord Brahma.", "After being defeated by him,all the deities went to seek the help of goddess Rudrani.", " Goddess Rudrani,who is also known as 'Chamunda' finally killed Ruru-the dreaded demon.", "\" Having completed the tale,lord Varah blessed Prithvi and went back to his abode. END OF VARAH PURAN "], "next": "9", "prev": "8.11.11", "title": "Trishakti"}