{"index": "8.11.4", "image": "resized_images/Sage Gautam curses the Brahmins.png", "text": " There were many sages present at the yagya organised by Agastya.\n Some of them asked Lord Shiva as to why he had created some scriptures which appeared so confusing to human beings.\n Lord Shiva revealed to them that he had done so to protect the brahmins from the curse of Sage Gautam.\n Then he narrated the incident as it had happened --- During ancient times, Sage Gautam did an austere penance in Dandakaranya forest.\n Lord Brahma became pleased and gave him some divine seeds capable of producing eternal crops.\n Gautam then went to Saptashring mountain and made his hermitage there.\n He sowed the seeds and became pleasantly surprised when he saw rice grains sprouting up withiin few moments.\n He lived there happily with his disciples.\n In course of time, the whole country was struck by famine except the place where Gautam had his hermitage.\n One day, few sages arrived at Gautam's hermitage.\n Gautam treated them with all the respect.\n These sages enjoyed the hospitality of Gautam and stayed at his hermitage till the famine phase was over.\n Then they decided to go back to their respective native places.\n When they sought Gautam's permission,he requested him to stay for few more days.\n The sages then decided to use deceitful means for taking Gautam's permission.\n They created a superficial cow with the help of their illussionary powers and left it near the hermitage of Gautam.\n Gautam was very pleased to see that cow.\n He eulogised it by sprinkling water on it.\n Hardly had he finished his act than the cow died.\n All those wicked sages arrived there and cursed Gautam for killing an innocent cow.\n They told him that they could never live along with a person who had killed a cow.\n Gautam then requested those impostors to tell about the means by which he could become absolved from the heinous sin he had committed.\n The sages told him that the cow would become alive once Ganga water was sprinkled on its body.\n Gautam once again did a tremendous penance to please Lord Shiva.\n When lord Shiva appeared, he requested him to give a lock of his hair.\n Lord Shiva agreed to give a lock of his hair to Gautam.\n Gautam then went to the spot where the cow's body was lying.\n He sprinkled some water emanating from the hair.\n The illussionary cow disappeared within a moment and in its place was created a river.\n Right then, the sapta rishis arrived there and blessed Gautam.\n Meanwhile, Gautam realized that a wicked prank had been played on him by those wicked sages.\n He cursed those wicked sages that they would become bereft of the knowledge of Vedas and also that they would no longer be entitled to perform the vedic rituals.\n The Sapta rishis requested Gautam to have mercy on those unfortunate brahmins.\n Gautam then declared that his curse will come true only in Kaliyuga and those brahmins will not be affected by his curse in all the remaining three yugas.\n The Sapta rishis came to me and informed me about whatever had happened to those unfortunate brahmins.\n I created 'Shiva Sanhita' from my breath which is similar to Vedas as far as the importance of rituals are concerned.\n I did this for the benediction of the brahmins.\n I know that brahmins would fall from grace during Kaliyuga.\n People would give little respect to the Vedas and create their own scriptures.\n Confusion would be prevalent and people would discover false religions. ", "next": "8.11.5", "prev": "8.11.3", "title": "Sage Gautam curses the Brahmins"}