{"index": "8.11.1", "image": "resized_images/Gokarneshwar.png", "text": " The famous battle of 'Tarakamaya' had ended.\n The deities after having defeated the demons had once again regained the control of heaven.\n Lord Brahma being satisfied with the postive outcome of the war was engrossed in his meditation when Sanat Kumar arrived and asked--\"O Lord! I am anxious to know about the origin of three famous Shiva lingas--Uttar-Gokarn, Dakshin-Gokarn and Shringeshwar.\n What made Lord Shiva to take the form of a deer (Gokarn)?\n Please enlighten me on all these subjects.\n\" Lord Brahma replied--The northern peak of Mandarachal mountain is famously known as Munjawan.\n This place is divinely beautiful and the stones and rocks over there glitter like diamonds.\n It has many rivers, lakes and springs.\n The atmosphere overthere is so serene that even the deities are tempted to have their abodes at that place.\n This sacred place is graced by the presence of 'Sthanu Maheshwar'.\n Nandi-- the lord of all the Ganas of Shiva, was a virtuous brahmin in treta yuga.\n Once, he did an austere penance to realize lord Shiva.\n The penance lasted for one thousand years.\n At last Lord Shiva became pleased and appeared before him.\n Lord Shiva blessed Nandi with an appearance similar to him(Shiva).\n Lord Shiva said-- From today onwards you will be blessed with three eyes just like me.\n You will be worshipped by the deities and demons alike.\n You will be immortal and time and age will have no effect upon you.\n You are being granted with the lordship of all my Ganas.\n It will be your duty to stand guard at the entrance of my dwelling place.\n Lord Shiva then informed Nandi that in a short time the deities would be visiting him(Nandi).\n Due to some reason Lord Shiva had pledged not to give deities an opportunity to see his physical form.\n So, after blessing Nandi, Shiva disappeared and went to live in Sleshmatak forest in the form of a deer.\n Nandi was unaware of this fact.\n Meanwhile, after being blessed by Shiva, Nandi had attained a divinely radiant form.\n When the deities saw Nandi possessing three eyes instead of two, they immediately understood that this could not have happened without the blessing of Lord Shiva.\n All the deities arrived at Munjawan peak and requested Nandi to reveal Shiva's whereabouts.\n Nandi expressed his helplessness and told them that he was not aware where Shiva went after blessing him.\n He requested the deities to find out Shiva on their own.\n The deities searched for Shiva in all the three worlds but could not find him.\n I (Lord Brahma) was also present in the search-team of the deities.\nI sat down to meditate.\n In the deep state of meditation, I came to know that Shiva was living in the form of a deer in sleshmatak forest.\n I revealed this fact to the deities.\n All the deities then went into the sleshmatak forest and recognised Shiva living in the form of a deer.\n The deer (Shiva) had one horn on its head.\n All the deities ran towards the deer with the desire of catching hold of it.\n Indra held the topmost part of the horn with a firm grip while I (Lord Brahma) held its middle portion.\n Similarly, Lord Vishnu held the lower part.\n Very soon, the horn got uprooted because of the force which was being applied on it.\n Lord Shiva vanished out of our sight.\n We were left behind with three pieces of horn in our hands.\n We cursed ourselves for our bad luck.\n Suddenly, we heard Shiva's voice instructing us to install those pieces of horns at that very place and worship them.\n The upper part of the horn become famous as Uttar Gokarn, while it's middle portion became famous as Dakshin Gokarn.\n The part of the horn, which Vishnu installed became famous as 'Shringeshwar'.\n All these three places have incomparable religious significance and are situated in Nepal.\n Sleshmatak forest is situated at the distance of 2 miles from the famous Pashupatinath temple.\n\" Sanatkumar thanked Lord Brahma for enlightening him on these secret topics. ", "next": "8.11.2", "prev": "8.11", "title": "Gokarneshwar"}