{"index": "8.11.5", "image": "resized_images/Prakriti and Purush.png", "text": " Once, Lord Shiva while describing about the incident when he had a divine glimpse of Lord Narayan, told Sage Agastya -- 'Purusha' is none other than Lord Narayan himself and Prakriti is the medium through which he manifests his powers.\n I have been fortunate to have a divine glimpse of this Purush.\n Lord Brahma after having created me, instructed me to create.\n But, I did not know how to create.\n So, I decided to do penance and went into the ocean.\n In the ocean, I saw an entity who was no more than the size of a thumb.\n He was purush himself and I immediately recognized him.\n I started meditating on the form of that almighty--Purush.\n Suddenly, eleven more entities emerged before me.\n They were all very radiant and the water had become hot on account of the heat emanating from their bodies.\n I asked them as to who they were but they did not give any reply and went out of my sight.\n The next moment, I saw an extremely handsome man.\n I asked him about his identity and also about the eleven entities whom I had seen few moments ago.\n Those entities were the eleven Aadityas and had gone to help Lord Brahma in the process of creation.\n Then he said--I am Narayana--the omnipresent lord.\n I am blessing you with 'divine vision' so that you can see my divine appearance.\n' When I fixed my glance at Narayan I was amazed to see the same thumb-sized Narayana standing before me.\n But, now He was no longer having the size of a thumb.\n On the contrary he had expanded his body to such an extent that He appeared like a giant.\n I also saw Lord Brahma sitting on a lotus flower emanating from his navel.\n I eulogized HIM with complete devotion.\n HE blessed me and said--'You are eternal and nothing is beyond your knowledge.\n You will be worshipped by the deities.\n I shall take twelve incarnations in the coming eras and shall worship you in each of my incarnation.\n' Having said this, Lord Narayana disappeared.\n This was how I saw the divine form of the 'Purush'--Lord Narayan. ", "next": "8.11.6", "prev": "8.11.4", "title": "Prakriti and Purush"}