{"index": "8.2.1", "image": "resized_images/Pitras and the Significance of ‘Shraddh.png", "text": " Once,sage Markandeya arrived at Naimisharanya to see sage Gaurmukh.Sage Gaurmukh was delighted to find such an enlightened soul at his hermitage.After the formalities were over, Gaurmukh requested him to shed light on the venerability of ancestors and the significance of shraddh rituals. Sage Markandeya replied-\"Lord Brahma,after having created the sapta rishis instructed them to worship him(Lord Brahma) but they became so arrogant that they started to worship themselves.Lord Brahma felt insulted and so he cursed them of becoming bereft of all the knowledge.In course of time,the sapta rishis had numerous sons.After the death of the sapta rishis,all the sons performed shraddh so that their souls could rest in peace.The sapta rishis were also famously known as 'Vaimanik'because they had manifested from the mind of Brahma.\" Sage Gaurmukh was listening to Markandeya's utterances with rapt attention.He asked about the most appropriate time for performing shraddh and also about the number of 'ganas' each of the pitras were supposed to have.Sage Markandeya replied-\"Pitras living in the heaven are known as 'somap pitras' are believed to be the most privileged ones among all the pitras.They enjoy the most delicious beverage-somaras.Their life-span extends for the full period of kalpa and they worship 'marutas'.Sage Marich belongs to this category of pitras.\" Pitras belonging to the category of 'vairaj' are revered even by the marutganas.Sanak comes under this categoty of pitras.Each of these pitras have seven ganas.Similarly,pitras known as 'bhaswar' have their abode in the world called 'santanak'.These pitras are revered even by the deities as all of them are 'brahma vadis'(one who has realized Brahma).They remanifest themselves after every hundred yugas. People belonging to any caste can worship the revered 'pitras' with an appropriately modified rituals and obviously with the permission of the brahmin.Some of the prominent pitras are 'Vasu','Kashyap','Marichi' 'Sanak' etc. ", "next": "8.2.2", "prev": "8.2", "title": "Pitras and the Significance of ‘Shraddh"}