{"index": "8.3.4", "image": "resized_images/Lord Ganapati.png", "text": [" King Prajapal then asked sage Mahatapa about the manifestation of lord Ganapati and about the significance of chaturthi in terms of Ganapati's worship.", "Mahatapa narrated the following tale- \"Once,all the deities went to seek Shiva's help in sorting out a peculiar problem they were faced with- while they experienced all sorts of hurdles and problems in their work resulting into repeated failures in their work,the demons on the contrary accomplished all their work successfully without any problem.", " When lord Shiva learnt about their problem,he burst into laughter.", "Hardly had he stopped laughing than a radiant adolescent manifested himself from his opened mouth.", "The child was so divinely charming that Parvati,who was sitting beside Shiva looked at him without dropping her eyelids.", "When Shiva found her staring at the child he became jealous.", "Jealousy transformed into anger and Shiva cursed the child-'From now onwards your face will resemble an elephant and your belly will become large as a pot.", "In the name of yagyopavit you would have nothing but a snake hanging across your shoulder.", "' The child was none other than Ganesh.", "Lord Shiva's anger did not subside even after having cursed Ganesh.", " He was still trembling in anger and was sweating profusely.", "Numerous Ganeshas manifested themselves from those sweat-drops and each of them had a head of an elephant as well as a large belly.", "Suddenly, lord Brahma appeared and requested lord Shiva by saying-'You should make this divine child,who has manifested from your mouth,the lord of all these Vinayakas.", "Thus,lord Shiva made Ganesh the lord of all the Vinayakas and blessed him-'You will be the first deity to get worshipped in any ritual.", "' Chaturthi has deep association with the worship of lord Ganesh,as it was on this very day that he had manifested himself.", "Having prasad,prepared from sesame seeds and worshipping lord Ganesh on this day is believed to bring great auspiciousness.", "A devotee who worships lord Ganesh on chaturthi never experiences any kind of obstacle in his work. "], "next": "8.3.5", "prev": "8.3.3", "title": "Lord Ganapati"}