{"index": "8.3.3", "image": "resized_images/Goddess Parvati.png", "text": " King Prajapal asked Mahatapa about the reason why goddess Gauri-the epithet of power,had to take incaranation.\nSage Mahatapa replied -\"Goddess Gauri manifested from lord Narayan and was offered to Rudra as his consort by lord Brahma.\nLord Brahma then instructed Brahma to begin creation but Rudra being free from all kinds of worldly attachment refused to oblige lord Brahma and engaged himself in austere penance.\nGoddess Gauri then merged her identity with Brahma,who later on created his seven 'manas-putras'.\n In course of time,Gauri was born as the daughter of Daksha Prajapati and hence came to be known as 'Dakshayani'.\n Once, Daksha Prajapati organised a grand yagya in which all the seven manasputras were assigned specific responsibilities.\nMeanwhile,Rudra came out from his meditation and was extremely furious to see the earth occupied by countless creatures.\nHe thought-'Brahma had requested me to create then who is responsible for all these creation?\n Who has dared to transgress my authority ?\n' As Rudra stood wondering,suddenly he heard the sound of the mantras being chanted at the yagya performed by Daksha.\nNow, Rudra's fury crossed all limits resulting into the emergence of numerous spirits and ghosts from his ears.\nHe then went to the oblation-site accompanied by the ghosts and started destroying it.\nLord Vishnu tried to protest as a result of which a fierce battle was fought between both of them.\nIt was only on lord Brahma's intervention that both of them stopped fighting.\nLord Brahma said-'From now onwards Rudra would become famous as 'Har' while Vishnu would be known as 'Hari'.\nHe then directed the deities to eulogize Rudra and give his due share of the yagya being performed by Daksha Prajapati.\n' Rudra became pleased by deities's eulogy and blessed them.\nThis way,Daksha Prajapati was able to accomplish his yagya with the blessings of Rudra.\nIn course of time,Rudra married Gauri-the daughter of Daksha Prajapati.\nOnce,Gauri went to her father's place to attend a yagya ceremony against the wish of her husband.\nOn seeing her,Daksha Prajapati started cursing Rudra.\nGauri was so enraged by her father's attitude that she gave up her life by jumping into the sacrificial fire meant for the yagya.\nLater on,she took rebirth as Parvati-the daughter of Himalaya.\nParvati did an austere penance to get Shiva as her husband.\nUltimately her desire was fulfilled and she became the consort of lord Shiva.\n The tithi of tritiya is very deeply attached with the worship of goddess Parvati because all the important events of her life(birth,marriage,etc.\n)took place on this day.\nThis is the reason why tritiya is attributed to the worship of goddess Parvati.\nA woman who observe a fast on this day enjoys a blissful married life.\nOne important ritual related with the austerity of tritiya is avoiding the usage of salt on this day. ", "next": "8.3.4", "prev": "8.3.2", "title": "Goddess Parvati"}