{"index": "8.7.18", "image": "resized_images/Gokarn Teertha.png", "text": " Lord Varah told Prithvi about the greatness of Gokarna teerth- \"Long long ago there lived a vaishya named Vasukarn at Mathura. Sushila,his wife was deeply religious but inspite of that she was issueless.One day,she had gone to take her bath in river Saraswati where she found many women taking their bath.The children of these women were playing nearby.Sushila became very sad and being unable to control her emotions started crying.\" \"A sage saw her crying and asked her as to what made her so sad. Sushila narrated her woeful tale to him.The sage took pity on her and advised her to worship lord Gokarna.The sage said-'You will definitely be blessed with a son.' Sushila went home and narrated the whole incident to her husband.Both of them started worshipping lord Gokarna Mahadev with total devotion.After ten years,a son was born to them. Vasukarn named that child after lord Gokarna to express his gratitude to the deity.\" \"In course of time,Gokarna grew up and got married but even after a long time he did not have a progeny.So,his father married him to three more women,one after another, but even this did not prove to be of any help to Gokarna because he remained a sonless person.This made Gokarna very sad and he engaged himself in various charitable activities thinking that the virtues thus attained might bless him in begetting a son.He got constructed many temples and ordered wells to be dug up for the benifit of the travellers.Very soon,all his money was spent and he became worried about the future of his family.So,he decided to go to distant places to earn wealth.\" \"Once,while on his journey he met a divine parrot who possessed tremendous knowledge.Gokarna was very much impressed by the parrot's knowledge.He asked the parrot from where had it imbibed such divine knowledge.The parrot revealed to him that he was Shukodar in it's previous birth and was a learned man.He had attained the form of parrot due to the curse of sage Shukdev. But,sage Shukdev had been kind enough to allow him to retain all the knowledge in his next birth.The parrot also told Gokarna how it had been kept inside a cage by a fowler and requested him to help it out from the captivity.\" \"Gokarna requested the fowler to give the learned parrot to him. The fowler agreed but asked for all the virtues attained by Gokarna in return.Gokarna happily agreed to donate all his virtues and proceeded with that parrot.Now, Gokarna had become bereft of all his virtues he had attained so far.Once,while he was on a voyage in connection with his trade the ship was caught in a severe cyclone and the chances of survival looked very bleak.All his fellow travellers had a misconception that they had been struck by the misfortune only because of Gokarna's sins.The parrot was saddened after hearing what people said about his master.It decided to help him and flew away towards north.While flying it found a vishnu temple where many divine women and other creatures had gathered to worship.The descendants of Jatayu were also among them.The parrot narrated the woeful tale of his master to all of them.All the divine birds decided to help Gokarna.\" \"The divine birds instructed the parrot to follow them and then flew towards the place where Gokarna's ship was stranded.Finally, they were successful in rescuing Gokarna and bringing him back to the same temple.Gokarna worshipped lord Keshav and performed the rituals of tarpan in the name of his ancestors.In the meantime,all the divine women also arrived there to worship.They were pleased to meet Gokarna and gave him divine food to eat.They also allowed him to stay there for as long as he wished.\" \"Meanwhile the ship managed to reach the sea shore.Gokarna's companions met his parents and narrated the whole incident to him. Gokarna's parents were filled with sorrow at the fate of their son.On the other hand,Gokarna continued to live in that temple for a long period.He was worried about his father as it had been a long time since he saw him.He sent the parrot to bring his news.The parrot flew away to Mathura and met his father-Vasukarn. Vasukarn thanked the parrot for saving his son's life.The parrot then flew back on his return journey and gave the good news to Gokarna.\" \"One day Gokarna found the divine ladies extremely sad.When asked,they told him that the king of Ayodhya had destroyed the beautiful gardens of Mathura and this was the reason for their sadness. Gokarna assured them that he would convince the king to abandon his evil plan if he got a chance to meet him.The divine women then provided Gokarna with a divine aircraft boarded on which he reached Mathura.Gokarna met the king and managed to convince him against destroying beautiful gardens.The king was extrtemely impressed by his knowledge and presented great amount of wealth to him.This way all the divine women became happy once again.\" \"Gokarna then went home and met his family members.His parents and his wives were very pleased to see him.Gokarna then got constructed a shukdev temple to honour his saviour-the learned parrot.It was only because of that parrot that he could acquire such wisdom and knowledge.To express his gratitude to the fowler he donated all the virtues he had acquired by taking bath in the holy confluence(triveni) because had it not been for the fowler he would never have got the knowledgeable parrot.Gokarna lived happily for a long time.\" ", "next": "8.8", "prev": "8.7.17", "title": "Gokarn Teertha"}