{"index": "8.7.2", "image": "resized_images/Mayapuri (Haridvara) Teertha.png", "text": [" Narrating about the sanctity of Mayapuri,lord Varah told Prithvi- \"There lived a brahmin named Somsharma at Mayapuri.", "He was a great devotee of mine(lord sri Hari)and had an impossible desire of witnessing my divine powers by his mortal eyes.", "I tried to make him understand about the futility of his desire but to no avail.", " Finally I was left with no option but to fulfil his wish.", "One day Somsharma had gone to take his bath in the holy Ganges.", "Hardly had he taken a dip than he found himself experiencing the pangs of birth in the womb of a nishad woman.", "Evidently,lord sri Hari had began giving a glimpse of his divine powers to Somsharma.", "It was a terrible experience for him and he vowed to lead a chaste life as soon as he came out of the womb.", "\" \"Unfortunately,he forgot everything about his vow once he took rebirth as a girl.", "In course of time,the girl grew up and married a young nishad.", "She had many children from him.", "One day,the nishad girl who in reality was Somsharma,went to take a bath in the holy Ganges.", "As soon as she entered into the river,she got transformed into a hermit.", "She was filled with extreme bewilderment but this was not the end,as there were more surprises to come.", "\" \"The hermit(previously nishad and originally Somsharma)came out of thr river and looked all around in amazement.", "He then sat down to meditate and very soon he was engrossed in his meditation.", "In the evening,some sages arrived and said-'Sir! how come you are sitting here?", "You had gone to take a bath.", "We became anxious and started searching for you when you did not return till evening.", "\" \"The hermit was bewildered by the turn of events as he was aware of every incident that had occured.", "He was also well aware that he had spent fifty years as nishad-woman but according to the statements of hermits he had been absent only for few hours.", "The hermit was totally confused about his real identity.", "I(lord Varah) felt pity on his miserable condition and decided to lift my magic spell.", "I asked him whether his wish of witnessing my divine powers had been fulfilled or not.", "The hermit eulogized me and agreed that it was impossible for any mortal to understand the ways of Aimighty.", "I then blessed him and transformed him into Somsharma once again.", "\" Such is the grandeur of Mayapuri-the sacrosanct place where lord sri Hari has manifested his divine powers.", "A devotee who goes on a pilgrimage to Mayapuri never gets entangeled in the worldly illusions. "], "next": "8.7.3", "prev": "8.7.1", "title": "Mayapuri (Haridvara) Teertha"}