{"index": "8.7.1", "image": "resized_images/Kokamukh Teertha.png", "text": " Describing the holiness of Kokamukh-teerth,lord Varah narrated a tale to Prithvi-\"Once,a fisherman was trying to catch a large fish in a lake situated at Kokamukh.\nSuddenly,a hawk which was flying in the sky, descended down and after picking the fish in it's beak tried to fly away.\nBut,as the fish was a large one, the hawk could not hold it for too long.\nAs a result,the hawk fell on the ground being unable to bear the weight of the fish.\nBut amazingly,the hawk turned into a handsome prince as soon as it touched the ground.\n\" \"In the meantime,the fisherman's wife arrived there carrying some meat-pieces in her hand.\nA kite,which was flying in the sky tried to snatch those meat- pieces.\nSeeing this,the fisherman killed that kite with one shot of his arrow.\nIn course of time,the kite took rebirth as a princess of Chandrapur.\nShe was extremely beautiful but hated men.\nSimilarly,the fish was reborn as a prince.\nAs the destiny would have liked it,both of them got married.\nThere was a dramatic change in the attitude of the princess after the marriage as she no longer hated men.\nOn the contrary,she loved her husband so much that she dreaded the thought of separation for even a moment.\n\" \"One day,the prince had a severe headache which showed no sign of subsiding.\nThe princess became very worried and summoned the royal physician.\nThe physician left no stone unturned to cure his royal physician but without any success.\nSomehow,the prince remembered everything about his previous birth and had a firm belief that he would be cured of his illness once he reached Kokamukh-the sacrosanct place of pilgrimage.\n So he decided to go there accompanied by the princess.\n\" \"Both of them reached a place at Kokamukh where they saw the remains(skeleton)of a fish lying on the ground.\nThe prince revealed to his wife that he was a fish in his previous birth and that the skeleton was his.\nThen he went on to describe the cause of his headache which according to him was due to the injury sustained in his past birth when he had been badly mauled by a hawk.\nThe princess was aware of her past birth as a kite,so she revealed how she had been killed by a fisherman in her previous birth.\nShe also told her husband -'Dying at Kokamukh in my previous birth prove to be a blessing to me as I was reborn as a princess.\nHad it not been so,I would certainly have not born as a princess.\n\" \"Both of them worshipped lord vishnu and as a result the prince was cured of his severe headache.\nSuch is the greatness of Kokamukh-the reliever of all pains and miseries.\" ", "next": "8.7.2", "prev": "8.7", "title": "Kokamukh Teertha"}