{"index": "8.9.2", "image": "resized_images/Last Rites: Ashaucha and Pinda Kalp.png", "text": [" 'Ashaucha' means impurity,so it is the period during which the son of the deceased is considered to be impure.", "The period begins from the day on which the death has occured and continues for the following ten days.", "'Pinda-daan' means offering certain kind of food to the deceased in the belief that it would satiate his soul.", " Lord Varah,while describing about the rituals which are supposed to be performed during the period of ashaucha and also the rituals of making pinda daan,told Prithvi-\"The observer of shraddh rituals should take his bath in a river on the third day from the day on which death has occured.", "After taking his bath,he should offer three 'pindas'(consisting of cereal flour) as well as three palmful of water into the river in the name of the deceased.", "On the fourth,fifth,sixth and seventh days,he should make offerings of one pinda and one palmful of water in the name of the deceased.", " He should never make offerings of the Pindas at the same place on the contrary he should select diferent spots for this purpose.", "\" \"On the tenth day he should get his hair tonsured and change his clothes.", " His relatives (same-gotra) should take their bath after applying an ointment prepared from sesame seeds, amla and oil on their bodies.", " 'Ekodishta Shraddh' is performed on the eleventh day.", " For this ritual to be performed, the concerned person should first purify himself and then offer Pinda to the deceased person as well as other manes.", " The rituals of Ekodishta Shraddh are same for all the four castes.", " The brahmins should be invited and fed on the thirteenth day.", " While feeding the brahmins a religious vow (Sankalpa) is taken in the name of the deceased person.", "\" \"For the purpose of offering 'pinda', an 'altar' should be made at river-bank or any other suitable place.", " The rituals can be performed either facing south or east.", " Offering 64 (Pindas) is considered to be ideal.", " Pinda daan can also be made under a peepal tree but the place should be well protected from the reach of animals like dogs, cock, pigs, etc.", " It is believed that if these animals visit the place where 'Pinda daan' is being made then it becomes difficult for the soul to attain liberation.", " The rituals of Pinda daan should be performed at a pure place otherwise there is a fear of soul going to hell.", " The name and the gotra of the deceased person should be pronounced while performing the rituals.", " After the rituals are complete all the assembled persons may sit down to have their meal.", "\" Donating things like an umbrella, clothes, cereals, ornaments to the brahmins are believed to be auspicious. "], "next": "8.9.3", "prev": "8.9.1", "title": "Last Rites: Ashaucha and Pinda Kalp"}