{"index": "8.9.1", "image": "resized_images/Last Rites: Pitra Yagya.png", "text": " Prithvi requested lord Varaha to define the meaning of 'Pitra' yagya(rituals pertaining to last rite) and it's significance.\n Lord Varaha replied-\"Sage Nimi was the first person to perform the the rituals of pitra-yagya after the death of his son Aatreya.\nSage Aatreya is famous for his penance which he did for ten thousand years.\nWhen Aatreya died,his father-Nimi was filled with grief.\nNimi tried his best to overcome his sorrow but to no avail.\nHe mourned his son's death for three consecutive nights.\nHe thought that perhaps the performance of 'shraddh' rituals would be the best means to get rid of his sorrow.\nSo,he decided to perform the 'shraddh' rituals on the twelfth day of 'magh'.\nOn that day,he invited many brahmins and fed them with the same delicacies which Aatreya would have liked to eat.\nHe performed all the rituals well within a day which would otherwise have taken a week to perform.\nHe also performed the rituals of 'pinda daan' by donating cereals,vegetables and fruits.\nWhile performing the rituals of pinda-daan,he took some kusha grass in his hands and after pointing it towards south chanted Aatreya's name and gotra.\nIn the night,Nimi sat on the seat of deer skin underneath which kusha grass had been spread.\nHe then tried to concentrate on the tip of the nose.\nBut,inspite of all his efforts there was no sign of mental peace he was so desperately seeking and thought of his dead son continued to torment him.\n\" \"Nimi was troubled by a guilt that perhaps he had set a bad precedent by performing the rituals of pinda daan because nobody in the past had ever performed the rituals.\nHe was worried as to what would the coming generation think of him.\nHe was so much troubled by the thought that he could not sleep for the whole night.\nNext morning he got up,still worried.\nHe remained in a disturbed state of mind for many days.\nAt last,when it became too much for him to handle,he decided to end his life.\nIn the meantime,sage Narad arrived there and assured him that there was nothing to be worried about as whatever he had done was most appropriate.\nNarad also convinced him that even his(Nimi's)dead father would vouch for this fact.\n\" \"Nimi remembered his father who had died long ago.\nHis father revealed to him that the rituals which he had performed were in fact the rituals of 'pitra- yagya'.\nDescribing the importance of pitra-yagya Nemi's father told him- 'The name pitra-yagya' was given by none other than lord Brahma himself who was the first one to perform the rituals.\nLater on,lord Brahma had described the rituals to Narad and this is why Narad was convinced that you had committed no wrong.\nNemi's father then described as to what should be done with regard to the person who lay dying- 'When the death approaches a person looses his consciousness and becomes extremely fearful.\nAt that time,a brahmin should constantly study the scriptures so that he could die in peace.\nDonating a cow helps to pacify the soul of a dead person.\nIf sacred mantras are whishpered in the ears of a dying person he dies peacefully.\nWhen the death seems imminent,a morsel of 'Madhupark'(mixture of curd,water,honey and clarified butter) should be kept in the mouth of the dying person.\nWhile doing this one should pray to the almighty to liberate the dead man's soul.\n' 'The dead body should then be carried and kept under a tree where it is purified by smearing ghee,oil,perfumes,etc.\nIt is then carried to creamation ground and kept at the bank of a river-feet pointing towards south.\nAfter this,the dead body should be bathed by remembering all the sacred places of pilgrimage.\nIt should then be kept on the pyre-feet pointing south.\nThe pyre should be lit and the following prayer should be said-O Agnideva!I pray to you to burn all the sins committed by this person so that he attains to heaven.\nNow,circumambulation around the pyre is made and the pyre is lit towards the head side.\n' 'After consigning the dead body to flames,the rituals of 'tarpan' and 'pinda-daan' are performed.\nAll the people assembled there should purify themselves before returning home.\nThe period starting from the time the dead body is consigned to flames till the next ten days is called 'Ashaucha'.\nIt is applicable to all the relatives coming from the same gotra of the deceased.' ", "next": "8.9.2", "prev": "8.9", "title": "Last Rites: Pitra Yagya"}