{"index": "9.1", "image": "resized_images/PRELIMINARIES.png", "text": " There was a forest known as naimisharanya.\n The sages (maharshis) arranged for a sacrifice (yajna) in this forest and the ceremony went on for twelve years.\n Naimisharanya forest was a wonderful place to arrange sacrifices in.\n The climate was pleasant.\n There were trees full of climate was pleasant.\n There were trees full of flowers and fruit.\n There was no shortage of food in the forest, and animals, birds and sages lived thee happily.\n Many sages came to attend the sacrifice that had been arranged in naimisharanya.\n With them was Romaharshana (alternatively Lomaharshana).\n Vedavyasa's disciple.\n Vedavyasa had instructed this disciple of his in the knowledge of the Puranas.\n The assembled sages worshipped the learned Romaharshana and said, \"Please tell us the stories of the Puranas.\n Who created the universe, who is its preserver and who will destroy it?\n Please instruct us in all these mysteries\".\n Romaharshana replied, \"Many years ago, Daksha and the other sages had asked Brahma these very questions.\n I have learnt about Brahma's replies from my guru) teacher) Vedavyasa.\n I will relate to you what I know\".\n In the beginning, there was water everywhere and the Brahman (the divine essence) slept on this water in the form of Vishnu.\n Since water is called nara and since ayana means a bed, Vishnu is known as Narayana.\n In the water there emerged a golden egg (anda).\n Brahma was born inside this egg.\n Since he created himself, he is called Svayambhu, born (bhu) by himself (svayam).\n For one whole year, Brahma lived inside the egg.\n He then split the egg into two and created neaven (svarga) and the earth (prithivi) from the two parts of the egg.\n Skies, directions, time, language and senses were created in both heaven and earth.\n From the powers of his mind, Brahma gave birth to seven great sages.\n Their names were Marichi, Atri, Angira, Pulastya, Pulaha, Kratu and Vashishtha.\n Brahma also created the god Rudra and the sage Sanatkumara. ", "next": "9.2", "prev": "9", "title": "PRELIMINARIES"}