{"index": "9.10", "image": "resized_images/SAGARA.png", "text": [" Trishanku's son was Harishchandra and from Harishchandra was descended a king named Bahu.", " Bahu devoted too much time to pleasurable pursuits.", " The upshot of this was that the defence of the kingdom was not properly taken care of.", " Enemy kings seized this opportunity to attack Bahu's kingdom.", " They drove Bahu out and Bahu went off to the forest with his wife Yadavi, The enemy kings who dislodged Bahu were led by the Haihaya and Talajangha kings.", " They were aided by the Shakas, Yavanas, Paradas, Kambojas and Pahlavas.", " King Bahu died in the forest.", " His wife Yadavi desired to die on her husband's funeral pyre.", " But since Yadavi was pregnant at the time, the sage Ourva persuaded her that such an act would be a sin.", " He brought Yadavi to his own hermitage and began to take care of her.", " Bahu had also a second wife and she had once tried to poison Yadavi.", " The poison (gara) had however done Yadavi no harm and emerged when the baby was born.", " Since the baby was born together with poison, he came to known as Sagara.", " The sage Ourva took care of Sagara's education.", " He imparted to Sagara the knowledge of all the shastras and also the usage of weapons.", " Amongst other things, Sagara acquired the skill of using a divine weapon known as agneyastra.", " When he grew up, Sagara attacked the Haihaya kings and defeated them through the use of agneyastra.", " He then defeated the Shakas, Yavanas, Paradas, Kambojas and Pahlavas and was about to kill them all.", " But these enemy kings fled to the sage Vashishtha for refuge and Vashishtha persuaded Sagara not to kill his enemies.", " Instead, the heads of the Shakas were half shaven off.", " The Yavanas and Kambojas had their heads completely shaven.", " The Pahlavas were instructed that they would have to keep beards.", " These enemy kings also lost all right to follow the religion laid down in the Vedas.", " Amongst the other kings who Sagara defeated were the Konasarpas, the Mahishakas, the Darvas, the Cholas and the Keralas.", " King Sagara had two wives.", " The first was named Keshini and she was the daughter of the king of Vidarbha.", " The Brahma Purana does not tell us the name of the second wife but from the Mahabharata we know that it was Sumati.", " Keshini and Sumati had no sons.", " They therefore began to pray to Ourva so that they might have sons.", " Ourva was pleased at these prayers and said, \" Both of you will have sons.", " But one of you will have a single son and the other will have sixty thousand sons.", " Tell me, who wants what.", "\" Keshini asked for a single son and Sumati asked for sixty thousand sons.", " In due course, Keshini gave birth to a son named Panchajana.", " Sumati gave birth to a gourd.", " Inside the gourd there was a lump of meat.", " The gourd was placed inside a pot full of clarified butter (ghrita).", " And from the lump of meat were born sixty thousand sons.", " King Sagara proceeded to conquer the entire earth.", " As a recognition of this conquest, he initiated an ashvamedha yajna (horse sacrifice).", " In this ceremony, the sacrificial horse is left free to wander all over the earth.", " The sixty thousand sons accompanied the horse as its guards.", " The horse eventually reached the shores of the ocean that lies towards the south-east.", " While Sagara's sons were resting, the horse was stolen.", " The sons started to look for the horse and began to dig up the sands in their search.", " In this process, they came upon the sage Kapila.", " Kapila had been meditating and his meditation was disturbed by the terrible din that Sagara's sons made.", " He gazed at them in fury and all but four of the sons were burnt to ashes.", " The four sons who were saved were named Varhiketu, Suketu, Dharmaketu and Panchajana.", " The Brahma Purana is slightly confused here.", " Was Panchajana Keshini's son or Sumati's son?", " There is some inconsistency with the account given in the Mahabharata.", " In the Mahabharata, it is Keshini who gave birth to sixty thousand sons and it is Sumati who had a single son named Asamanja.", " Also in the Mahabharata, all sixty thousand sons were burnt to ashes.", " The Brahma Purana also tells us that the sacrificial horse was obtained by Sagara from the ocean.", " This is the reason why the ocean is referred to as sagara.", " To come back to the account given in the Brahma Purana.", " Panchajana's son was Amshumana and Amshumana's son was Dilipa.", " Dilipa had a son named Bhagiratha.", " Bhagiratha brought down the river Ganga from heaven to earth and thus redeemed his ancestors who had been burnt to ashes by Kapila.", " It was because of this that the river Ganga came to be known as Bhagirathi.", " From Bhagiratha was descended Raghu.", " Raghu's son was Aja, Aja's son Dasharatha and Dasharatha's son Rama. "], "next": "9.11", "prev": "9.9", "title": "SAGARA"}