{"index": "9.12", "image": "resized_images/YAYATI.png", "text": " In the lunar dynasty, there was born a powerful king named Nahusha.\n He married Viraja and they had six sons named Yati, Yajati, Samyati, Ayati, Yati, and Suyati.\n Yati became a hermit.\n So although Yayati was not the eldest, he was crowned king after Nahusha.\n Yayati had two wives.\n The first was Devayani, daughter of Shukracharya.\n And the second was Sharmishtha, daughter of Vrishaparva, the king of the danavas.\n Devayani had two sons named Yadu and Turvasu and Sharmishtha had three sons named Druhya, Anu and Puru.\n Yayati conquered the whole earth and ruled over it.\n When he became old, he divided the earth amongst his five sons.\n Yadu was given the lands to the east, Puru the lands in the center, Turvasu the lands to the south and south-east, Druhya those to the north and Anu those to the west.\n Yayati gave up his weapons and decided to travel throughout the world.\n He called Yadu to him and said, \"I wish to explore the world and my old age is a hindrance.\n Please accept my old age and give me your youth in return.\n\" Yadu refused.\n \"I will not,\" he said.\n \"One cannot eat well when one is old, nor can one pleasure the comforts of the world.\n Old age is not pleasant.\n Ask one of my brothers instead.\n\" Yadu's refusal angered Yayati.\n He cursed Yadu that he or his descendants would never be kings.\n Yayati next requested Druhya, Turvasu and Anu, but they too refused and were similarly cursed by their father.\n But Puru agreed to his father's request and gladly accepted the old age.\n He was blessed by his father.\n After many years had passed, Yayati got tired of the world and returned Puru's youth to him.\n He accepted back his old age and retired to the forest to mediate.\n From Puru was descended King Bharata after whom the land came to be known as Bharatavarsha.\n Also in this line was King Kuru, after whom all the descendants came to be known as Kauravas.\n The sacred place named Kurukshetra owes its name to King Kuru.\n From Turvasu were descended the kings of Pandya, Kerala, Kola and Chola.\n From Druhya were descended the kings of Gandhara.\n The horses of the Gandhara kingdom are famous.\n Yadu had five sons, Sahasrada, Payoda, Kroshtu, Nila and Anjika.\n Sahasrada's descendants were the Haihayas, amongst whom the most famous was Kartyavirya Arjuna.\n Arjuna pleased the sage Dattatreya and became invincible.\n He also had a thousand arms.\n Arjuna's greatest deeds were his defeat and imprisonment of Ravana, king of Lanks.\n Kroshtu's descendants were Vrishni and Andhaka and in the Vrishni line was born Krishna. ", "next": "9.13", "prev": "9.11", "title": "YAYATI"}