{"index": "9.13", "image": "resized_images/GEOGRAPHY.png", "text": " Having heard accounts of the solar and lunar dynasties, the sages requested Romaharshana. \"Tell us a little about the geography of the world. What does the earth look like? What are its limits?\" Romaharshana obliged. The earth is divided into seven regions (dvipas). Their names are Jambudvipa, Plakshadvipa, Shalmaladvipa, Kushadvipa, Krounchadvipa, Shakadvipa and Pushkaradvipa. These regions are surrounded by seven oceans and their names are Lavana, Ikshu, Sura, Sarpi, Dadhi, Dugdha and Jala. Jambudvipa is in the center and right in the middle of Jambudvipa is Mount Sumeru. To the south of Sumeru are the mountains Himavana, Hemakuta and Nishadha and to the north of Sumeru are the mountains Nila, Shveta and Shringi.Jambudvipa itself is divided into several regions (varshas). For example, Sumeru is in the middle of Ilavritavarsha. Braratavarsha is to the south of Sumeru. To the east of Sumeru is Bhadrashvarsha and to the west is Ketumalavarsha. Harivarsha lies to the south and Ramyakavarsha to the north. Still further north is Hiranmayavarsha and beyond that, Uttara Kuruvarsha. Brahma's city is on the peak of Sumeru. It is there that the river Ganga descends from heaven and gets divided into four tributaries. Sita flows eastwards, Chakshu westwards, Bhadra Northwards and Alakananda southwards into Bharatavarsha. There are seven major mountain range sin Bharatavarsha and their names are Mahendra, Malya, Sahya, Shuktimana, Riksha, Vindhya and Pariyatra. Bharatavarsha itself is divided into nine regions (dvipas). The names of eight of these regions are Indradvipa, Soumya, Gandharva and Varuna. The ninth region is completely surrounded by the ocean in all directions. To the east of Bharatavarsha live the Kiratas and to the west the Yavanas. Below the earth lie the seven regions of the underworld (Patala). Their names are Atala, Vitala, Nitala, Sutala, Talatala, Rasatala and Patala. The daityas, danavas and the snakes (sarpa) live there. The underworld is a wonderful place, more beautiful than heaven itself. The sage Narada once went on a trip to the underworld and was bowled over by its beauty. It is full of palaces and jewels. The sun rises there, but does not radiate too much of heat. The moon also rises, but its beams are not at all chilly. The forests are populated by beautiful trees and the ponds are thick with lotus flowers, the songs of cuckoo birds are heard everywhere. Below the underworld sleeps a great snake, known as Shesha or Ananta. It has a thousand hoods, all covered with jewels. In fact, this snake is really Vishnu in one of this various forms. Also part of the world are hells (naraka), presided over by Yama, the god of death. Those are full of weapons, fire and poisons and sinners are sent there to be punished. Sins that are punished by dispatch to one of the several hells are lying, murder, killing cows, destroying cities, drinking, killing brahmanas, theft, selling wines or hair, criticizing the Vedas, insulting elders, making weapons, selling salt, destroying forests needlessly, killing sheep or deer, cheating and studying under one's own son. Each sinner receives a punishment that is in proportion to the severity of his sin. Of course, if one performs penance (prayashchitta) for one's sins, one need not go to naraka. The best form of penance is praying to Krishna. The earth (Prithivi or bhuloka) extends upto those arts of the sky that can be lit up by the rays of the sun and the moon. The expanse from there to the solar circle is known as bhuvarloka and holy sages live there. Above the solar circle is the lunar circle and beyond it, in succession, come the regions of Mercury (Budha), Venus (Shukra), Mars (Mangala), Jupiter (Brihaspati), Saturn (Shani), the Great Bear constellation (saptarshi) and the Pole Star (Dhruva). The region from the solar circle to Dhruvaloka is known as heaven (Svarloka or svarga). Beyond Dhruvaloka is Maharloka and further away, Janaloka are Tapaloka and Satyaloka. At the end of a kalpa, all the three lokas (regions) of bhuloka, bhuvarloka and svarloka are destroyed. But the four lokas of Maharloka, Janaloka, Tapaloka and Satyaloka are not destroyed. ", "next": "9.14", "prev": "9.12", "title": "GEOGRAPHY"}