{"index": "9.14", "image": "resized_images/KONARAKA.png", "text": [" There is an ocean to the south of Bharatavarsha.", " One the shores of this great ocean there is a land named Ondra or Utkala (present Orissa).", " Utkala is populated by religious people and the brahmanas who live there are learned in the Vedas.", " They are very good priests, learned in the Puranas and the shastras and skilled in the art of sacrifices.", " In the land of Utkala, there is an image of the sun (Surya) known as Konaditya.", " The word aditya also means the sun, as does the word arka.", " Thus, Konaditya is the same as Konarka, a corruption of the latter word being Konaraka.", " The image of Konaditys is so wonderful that even if one gazes at the image, all one's sins are forgiven.", " All around the temple there is sand.", " But nevertheless, many trees grow around the temple.", " The best time to worship the sun there is at the time of sunrise.", " One has to face the east and draw a lotus flower on the ground with red sandalwood.", " The lotus flower must have exactly eight petals.", " A copper vessel has to be placed at the center of the flower and filled with paddy, sesamum water, red sandalwood, red flowers and sacred grass.", " One prays to Surya to descend on the lotus flower that has thus been drawn.", " If one worships Konaditya according to these prescribed rites, the sins of seven preceding generations are forgiven.", " The twelve adityas are nothing but different forms of Surya.", " Their names are Indra.", " Dhata, Parjanya, Tvashta, Pusha Aryama, Bhaga Vivasvana, Vishnu, Amshumana, Varuna, and Mitra.", " As Indra, Surya destroys the enemies of the gods.", " As Dhata, he creates living beings.", " As Parjanya, he showers down rain.", " As Tvashta, he lives in the trees and herbs.", " As Pusha, he makes foodgrains grow.", " As Aryama, he is in the wind.", " As Bhaga, he is in the body of all living beings.", " As Vivasvana, he is in fire and helps to cook food.", " As Vishnu, he destroys the enemies of the gods.", " As Amshumana, he is again in the wind.", " As Varuna, Surya is in the waters and as Mitra, he is in the moon and in the oceans.", " In each month of the year, it is a different aditya who shines.", " Indra shines in the month of Ashvina, Dhata in Kartika, Parjanya in Shravana, Tvashta in Falguna, Pusha in Pousha, Aryama in Vaishakha, Bhaga in Magha, Vivasvana in Jyaishtha, Vishnu in Chaitra, Amshumana in Ashada, Varuna, in Bhadra and Mitra in Agrahayana.", " Vishnu has twelve hundred rays, Aryama one thousand and three hundred.", " Vivasvana seventy-two, Amshumana fifteen, Parjanya seventy-two, Varuna one thousand and three hundred, Tvashta one thousand and one hundred, Indra two thousand and two hundred, Dhata eleven hundred, Mitra one thousand and Pusha nine hundred.", " Apart from the names of the twelve adityas, Surya has twelve other names as well.", " These are Aditya, Savita, Surya, Mihira, Arka, Prabhakara, Martanda, Bhaskara, Bhanu, Chitrabhanu, Divakara and Ravi.", " Brahma once recounted to the sages the one hundred and eight sacred names of Surya.", " The Brahma Purana lists these names and we reproduce them in nine groups of twelve names each.", " (1) Surya, Archana, Bhagavana, Tvashta, Pusha, Arka, Savita, Ravi, Gabhastimana, Aja, Kala, Mrityu.", " (2) Dhata, Prabhakara, Prithivi, Jala, Teja, Akasha, Vayu, Parayana, Soma, Brihaspati, Shukra, Budha.", " (3) Angaraka, Indra, Vivasvana, Diptamshu, Shuchi, Shouri, Shanaishvara, Brahma, Vishnu, Rudra, Skanda, Vaishravana.", " (4) Yama, Vaidyutam jathara, Agni, Aindhana, Tejohpati, Dharmadhvaja, Vedakarta, Vedanga, Vedavahana, Krita, Treta.", " (5) Dvapara, Kali, Sarvasurashraya, Kala, Kashtha, Muhurta, Kshapa, Yama, Kshana, Samvatsara, Ashvattha, Kalachakra.", " (6) Vibhavasu, Shashvata, Purusha, Yogi, Vyaktavyakta, Sanatana, Kaladhyaksha, Prajadhyaksha, Vishvakaram, Tamonuda, Varuna, Sagara.", " (7) Amsha, Jimuta, Jivana, Ariha, Bhutashraya, Bhutapati, Sarvalokanamaskrita, Shrashta, Samvartaka, Vahni, Sarvadi, Alolupa.", " (8) Ananta, Kapila, Bhanu, Kamada, Sarvotamukha, Jaya, Vishala, Varada, Sarvabhutasevita, Mana, Suparna, Bhutadi.", " (9) Shighraga, Pranadharana, Dhanvantari, Dhumakety, Adideva, Aditinandana, Dvadashatma, Ravi, Daksha, Pita, Mata, Pitamaha. "], "next": "9.15", "prev": "9.13", "title": "KONARAKA"}