{"index": "9.15", "image": "resized_images/INDRADYUMNA AND PURUSHOTTAMA KSHETRA.png", "text": " In satya yuga there was a king named Indradyumna. He was a very powerful king as Indra himself. He was handsome, honest and truthful, learned in the shastras and the Vedas, and skilled in the use of weapons. His radiance put the sun to shame. Indradyumna was devoted to Vishnu. He once decided that he would worship Vishnu. A tirtha is a sacred place of pilgrimage. Indradyumna scanned all the existing tirthas and cities. But none of them satisfied him. None of them, he felt, was appropriate as a place for worshipping Vishnu. Indradyumna's own capital was the city of Avanti, in the kingdom of Malva. Avanti was a beautiful and wealthy city, surrounded on all sides by moats and other fortifications. Traders from many countries came there with all sorts or commodities for trading. The roads of the city were lined with shopes. The houses were painted white. The king's stables were full of horses and elephants. All citizens of Avanti were pleasant of appearance and happy. Sacrifices were held fairly often. Many were the temples, groves and ponds in Avanti. Any tree that grew on earth could be found there. There was a temple to Shiva in the city. This was known as the temple of Mahakala. The image there was so sacred that worshipping Shiva in the temple of Mahakala was tantamount to performing one thousand ashvamedha yajnas. The river Shipra flowed past Avanti. On the banks of the river there was a temple of Vishnu known as Govindasvami. Another temple to Vishnu was named Vikramasvami, But Indradyumna was not satisfied with these temples. He wanted to build another temple to Vishnu. He left Avanti to look for a proper place. His soldiers and subjects accompanied their king, so that it looked as if the entire city of Avanti was on the march. After traveling for many days, they arrived on the shores of the southern ocean, the ocean that is known as lavana samudra. There were so many waves in the ocean that the ocean itself seemed to be dancing. Marine animals lived in the ocean and the waters were also the source of all sorts of jewels. Indradyumna began to live on the shores of the ocean. He discovered a place near the ocean that was thick with flower and fruit trees. Many types of birds gathered there to eat the fruit. This was the place known as Purushottama kshetra (place), the city of Puri of modern times. Purshottama kshetra was a very important tirtha. But all knowledge of this tirtha had been hidden until Indradyumna arrived on the scene. There was a reason for this. Many years ago, there used to be an image of Vishnu there, where people used to pray. So sacred was the image that all the sins of the worshippers were immediately forgiven. The result was that Yama could not punish any of the sinners. They simply prayed to Vishnu’s image and escaped. Yama therefore prayed to Vishnu for a solution. Vishnu hid the image under the sand so that no one knew that it existed. Indradyumna liked Purushottama Kshetra. The river Mahanadi or Chitropala flowed not very far away. The people who lived around the place were religious. He decided that this was the right place for building a temple to Vishnu. On an auspicious day, the foundation stone was laid. Indradyumna then got in touch with the kings of Kalkinga, Utakala and Koshala. He requested their help in fetching stones for the building of the temple. The kings sent their architects to the Vindhya mountains. The stones were gathered from these mountains and brought to Purushottama Kshetra in boats and chariots. Messengers were also sent to several other kings for aid. They came with their armies and with a lot of wealth. Indradyumna told the assembled kings, “I wish to accomplish two difficult tasks. The first is to perform an ashvamedha yajna here. And the second is to build a temple to Vishnu. Both of these are difficult jobs, particularly the second. But if you help me, I am confident that both jobs can be done.” The kings agreed to help. They offered jewels, wealth, gold, clothes, food grains and other objects. The place where the yajna was to be held was made entirely out of gold. In fact, all the objects used in the yajna were made out of gold. Brahmanas from all over Jambudvipa came to witness the sacrifice. They were donated elephants, horses and cows as alms. Never has there been any other sacrifice to rival the one that Indradyumna performed. After the sacrifice was over and the temple built, there remained the more important question of the image. How was this to be made? Indradyumna began to pray to Vishnu for guidance. Vishnu appeared before Indradyumna in a dream and said, “Why are you so miserable? When the sun rises, go to the shores of the ocean. There you will find a tree. Half of the tree is in the water and the remaining half in the sand. Chop down this tree. It s wood will give you the material for the image. In the morning, Indradyumna went to the seashore and found the tree. It was just as Vishnu had described it to be. With an axe, he chopped down the tree. As he was about to slice the trunk in two, two brahmanas appeared before him. Although Indradyumna did not know it, these two brahmanas were Vishnu and Vishvakarma in disguise. “King. What have you done?” exclaimed the brahmanas. “You have cut down the only tree that was on the shores of the ocean.” “Forgive me,” replied Indradyumna. “I wished to make an image of Vishnu. Vishnu has instructed me in a dream that this is the tree from which the image should be made.” “That is an excellent idea,” said the brahmana who was Vishnu in disguise. “There is nothing so holy as praying to Vishnu. Meet my companion. He is as skilled as the great Vishvakarma himself. If you want, he will build the image for you.\" King Indradyumna agreed. And instructed by Vishnu, Vishvakarma started to build the image. Or, to be more accurate, there were three different images. The first one was that of Baladeva or Balarama. This was completely white in colour, except for the eyes, which were red. The image was dressed in blue and a snake held its hood over Balarama’s head. A club and a mace were in Balarama’s hands. The second image was Krishna’s. This was blue in colour, with eyes like lotus flowers. The image was dressed in yellow and had a chakra in its hand. The third image was that of Krishna’s sister Subhadra. This image was golden in colour and was dressed in wonderful clothes. When Indradyumna discovered that the images were made in a matter of minutes, he was thunderstruck. He realised that the two brahmanas cold not be mere mortals. He fell at their feet and said, “Please tell me who you are. You cannot be humans.” Vishnu and Vishvakarma then revealed their true selves and Indradyumna was thrilled. Vishnu blessed the king and told him that he would rule for ten thousand and nine hundred years. And even after Indradyumna died, a place would be reserved for him in heaven. On an auspicious day, the three images were instated in the temple. ", "next": "9.16", "prev": "9.14", "title": "INDRADYUMNA AND PURUSHOTTAMA KSHETRA"}