{"index": "9.16", "image": "resized_images/MARKANDEYA.png", "text": " Many years ago, a great destruction (pralaya) took place.\n The earth was shrouded in darkness and nothing could be seen.\n There was neither sun nor moon.\n Lightning and thunder crushed mountains and trees.\n There were showers of meteors.\n Lakes and rivers dried up.\n The entire earth burnt with fire and the flames of the fire reached down to the underworld.\n All living beings perished in this fire, including the gods and the demons.\n There was a sage named Markandeya.\n While all this was going on, Markandeya was busy meditating.\n Such was the power of Markandeya’s tapasya that the fire dared not touch him.\n But it is also true that Markandeya was scared of the fire that raged all around him.\n He suffered from hunger and thirst and forgot all about his tapasya.\n His lips and throat dried up from fear.\n Markandeya discovered that there was a banyan tree that was untouched by all these ravages.\n He retired to the shade of the banyan tree and started to pray to Vishnu.\n Clouds gathered in the sky.\n They were thick and dark clouds and they spread all over the earth.\n It started to rain and it poured and poured.\n Water was everywhere and the earth was flooded.\n The water put out the fire.\n It rained continuously for twelve years.\n The oceans flooded the shores and the mountains were pulverised.\n Vishnu slept on the water.\n Markandeya did not know what to do.\n There was water everywhere and he floated on it.\n But he continued to pray to Vishnu.\n Vishnu spoke to Markandeya.\n “Do not be frightened, Markandeya,” he said.\n “You are devoted to me and I shall protect you.\n” Markandeya did not realise that it was Vishnu who was speaking.\n “Who dares to address me thus?\n” he demanded.\n “Am I a child that I should be so addressed?\n I am the great Markandeya, blessed by Brahma himself.\n” But try as he might, Markandeya cold not see anyone anywhere.\n Where had the voice come from then?\n Had it all been an illusion?\n Not knowing what to do, he started to pray again to Vishnu.\n Suddenly he saw the banyan tree floating on the water.\n A golden bed was spread on the branches of the tree and on the bed there slept a small boy.\n Markandeya was exceedingly surprised to see the small boy floating in the middle of this deluge.\n He was so confused by his illusions that he did not realise that this boy was none other than Vishnu.\n The boy spoke to Markandeya.\n “You are tired,” said the boy.\n “You are looking for a refuge.\n Enter my body and rest for some time.\n” Markandeya was so confused that, before he could react, he entered the boy’s body through the mouth.\n Inside the boy’s stomach Markandeya discovered all the worlds, the seven regions and the seven oceans.\n The mountains and the kingdoms were all there.\n So were all living beings.\n Markandeya did not know what to make of all this.\n He started to pray to Vishnu.\n No sooner than he had started, he came out of the boy’s mouth.\n Vishnu now appeared before him and blessed him.\n The sage spent a thousand years with Vishnu.\n Vishnu then asked, “I wish to grant you a boon.\n What is your desire?\n” “I want to build a temple to Shiva in Purushottama Kshetra,” replied Markandeya.\n “This will prove to everyone that Vishnu and Shiva are really one and the same.\n” Vishnu granted the boon and Markandeya built a temple to Shiva known as Bhuvaneshvara (Lord of the World). ", "next": "9.17", "prev": "9.15", "title": "MARKANDEYA"}