{"index": "9.18", "image": "resized_images/VALI.png", "text": " There was a king of the daityas named Vali.\n He was powerful and invincible.\n He was also righteous and truthful.\n The gods cold not bear to see Vali’s prosperity and began to plot how Vali might be foiled.\n So well did Vali rule that disease, drought and evil disappeared throughout the three worlds.\n In desperation, the gods approached Vishnu.\n “Please do something about Vali”, they requested.\n “You always help us out when we are in trouble.\n” “There is no difference between Vali and the gods so far as I am concerned,” replied Vishnu “Vali is devoted to me.\n I cannot therefore fight with him.\n But I will think of a way so that his kingdom might be taken away from him and given to you.\n” Vishnu decided to be born as Aditi’s son.\n The son was a dwarf.\n This was the vamana avatara (dwarf incarnation) of Vishnu.\n Vali proposed to organise a horse sacrifice.\n Many sages came to the sacrifice and Shukracharya was the chief priest.\n The dwarf also arrived to witness the yajna.\n Shukracharya realised that the dwarf was none other than Vishnu.\n He told Vali, “I suspect that this dwarf is Vishnu in disguise.\n He must have come here to ask you for something.\n Please do not grant him anything without first consulting me.\n” “Certainly not,” replied Vali.\n “It is good fortune indeed that the great Vishnu has come to my house.\n What is there to consult about?\n I shall grant Vishnu whatever he wants.\n” Vali went to the dwarf to ascertain what the dwarf wanted.\n Vishnu expressed the wish that he might be given as much of land as might be covered in three of the dwarf’s steps.\n This boon Vali readily granted.\n But no sooner than the boon had been granted, the dwarf adopted a gigantic form.\n He placed one foot on Vali’s yajna and the second on Brahmaloka.\n “Where will I place my third step?\n” demanded Vishnu.\n “There is no more space left in the entire universe.\n Find me a place for my third step.\n” Vali smiled and said, “Place it on my back.\n” Vishnu was charmed at Vali’s generosity.\n He granted Vali the boon that Vali would hold the title of Indra in a future manvantara.\n He then appointed Vali king of the underworld.\n But Indra’s kingdom of heaven, which Vali had conquered, was returned to Indra.\n Brahma had all this while been in Brahmaloka.\n When Vishnu placed his second foot on Brahmaloka, Brahma felt that he should welcome his water-pot (kamandalu) to wash the foot.\n The water spilled over from the foot and fell on the mountains.\n There the water divided into four.\n Vishnu accepted the flow that went northwards.\n The flow that went westwards returned to Brahma’s kamandalu.\n The flow that went eastwards was gathered up by the gods and the sages.\n But the flow that went southwards got entangled in Shiva’s matted hair. This water was the river Ganga. ", "next": "9.19", "prev": "9.17", "title": "VALI"}