{"index": "9.19", "image": "resized_images/GAUTAMA.png", "text": " Part of the water of the Ganga that got stuck in Shiva’s hair was brought down to earth by Bhagiratha. The remaining part was brought down by the sage Gautama. Parvati was married to Shiva, but Shiva seemed to be fonder of Ganga than of Parvati. Parvati resolved that a way had to be found to remove Ganga from Shiva’s hair. She tried persuasion, but Shiva refused to listen. At this time, there was a terrible drought on earth which went on for fourteen years. The only place that was not affected by the drought was the sage Gouthama’s hermitage. Other people also gathered in the hermitage to save themselves from the drought and Goutama welcomed them all. Ganesha thought that he might be able to devise a way to free his mother of the Ganga problem. He went and began to live in Gouthama’s hermitage. Ganesha cultivated the acquaintance of the other sages and become quite friendly with them. One of Parvati’s companions was Jaya. Ganesha told Jaya that she was to adopt the form of a cow and eat up the grain in Goutama’s fields. And the moment she was struck, she was to lie down on the ground and pretend to be dead. Goutama noticed that a cow was eating up his grain. He tried to drive away the cow by striking it with a blade of grass. As soon as he did this, the cow uttered a shrill bellow and fell down on the ground. Ganesha and the other sages came running to see what had happened. They discovered that, to all intents and purposes, a cow had been struck down dead by sage Goutama. They therefore refused to stay in an ashrama where such a sin had been committed. Goutama tried to restrain them. “Please do not go away and forsake me,” he said. “Tell me how I may performed penance.” “You will have to bring down Ganga from Shiva’s hair,” replied Ganesh. “When that water touches the dead body of the cow, your sin will be forgiven.” “You will have to bring down Ganga from Shiva’s hair,” replied Ganesha. “When that water touches the dead body of the cow, your sin will be forgiven.” Ganesha was so friendly with the other sages that they all accepted his solution. Goutama also agreed to do the needful. Accordingly, Goutama went to Mount Kailasa and began to pray to Shiva. Shiva was pleased at Goutama’s tapasya and offered to grant a boon. Goutama naturally wanted the boon that Ganga might be brought down to earth. Shiva agreed. It was thus that Ganga was brought down to earth by the sage Goutama. Ganga has four tributaries in heaven, seven on earth and four in the underworld. Since it was Goutama who brought Ganga down to earth, the river is also known as Goutami Ganga. ", "next": "9.20", "prev": "9.18", "title": "GAUTAMA"}