{"index": "9.2", "image": "resized_images/MORE CREATION.png", "text": [" To continue with the process of creation, Brahma gave birth to a man and a woman from his own body.", " The man was named Svayambhuva Manu and the woman was named Shatarupa.", " Humans are descended from Manu.", " That is the reason they are known as manava.", " Manu and Shatarupa had three sons named Vira.", " Priyavrata and Uttanapada.", " Uttanapada's son was the great Dhruva.", " Dhruva performed very difficult meditation (tapasya) for three thousand divine years.", " Brahma was so pleased at this that he granted Dhruva an eternal place in the sky, near the constellation that is known as saptarshi or the seven sages.", " This is the constellation Ursa Majoris and Dhruva is the pole Star.", " In Dhruva's line there was a king named Prachinavarhi.", " Prachinavarhi had ten sons, known as the Prachetas.", " These Prachetas were supposed to look after the world and rule over it, but they were not interested in such mundane matters.", " They went off instead to perform tapasya under the ocean.", " The tapasya went on for ten thousand years.", " The upshot was that the earth had no ruler and began to suffer.", " People started to die and thick forests sprouted everywhere.", " So thick were the forests that even the winds could not blow.", " News of this catastrophe reached the Prachetas.", " They were furious with the trees and created wind (vayu) and fire (agni) from their mouths.", " The wind dried up the trees and the fire burnt them, so that, very soon, there were very few trees left on earth.", " Everyone was alarmed at the effects of the Prachetas anger.", " The moon-god Soma (or Chandra) came to the Prachetas with a beautiful woman and said, \"Prachetas, please control your anger.", " You need someone to rule over the world so that you can concentrate on your tapasya.", " This beautiful woman is named Daksha.", " He will rule over the world\".", " The Prachetas agreed to this proposal and Daksha was born.", " The word praja means subject and the word pati means master.", " Since Daksha ruled over the world and its subjects, Daksha came to be known as Prajapati.", " The sages interrupted Romaharshana.", " They said, \"Sage, we are completely confused.", " We have heard that Daksha was born from Brahma's toe.", " And yet you have told us that Daksha was the son of the Prachetas.", " How is this possible?", "\" Romaharshana replied, \"There is no reason for bewilderment.", " Many Dakshas have been born to rule over the world.", " One was born from Brahma's toe, yet another was the son of the Prachetas.\" "], "next": "9.3", "prev": "9.1", "title": "MORE CREATION"}