{"index": "9.20", "image": "resized_images/THE DOVES.png", "text": " In a mountain known as Brahmagiri there used to live a hunter who was very cruel.\n He not only killed birds and animals, but brahmanas and sages as well.\n The hunter once went on a hunt.\n He killed many animals and birds and some he put in his cages.\n He had penetrated so far inside the forest that he was far from home.\n It became night and also started to rain.\n Hungry and thirsty, the hunter lost his way.\n He climbed up a tree and decided to spend the night there.\n But his mind kept going back to his wife and children at home.\n For many years a dove and its family had lived happily on that tree.\n Both the male and female had gone out to look for food.\n But although the make dove had returned to the nest, the female dove had not.\n In fact, the female had been captured by the hunter and was now inside a cage.\n The male did not know this.\n He mourned for his wife.\n These words of mourning were heard by the female dove inside the cage and she made her presence felt.\n The male dove came down and discovered his wife inside the cage.\n “The hunter is sleeping now,” he said.\n “Now is the time for me to free you.\n” “No,” replied the female dove.\n “You know how it is with living beings.\n One living being lives on another.\n I can find not fault with the hunter, he is merely collecting his food.\n He is like a guest to us.\n And it is our duty to offer up our bodies for the sake of a guest.\n” “You are quite right,” said the male dove.\n “I lost my sense of propriety.\n We have to serve our guest.\n But how do we serve our guest?\n We have nothing that we can call our own.\n” “At the moment the hunter is suffering most from the cold,” replied the female dove.\n “We have to light a fire to warm him up.\n Go and find a fire and bring plenty of dead leaves and branches so that the fire may burn.\n” The male dove found a flaming branch.\n He also brought many dry leaves and branches so that the fire could burn.\n The rain had stopped and the fire warmed up the hunter.\n “Now,” said the female dove, “free me so that I may immolate myself in the fire.\n My roasted flesh will serve as food for the hunter.\n” “Never,” replied the male dove.\n “It is my right to serve the guest first.\n” Saying this, the male dove hurled himself into the fire.\n The hunter had heard the entire conversation and marveled that two doves could be so altruistic.\n The female dove now requested the hunter to free her from the cage.\n And as soon as he did this, the female dove also hurled herself into the fire.\n This selfless deed of the two doves was so wonderful that a space vehicle (vimana) came down to take the two doves straight to heaven.\n The cruel hunter was also impressed and repented his past misdeeds.\n He told the doves, “You are indeed blessed.\n Before you go to heaven, please tell me how I may perform penance for my sins.\n” “Go to Goutami Ganga and bathe there for fifteen days,” replied the doves.\n “Your sins will also be forgiven.\n” The hunter did as he had been asked to.\n The place where the doves immolated themselves became a holy tirtha known as kapotatirtha, since the word kapota means dove. ", "next": "9.21", "prev": "9.19", "title": "THE DOVES"}