{"index": "9.21", "image": "resized_images/GARUDA AND MANINAGA.png", "text": " You have already been told about the great snake (naga) Ananta.\n Ananta had a son named Maninaga.\n Garuda was the enemy of the snakes and the snakes were all afraid of Garuda.\n Maninaga began to pray to Shiva.\n Having pleased Shiva, he obtained the boon that Garuda would be able to do him no harm.\n Armed with this boon, Maninaga started to wander around freely and did not run away even when faced with Garuda.\n Garuda found this to be exceedingly strange.\n Although he could not kill Maninaga, he captured him and kept him imprisoned in his own house.\n Shiva had a companion named Nandi.\n Nandi told Shiva, “Lord, what has happened to Maninaga?\n We have not seen him for some time.\n I hope that Garuda has not done him some harm.\n” Shiva of curse knew what had happened.\n He advised Nandi to pray to Vishnu.\n Nandi was to please Vishnu and then ask for the boon that Maninaga might be freed from Garuda’s imprisonment.\n Nandi did this and Vishnu asked Garuda to release Maninaga.\n “Lord,” Garuda told Vishnu,” this is very unfair.\n Other masters treat their servants really well.\n They give their servants gifts.\n See how Shiva has sent Nandi himself to rescue Shiva’s devotee Maninaga.\n You never give me any gifts.\n Moreover, when I obtain something on my own, you ask me to relinquish it.\n Is this proper on your part?\n It is on me that you ride when you go out to fight the demons.\n They get defeated because of my prowess.\n And yet it tickles your ego no end to think that you have defeated them yourself.\n” Vishnu smiled and replied, “Garuda, you are quite right.\n You have become thin and learn from bearing my weight.\n It is quite true that I can defeat the demons only because of your prowess.\n You have a lot of strength.\n Why don’t you bear the weight of my little finger and demonstrate your strength?\n” Vishnu placed his little finger on Garuda’s head.\n So heavy was the finger that Garuda was crushed against the ground.\n “Please forgive me,” said Garuda.\n “I have been very stupid.\n I am an ignorant ass and you are the lord of everything.\n I have been completely flattened by the weight of your little finger.\n Please tell me how I may regain my old self.\n” Vishnu asked Nandi to take Garuda to Shiva.\n Shiva would find a way of restoring Grauda’s old appearance.\n Maninaga was releases and Nandi took Garuda to Shiva.\n Shiva asked Garuda to bathe in Goutami Ganga.\n This would make his appearance normal again.\n Garuda did this.\n Not only was his old appearance restored, he became stronger and swifter than he used to be.\n The place where Garuda bathed is a tirtha known as Garudatirtha. ", "next": "9.22", "prev": "9.20", "title": "GARUDA AND MANINAGA"}