{"index": "9.23", "image": "resized_images/SHVETA.png", "text": [" There used to be a brahmana named Shveta.", " He was a friend of the sage Goutama and had a hermitage on the banks of the Goutami Ganga.", " Shveta was also devoted to Shiva.", " In due course, Shiveta died and Yama’s messengers arrived to take Shveta to Yama.", " But they could not even enter Shveta’s house.", " Finding that Yama’s messengers are not returning, Yama’s companion Chitraka told Yama, “What do you think has happened?", " Why aren’t the messengers returning?", " Yama now sent his companion Mrityu (literally death) to find out what was going on.", " Mrityu went to Shveta’s house and found Yama’s messengers standing outside the house.", " They explained that they were unable to enter the house because Shiva himself was guarding Shveta’s body.", " One of Shiva’s companions asked Mrityu.", " “What are you doing here?", " What do you want?", "” “I have come to take Shveta to Yama,” replied Mrityu.", " “His time on earth is up.", "” Mrityu flung a noose to grasp Shveta’s body.", " But Shiva’s companion struck Mrityu with a rod and killed him.", " When the news of this was taken to Yama, he was furious.", " With all his companions he attacked Shveta’s house.", " Nandi, Ganesha, Kartikeya and several of Shiva’s companions came to fight on Shiva’s side, and a battle royal raged.", " All the gods arrived to mediate and end the strife.", " Things had a got a bit out of hand and Yama himself had been killed by Kartikeya.", " The problem seemed to defy solution.", " Yama was, after all, performing his duty.", " But Shiva insisted that his devotees would never be taken to Yama, but would instead go straight to heaven.", " Shiva’s condition was finally agreed to.", " Nandi brought water from the Goutami Ganga and sprinkled it on Yama and the others who had died in the fighting.", " They were all immediately brought back to life. "], "next": "9.24", "prev": "9.22", "title": "SHVETA"}