{"index": "9.26", "image": "resized_images/VRIDDHAGOUTAMA.png", "text": " The sage Goutama had a son named Vriddhagoutama. Vriddhagoutama was also a sage. But he was very ugly. Besides, he had no nose; had never had one since he had been born. He was so ashamed of this deformity that he could not bear to join the other children of the sages in studying the Vedas and Shastras under a teacher. But Vriddhagoutama knew some incantations (mantras) which he always chanted. He also worshipped the god Agni. When he grew a bit older, Vriddhagoutama went out to tour the world. He traveled to many places and met many people. Since he was deformed, he never got married. Who would want to marry a person so ugly as he? In the course of his travels, Vriddhagoutama arrived at a mountain named Shitagiri. He discovered a beautiful cave in the mountain and thought that this might be a good place to live in. So he entered the cave and was very surprised to find an old woman inside. The old woman had obviously been living inside the cave for many years. Her body was thin and wasted from the rigours of severe tapasya. Vriddhagoutama was about to touch the feet of such a venerable old woman, but the woman restrained him. “Please don’t touch my feet,” said the woman. “You are my guru. Does a guru ever bow before his disciple?” Vriddagoutama was surprised at these words. This was the first time in his life that he had met the old woman. “How can I be your guru?”, he asked. “You are much older than me. Besides, I have never learnt anything and you are clearly a respected ascetic. Your words are a complete mystery to me.” “Let me tell you my story,” said the old woman. “Otherwise, you will not understand.” There used to be a handsome and brave prince named Ritadhvaja. He was the son of King Arshtishena. Ritadhvaja went on a hunt to the forest and arrived at that very cave. There he happened to meet an apsara named Sushyama. The two fell in love with each other and got married. But eventually, Ritadhvaja had to return home and Sushyama gave birth to a daughter there. Sushyama left her daughter in the cave itself with the instruction that she was not to leave the cave. The first man to enter the cave would become her husband. It was this daughter who had now become the old woman. Ritadhvaja had reigned for eighty thousand years. After that, ritadhvaja’s son had reigned for ten thousand years. All this while, Sushyama’s daughter had lived in the cave, that is, for ninety thousand years all together. “Now you see that you are to be my husband,” said the old woman. “Is a husband not a guru?” “What you say is quite impossible,” replied Vriddhagoutama. “You are much older than me. I am only a thousand years old and you more than ninety thousand. How can we marry? I am like a child next to you.” “If you do not marry me, I will kill myself,” said the old woman. “But I am ugly,” protested Vriddhagoutama. “I will promise you this much. If I every become handsome and learned, I will indeed marry you.” “I have pleased the goddess Sarasvati, who presides over all learning, through my tapasya,” said the old woman. “She will make you learned. I have also pleased the god Varuna and he will make you handsome.” Vriddhagoutama became handsome and learned and married the old woman. They lived happily in the cave. One day, various sages came to visit the couple. Amongst them there were sages like Vashishtha and Vamadeva. But there were also young sages who ere not all that sensible. The younger sages started to laugh at the sight of the young and handsome Vriddhagoutama and his aged wife. “Who is this man?” they asked the old woman. “Is he your son or your grandson?” The sages went away, but the couple felt ashamed. They asked the sage Agastya what they might do. Agastya told them to go and bathe in the river Goutami Ganga. The river is so sacred that all one’s heart’s desires are thereby granted. The couple did this and prayed to Vishnu and Shiva. Wonder of wonders, the old woman became young and pretty. The place on the banks of the river where these wonderful things happened is a tirtha named vriddhasangama. ", "next": "9.27", "prev": "9.25", "title": "VRIDDHAGOUTAMA"}