{"index": "9.27", "image": "resized_images/PIPPALADA.png", "text": [" Many years ago, there used to be a sage named Dadhici.", " His wife was Lopamudra.", " Dadhichi’s hermitage was right next to the holy river Ganga.", " Lopamudra’s sister Gabhastini also used to live in the hermitage.", " Such was the sage Dadhichi’s powers that daityas and danavas dared not set foot inside the hermitage.", " The gods once fought with the demons and managed to defeat them.", " After the war was over, they came to pay their respects to Dadhichi.", " Dadhichi welcomed his guests and wanted to know how they were faring.", " “Thanks to your blessings, we are fine,” replied the gods.", " “We have just defeated the demons in a war.", " In fact, we have a slight problem.", " We no longer need our weapons now that the demons have run away.", " We don’t know of a safe place where we can store all these weapons.", " We were wondering if we might keep the weapons in your ashrama.", " This is one of the safest places that can be found.", "” Dadhichi consented to this proposal.", " The gods left their weapons in the hermitage and went back to heaven.", " When Lopamudra heard what Dadhichi had done, she was not at all pleased.", " “You have done something that is mot improper,” she told her husband.", " “One should never accept responsibility for someone else’s property, especially if one is an ascetic and has not material possessions of one’s own.", " Moreover, you have agreed to store the weapons of the gods.", " Dose this not mean that those who are the god’s enemies will look upon you too as an enemy?", " And what are you going to do if something should happen to the weapons?", " Will the gods not blame you then?", "” “Your points are well taken,” said Dadhichi.", " “But I had not thought of them and I have given the gods my word.", " I can’t very well go back on my word now.", "” A hundred years passed.", " The gods did not return to collect their weapons.", " The weapons began to lose their luster, Dadhichi did not know how the energy of the weapons might be preserved.", " He washed them with holy water and the energy of the weapons got dissolve in the water.", " Dadhichi then drank up the water.", " As for the weapons themselves, they faded away once their energy was gone.", " Finally the gods came to claim their weapons.", " “Can we have our weapons back?", " They asked.", " “Our enemies have become powerful again.", " We need our weapons.", "” “That may be,” said Dadhichi.", " “But the weapons are no longer there.", " I have swallowed up their energy.", " Let me tell you what can be done.", " I will use the powers of meditation (yoga) to give up my life.", " Then excellent weapons can be made out of my bones.", " The gods were reluctant, but thee was no other solution.", " Dadhichi died and the gods requested Vishvakarma to make weapons for them out of Dadhichi’s bones.", " Vishvakarma complied and the weapon name vajra that he made was truly remarkable.", " Lopamudra was away when this incident took place.", " She returned and found that her husband had died.", " She was afflicted with sorrow and wished to immolate herself in a fire.", " But she happened to be pregnant at the time, so that this could not immediately be done.", " Once the baby was born, she killed herself after having handed over the baby to a pippala (fig) tree for rearing.", " Since the pippala tree brought up the boy, he came to be known as Pippalada.", " Chandra was the lord over all trees.", " The trees asked Chandra for some amrita for Pippalada and Chandra obliged.", " The amrita gave Pippalada a lot of strength.", " When Pippalada grew up, he wanted to know who his parents were and the trees told him the story.", " Pippalada blamed the gods for his parents death and decided to seek revenge.", " The trees brought Pippalada to Chandra.", " “You are still too young,” said Chandra.", " “First you must become learned and well-versed in the use of weapons.", " Go to the forest of dandakaranya.", " The river Goutami Ganga flows through that forest.", " Pray to Shiva there and I am sure that your wishes will be fulfilled.", "” Pippalada pleased Shiva through his prayers.", " “What boon do you desire?", "” asked Shiva.", " I want the boon that I may be able to destroy the gods,” replied Pippalada.", " “I have a third eye in the middle of my forehead,” said Shiva.", " “The day you can see my third eye, your wish will be granted.", "” Try as he might, Pippalada could not see Shiva’s third eye.", " Pippalada therefore performed even more difficult tapasya for even more years.", " Eventually he managed to see Shiva’s third eye.", " From Shiva’s third eye was born a demon that looked like a mare.", " “What is your desire?", "” asked the demon of Pippalada.", " “Kill my enemies, the gods,” was the reply.", " The demon immediately attacked Pippalada.", " “What are you doing?", "” asked Pippalada.", " “Why are you trying to kill me?", " I asked you to kill the gods.", "” “But your body has bee created by the gods,” replied the demon.", " “I will therefore kill you also.", "” Pippalada ran to Shiva for deliverance.", " Shiva earmarked a region inside the forest for Pippalada.", " There the demon was not permitted to enter.", " Pippalada lived there, protected from the ravages of the demon.", " Meanwhile, the gods requested Shiva to save them as well.", " Shiva persuaded Pippalada to control his anger.", " He convinced Pippalada that nothing was to be gained by killing the gods.", " That would not bring his parents back.", " Pippalada agreed.", " But he wished to see his parents once.", " Accordingly, vimana descended from heaven on which Dadhichi and Lopamudra were seated.", " They blessed Pippalada and asked him to marry and have children. As for the demon, it became a river and merged with the holy Ganga. "], "next": "9.28", "prev": "9.26", "title": "PIPPALADA"}