{"index": "9.28", "image": "resized_images/NAGESHVARA.png", "text": " There was a city named Pratishthana.\n A king named Shurasena ruled in that city.\n Shurasena did not have any sons.\n After a lot of effort, a son was born to him.\n But the son happened to be a snake.\n The king and the queen were mortified at this turn of events.\n But they brought up their son in great secrecy.\n Not even the king’s ministers and priests knew that the prince was a snake.\n When the prince grew slightly, he began to talk like a human, even though he was a snake.\n King Shurasena arranged for the prince’s education.\n After the snake had become learned in the knowledge of the Vedas, he told his father, “Father, it is time for me to get married.\n If I do not have a son, I am certain to go to naraka.\n” King Shurasena was very surprised to hear this.\n “How is that possible?\n” he asked.\n “Which princess will consent to marry a snake?\n” “I don’t know,” replied the prince.\n “But I do know that I have to get married.\n Other wise, I will commit suicide.\n There are many forms of marriage that are permissible.\n Perhaps a princess can be kidnapped and married to me.\n” Shurasena called his ministers and told them, “My son Nageshvara has now come of age.\n He has also been made the heir-apparent to the kingdom.\n There is no one equal to him in bravery on earth, in heaven or in the underworld.\n I am getting old.\n Please arrange for Nageshvara to get married.\n I shall then relinquish my kingdom and retire to the forest.\n” The king did not of course tell his ministers that Nageshvara was a snake.\n Shurasena had an aged minister.\n This minister reported that there was a king named Vijaya who ruled in the eastern part of the country.\n King Vijaya had eight sons and one daughter.\n The daughter’s name was Bhogavati and she was very beautiful.\n She would be the right match for Nageshvara.\n The aged minister was sent as a messenger to Vijaya and the king agreed to the match.\n There was a custom amongst kshatriyas that the bride did not always have to be married to the bridegroom in person.\n She could also be married to the bridegroom’s sword or some other weapon.\n The minister explained to King Vijaya that there were some private reasons which made it impossible for Nageshvara to come in person for the marriage.\n Bhogavati should be married off to Nageshvara’s sword.\n Vijaya consented to this and the marriage ceremony was performed.\n The entire retinue then returned to the city of Pratishthana.\n But what was to be done now that the marriage was over?\n Nageshvara’s mother sent a made to Bhogavati.\n The maid was to tell Bhogavati that her husband was actually a snake and then observe her reaction.\n The maid told Bhogavati, “Your husband is a god, but he has the form of a snake.\n” “That is my good fortune,” replied Bhoavati.\n “Normally, women are married to men.\n I must have performed many good deeds in my earlier life to have been married to a god.\n” Bhogavati was then brought to Nageshvara and at the sight of Bhogavati, Nageshvara remembered his earlier life.\n He used to be a snake (naga) in his earlier life and was a companion of Shiva’s.\n His wife in the earlier life was Bhogavati.\n There had bee an occasion when Shiva had laughed at a joke of parvati’s and Nageshvara had also laughed.\n This had annoyed Shiva and he had cursed Nageshvara that he would be born on earth as the son of a human, but in the form of a snake.\n When he went and bathed in Goutami Ganga, the period of the curse would be over.\n When Nageshvara recounted these incidents to Bhogavati, she also remembered her earlier life.\n The two went and bathed in the scared river and Nageshvara obtained a handsome and divine form.\n Nageshavara ruled after Shurasena’s death.\n And when Nageshvara and Bhogavati died, they went back to Kailasa to live with Shiva.\n On the banks of the Goutami Ganga, Nageshvara and Bhogavati built a temple to Shiva. This is a famous tirtha known as nagatirtha. ", "next": "9.29", "prev": "9.27", "title": "NAGESHVARA"}