{"index": "9.29", "image": "resized_images/BRAHMA’S HEAD.png", "text": [" Years ago, there was a war between the gods and the demons and the gods lost.", " The gods came to Brahma for advice and Brahma asked them to pray to Shiva.", " When Shiva appeared before them, the gods said, “The demons have defeated us.", " Please kill them and save us.", "” Shiva went to fight with the demons.", " He drove the demons off from Mount Sumeru and out of heaven.", " He pursued them to the ends of the earth.", " All this exertion made Shiva sweat.", " And wherever the drops of sweat fell down on the ground, terrible ogresses named matris were created.", " The matris also started to kill the demons and pursued them down to the underworld.", " While the matris were killing the demons in the underworld, Brahma and the other dos waited on the banks of the river Goutami Ganga.", " This place came to be known as Pratishthana.", " When the matris had killed all the demons, they returned to earth and began to live on the banks of the Goutami Ganga.", " This tirtha has come to be known as matritirtha.", " Brahma used to have five heads.", " The fifth head was in the shape of a donkey’s head.", " When the demons were running away to the underworld, this donkey’s head addressed the demons and said, “Why are you running away?", " Come back and fight with the gods.", " I shall aid you in your fight.", "” The gods were alarmed at this paradoxical situation.", " Brahma was helping them in their flight with the demons and Brahma’s fifth head was trying to help the demons.", " They went to Vishnu and said, “Please cut off Brahma’s fifth head.", " It is causing too much of confusion.", "” “I can do what you want,” replied Vishnu, “but there is a problem.", " When the cut- off head falls on earth, it will destroy the earth.", " I think you should pray to Shiva to find a way out.", "” The gods prayed to Shiva and Shiva agreed to cut off the head.", " But what was to be done with the severed head?", " The earth refused to bear it and so did the ocean.", " Finally it was decided that Shiva himself would bear the head.", " The place where Shiva cut off Brahma’s fifth head is known as rudratirtha.", " Ever since that day, Brahma has had four heads and is known as Chaturmukha (chatur connotes four and mukha connotes face).", " There is a temple to Brahma on the banks of the Goutami Ganga.", " This is a holy place known as brahmatirtha.", " A killer of brahmanas is pardoned his sin if he visits this temple. "], "next": "9.30", "prev": "9.28", "title": "BRAHMA’S HEAD"}