{"index": "9.3", "image": "resized_images/DAKSHA’S OFFSPRING.png", "text": " Daksha's wife was named Asikli and Asikli gave birth to five thousand sons.\n They were known as the Haryashvas.\n The Haryashvas were destined to rule over the world.\n But the sage Narada went to the Haryashvas and said, \"How can you rule over the world if you don't even know what the world looks like?\n Are you familiar with its geography and its limits?\n First find out about these things, before you contemplate ruling over the world.\n\" The Haryashvas went off to explore the world and never returned.\n Daksha and Asikli then had another thousand sons who were named the Shavalashvas.\n Narada told them what he had told the Haryashvas and the Shavalashvas also went off to explore the world and never returned.\n Daksha and Asikli were distressed that their children should disappear in this manner.\n Daksha blamed Narada for the instigation and proposed to kill him.\n But Brahma intervened and persuaded Daksha to control his anger.\n This Daksha agreed to do, provided that his conditions were met.\n \"Brahma must marry my daughter Priya,\" he said.\n \"And Narada must be born as Priya's son.\n\" These conditions were accepted.\n In fact, Daksha and Asikli had sixty daughters.\n (Elsewhere, the Brahma Purana mentions fifty daughters.\n) Ten of these daughters were married to the god Dharma and thirteen to the sage Kashyapa.\n Twenty-seven daughters were married to Soma or Chandra.\n The remaining daughters were married to the sages Arishtanemi, Vahuputra, Angirasa and Krishashva.\n The ten daughters who were married to the god Dharma were named Arundhati, Vasu, Yami, Lamba, Bhanu, Marutvati, Sankalpa, Muhurta.\n Sadhya and Vishva.\n Arundhati's children were the objects (vishaya) of the world.\n Vasu's children were the eight gods known as the Vasus.\n Their names were Apa, Dhruva, Soma, Dhara, Salila, Anala, Pratyusha and Prabhasa.\n Anala's son was Kumara.\n Because Kumara was brought up by goddesses known as the Krittikas, he came to be called Kartikeya.\n Prabhasa's son was Vishvakarma.\n Vishvakarma was skilled in architecture and the making of jewelry.\n He became the architect of the gods.\n Sadhya's children were the gods known as Sadhyadevas and Vishva's children were the gods known as Vishvadervas.\n The twenty-seven daughters of Daksha who ere married to Soma are known as the nakshatras (stars).\n As you have already been told, Kashyapa married thirteen of Daksha's daughters.\n Their names were Aditi, Diti, Danu, Arishta, Surasa, Khasa, Surabhi, Vinata.\n Tamra, Krodhavasha, Ila, Kadru and Muni.\n Aditi's sons were the twelve gods known as the adityas.\n Their names were Vishnu, Shakra.\n Aryama, Dhata, Vidhata, Tvashta, Pusha, Vivasvana, Savita, Mitravaruna, Amsha and Bhaga.\n Diti's sons were the daityas (demons).\n They were named Hiranyaksha and Hiranyakashipu, and amongst their descendants were several other powerful daityas liked Vali and Vanasura.\n Diti also had a daughter named Simhika who was married to a danava (demon) named Viprachitti.\n Their offspring’s were terrible demons like Vatapi, Namuchi, Ilvala, Maricha and the nivatakavachas.\n The hundred sons of Danu came to be known as danavas.\n The danavas were thus cousins to the daityas and also to the adityas.\n In the danava line were born demons like the poulamas and kalakeyas.\n Arishta's sons were the gandharvas (singers of heaven).\n Surasa gave birth to the snakes (sarpa).\n Khasa's children were the yakshas (demi-gods who were the companions of Kubera, the god of wealth) and the rakshasas (demons).\n Surabhi's descendants were cows and buffaloes.\n Vinata had two sons named Aruna and Garuda.\n Garuda became the king of the birds.\n Tamra has six daughters.\n From these daughters were born owls, eagles, vultures, crows, water-fowl, horses, camels and donkeys.\n Krodhavasha had fourteen thousand children known as nagas (snakes).\n Ila gave birth to trees, creepers, shrubs and bushes.\n Kadru's sons were also known as nagas or snakes.\n Among the more important of Kadru's sons were Ananta, Vasuki, Takshaka and Nahusha.\n Muni gave birth to the apsaras (dancers of heaven).\n Diti's children (daityas) and Auditi's children (adityas) continually fought amongst themselves.\n On one particular occasion, the gods succeed in killing many of the demons.\n Thirsting for revenge, Diti began to pray to her husband, Kashyapa that she might given birth to a son who would kill Indra, the king of the gods.\n Kashyapa found it difficult to refuse his wife outright.\n \"All right\", he said.\n \"You have to bear the son in your womb for a hundred years.\n And throughout this period, you will have indeed kill Indira.\n But if you do not observe these instructions to the letter, your desire will not be satisfied.\n\" Diti resolved to do as her husband had bidden her.\n But Indra had got to know about Diti's resolve and was waiting for an opportunity to save himself.\n There was an occasion when, tired after her prayers.\n Diti went to sleep without first washing her feet.\n This was an unclean act and it gave Indra the required opportunity.\n He adopted a miniscule form and entered Diti's womb.\n With his weapon vajra, he sliced up the baby inside the womb into seven parts.\n The baby naturally began to cry at the pain.\n Indra kept on saying, \"ma ruda,\" that is, \"don't cry.\n\" But the bay, or rather its seven parts, would not listen.\n Indra thereupon sliced up each of the seven parts into seven more sections, so that there were forty-nine sections in all.\n When these forty-nine sections were born, they came to known as the Maruts, from the words that Indra had addressed them.\n Since Diti had not been able to adhere to the conditions her husband had set, the Maruts did not kill Indra.\n They instead became Indra's followers or companions, and were treated as gods. ", "next": "9.4", "prev": "9.2", "title": "DAKSHA’S OFFSPRING"}