{"index": "9.32", "image": "resized_images/GOUTAMA AND MANIKUNDALA.png", "text": " There was a city named Bhouvana.\n In that city there lived a brahmana named Goutama.\n The brahmana had a vaishya friend named Manikundala.\n (A vaishya belongs to the third of the three classes and his primary duties are trade and agriculture).\n Goutama’s mother gave him a lot of ill advice.\n As a result of this, Goutama told Manikundala, “Let us go to other countries to trade and make profits.\n” “But my father has a lot of wealth,” replied Manikundala.\n “What is the need to obtain more wealth?\n” “You don’t have the proper perspective,” said Goutama.\n “A successful person is one who does not thrive on what is left to him by his father.\n He makes his own fortune.\n” Manikundala was convinced by Gountama’s logic.\n He did not realise that his so- called friend was out to defraud him.\n The two friends set out on their journey, Manikundala providing all the capital.\n In the course of their travels Goutama remarked, “Have you noticed how those who follow the path of dharma (righteousness) always suffer?\n They are neither wealthy nor happy.\n There seems to be no point in being righteous.\n” “Please don’t say that,” protested manikundala.\n “Happiness lies in following the path of dharma.\n Poverty and misery are inevitable, they are of no account at all.\n” The two friends argued over this, but could not decide who was right.\n They resolved to have a bet.\n They would ask the opinions of others.\n And whoever lost the bet would surrender all his wealth to the winner.\n They asked many people for their opinions.\n Naturally most people said that it was the evil who thrived and prospered.\n And it was the righteous who suffered.\n The upshot of this was that Manikundala surrendered all his wealth to Goutama.\n But Manikundala continued to praise dharma.\n “You are an utter ass,” said Goutama.\n “Haven’t you lost all your wealth to me?\n Yet you continue to praise dharma.\n” “The wealth is of no account at all,” replied Manikundala.\n “Dharma is on my side and your apparent victory is only an illusion.\n Dharma will triumph in the end.\n” The two friends decided to have another bet.\n This time it was agreed that whoever lost the bet would have his two arms chopped off.\n They again asked several people and most people said that is was adharma (evil) which triumphed.\n So Manikundala lost his two arms.\n “How does it feel now?\n” asked Goutama.\n “The same as ever,” replied Manikundala.\n “What is important is dharma.\n And dharma is on my side.\n” Goutama lost his temper at this.\n He threatened to cut off Manikundala’s head if Manikundala persisted in his praise of dharma.\n But Manikundala was unperturbed.\n The friends decided to have another bet.\n This time it was agreed that whoever lost would forfeit his life.\n Manikundala lost yet again.\n And Goutama gouged out Manikundala’s eyes and left him for dead.\n Manikundala lay on the banks of the Goutami Ganga and pondered about the fate that had befallen him.\n It became night.\n There was an image of Vishnu on the banks of the river and the rakshasa Vibhishana used to come there every night to pray to Vishnu.\n Vibhishana’s son discovered Manikundala lying there and found out from him the entire story.\n He recounted the story to his father.\n “Many years ago, I had joined Rama in his fight with Ravana,” Vibhishana told his son.\n “Ragvana’s son Meghanada shot a venomous arrow at Rama’s brother Lakshmana.\n Lakshmana fell unconscious.\n The monkey Hanumana then went to the Himalayas and brought a mountain named Grandhamadana to Lanka.\n On that mountain there was a wonderful herb named vishalyakarani which cures all illnesses.\n When Hanumana returned the mountain to the Himalayas, a bit of the vishalyakarani fell down at this spot.\n Near Vishnu’s image.\n Let us try and find it.\n We should be able to cure Manikundala.\n” Father and son hunted for the herb.\n The vishalyakarani had become a huge tree.\n They lopped off a branch and placed it on Manikundala’s chest.\n Manikundala immediately regained his eyes and arms.\n After curing Manikundala, Vibhishana and his retinue returned to Lanka.\n Manikundala began to travel.\n He eventually came to a city named Mahapura where a king named Maharaja ruled.\n Maharaja had no sons, only a daughter.\n The daughter was blind.\n Maharaja had announced that whoever cured his daughter would become his son-in-law and rule after him.\n Manikundala cured the princess with his knowledge of the vishalyakarani.\n He then married the princess and became king of Mahapura after Maharaja.\n Many years later, Goutama was brought before Manikundala by the soldiers.\n He had been arrested on the charge of committing a crime.\n Goutama had lost all his wealth by then and was no more than a beggar.\n Manikundala pardoned his friend and shared with him whatever he had.\n Such are the virtues of following the path of dharma.\n There are many tirthas along the banks of the Goutami Ganga where these wonderful incidents took place. ", "next": "9.33", "prev": "9.31", "title": "GOUTAMA AND MANIKUNDALA"}