{"index": "9.33", "image": "resized_images/KANDU.png", "text": [" There was a sage named Kandu.", " He had a hermitage on the banks of the Goutami Ganga.", " The ashrama was a beautiful place and Kandu performed very difficult tapasya there.", " In the summer Kandu meditated in the hot sun, in the monsoon he meditated on the wet ground, and in the winter he meditated dressed in wet clothing.", " Indra got sacred as a result of all this tapasya.", " He thought that the sage Kandu might want to become Indra the king of the gods.", " He therefore called an apsara named disturb Kandu’s tapasya.", " Pramlocha went to the hermitage and began to sing there in a beautiful voice.", " This disturbed Kandu and he discovered a beautiful woman wandering around in his ashrama.", " “Who are you?", "” Kandu asked the woman.", " “I have come here to pluck flowers,” replied Pramlocha.", " “I am your servant.", " I will do whatever you wish me to.", "” Kandu had fallen in love with Pramlocha and he married her.", " He forgot all about his tapasya and Indra heaved a sigh of relief.", " Years passed.", " Pramlocha wished to return to heaven, but Kandu would not let her.", " After years and years had passed, Kandu came out of his hut, looking rather distracted.", " It was then evening and Kandu was obviously going somewhere.", " “Where are you going?", "” Pramlocha asked.", " “What a stupid question!” exclaimed Kandu.", " “Can’t you see that it is now evening?", " I have got to go and observe the evening rites.", " The day has passed.", "” “What day?", "” asked Pramlocha.", " “Several days have passed and several evenings have come and gone.", "” “No, you came here this morning,” said Kandu.", " “I brought you to my hut and it is now evening, I don’t understand what you are trying to say.", " Explain yourself.", "” “It is true that I came here in the morning,” answered Pramlocha.", " “But that was a morning which dawned many years ago.", " Hundreds of years have passed since that day.", "” “How many years?", "” asked Kandu.", " “When did you come here?", "” “Sixteen hundred years, six months and three days ago,” replied Pramlocha.", " “Are you sure?", "” asked Kandu.", " “It seems like a single day to me.", "” “I am sure,” said Pramlocha.", " “I dare not lie to you.", "” “You have dislodged me from my tapasya,” responded Kandu.", " “But I will not curse you, since you have been my wife.", " Go back to heaven.", " I have to atone for my sins.", "” The sage Kandu went to Purshottama kshetra and performed penance for his sins.", " He was blessed by Vishnu.", " Kandu and Pramlocha had a daughter named Marisha.", " The Brahma Purana also describes several other tirthas.", " Most of these are on the banks of the river Goutami Ganga.", " This is now identified as the river Godavari.", " After describing these several tirthas, the text describes incidents in Krishna’s life.", " These we will skip, since they are described in much greater detail in the other Puranas. "], "next": "9.34", "prev": "9.32", "title": "KANDU"}