{"index": "9.34", "image": "resized_images/VARNASHRAMA.png", "text": " There are four varnas (classes).\n Their names are brahmana, kshatriya, vaishya and shudra.\n The duties of a brahmana are to donate alms, perform tapasya, worship the gods, perform yajnas and study the Vedas.\n To earn a living, brahmanas are authorized to teach and act as priests at sacrifices.\n The duties of kshatriya are to beat arms and protect the earth, donate alms and perform sacrifices.\n A kshatriya is also permitted to study the shastras.\n The duties of a vaishya are agriculture, animal husbandry and trade.\n That apart, vaishyas should donate alms, perform sacrifices and study the shastras.\n The duties of a shudra are to serve brahmanas.\n Shudras can also be shopkeepers and artisans.\n In times of emergency, a brahmana is allowed to adopt the livelihoods of kshatriyas or vaishyas to earn a living.\n In similar fashion, a kshatriya is permitted to adopt the livelihoods of vaishyas or shudras and a vaishya is permitted to adopt the livelihoods of shudras.\n There are four ashramas (stages of life) as well.\n The first of these is known as brahmacharya (celibate studenthood).\n During this period, the individual spends his days with his guru and studies the Vedas well.\n He has to serve his guru in proper fashion and live on alms.\n The next ashrama is that of garhasthya (householder stage).\n The individual now gets married and has children.\n He serves the gods, the sages, the ancestors and guests.\n It is householders who provide alms for sages and hermits.\n That is the reason why the householder stage is so very important.\n The third ashrama is known as vanaprastha (forest- dwelling stage).\n The individual now retires to the forest and withdraws his mind from the earthly life.\n He can leave his wife in the care of his sons or take her with him.\n He lives on roots, fruits and leaves and makes a bed for himself under the trees.\n He is not permitted to shave or cut his hair and his clothes have to be made out of bark or skins.\n The final ashrama is that of sannyasa (hermithood).\n A hermit gives up all association with the world and lives alone.\n He grows completely detached.\n He lives alone.\n He gets his food through begging.\n He is not permitted to spend more than one night in a village, or more than five nights at a time in a city. ", "next": "9.35", "prev": "9.33", "title": "VARNASHRAMA"}