{"index": "9.35", "image": "resized_images/THE CHANDALA AND THE BRAHMA-RAKSHASA.png", "text": [" A chandala is an outcast.", " On the outskirts of the city named Avanti lived a chandala.", " There was a temple of Vishnu in Avanti and the chandala was devoted to Vishnu.", " He was also a good singer.", " Ekadashi tithi is the eleventh lunar day.", " Every month, on ekadashi tithi, the chandala would fast during the day.", " At night he would go to Vishnu’s temple and sing praises of Vishnu.", " He never failed to observe this ritual.", " The river Kshipra (Shipra) flowed by the city of Avanti.", " On one particular night, on ekadashi tithi, the chandala went to the banks of the river to collect some flowers for worshipping Vishnu.", " On the banks of the river there was a tree and on that tree there lived a brahmarakshasa (demon).", " As soon as the demon saw the chandala, it wished to devour him.", " “Please not tonight,” said the chandala.", " “I have to worship Vishnu throughout the night.", " Let me go now.", "” “Not on you life,” replied the demon.", " “I have not eaten for ten days and I am famished.", " I can’t let you go.", "” “Please,” said the chandala, “let me go.", " I promise that I will come back once the prayers are over.", " You will then be free to do with me as you will.", "” The demon let the chandala go.", " The chandala went to the temple.", " He worshipped Vishnu and spent the night in singing Vishnu’s praises.", " Next day, he returned to the demon.", " “I am indeed surprised,” said the demon.", " “You are very truthful.", " You can’t be a chandala.", " You must be a brahmana.", " Answer my questions.", " What did you do all night?", "” “I stood outside Vishnu’s temple and sang his praise,” replied the chandala.", " “For how long have you been doing this?", "” asked the demon.", " “For twenty years,” was the chandala’s reply.", " “You have acquired a lot of punya (store of merit) through this,” said the demon.", " “Please grant me one night’s punya, I am sinner.", "” “No,” replied the chandala.", " “I will not part with my punya.", " I have given you my body, eat me if you will.", " But the punya is mine own.", "” “Very well then,” said the demon.", " “Give me two hours” worth of punya.", " I am a sinner.", "” “I have told you I will not give you any of my punya,” replied the chandala.", " “But what is your sin?", "” The brahmarakshasa related his story.", " His name was Somasharma and he was the son of Devasharma.", " Devasharma was a righteous brahmana.", " But Somasharma fell into evil ways.", " A brahmana is not authorised to act as a priest in a sacrifice before he has had his sacred- thread ceremony (upanayana).", " But Somasharma became a priest at a yajna even though his upanayana had not been held.", " As a result of this sin, when he died, he became a demon.", " The chandala was stirred to pity at this sad story and parted with some of his punya.", " The demon was delighted and expressed his gratitude.", " He went to a tirtha and performed penance.", " Thus it was that the demon was freed.", " What about the chandala?", " He returned home and then left for a tour of all the sacred places of pilgrimage.", " At one such tirtha.", " He remembered the story of his earlier life.", " He used to be a hermit well-versed in the Vedas and the shastras.", " He used to beg alms for a living.", " Once he had obtained some alms.", " But some thieves were then in the process of stealing cows, and the hooves of the cows raised a cloud of dust.", " The dust fell onto the food and the hermit threw away the alms in disgust.", " Since he had thrown away alms, he was born as a chandala.", " After performing penance for this sin, the chandala was pardoned. "], "next": "10", "prev": "9.34", "title": "THE CHANDALA AND THE BRAHMA-RAKSHASA"}