{"index": "9.4", "image": "resized_images/PRITHU.png", "text": [" In Dhruva's line there was a king named Anga, Anga was religious and followed the righteous path.", " But unfortunately, Anga's son Vena inherited none of the good qualities of his father.", " Vena's mother was Sunitha and she happened to be the daughter of Mrityu.", " Mrityu was notorious for his evil ways and deeds.", " Vena spent a lot of time with his maternal grandfather and picked up these evil characteristics.", " Vena gave up the religion that was laid down in the Vedas and stopped all yajnas.", " He instructed his subjects that he alone was to be worshiped.", " The sages led by Marichi came to Vena to try and persuade him to mend his ways.", " But Vena was in no mood to listen.", " He insisted that there was no one equal to him in the whole universe.", " The sages realized that Vena was a lost cause.", " They physically caught hold of Vena and began to knead his right thigh.", " From this kneading thee emerged a horrible looking creature.", " It was a dwarf and its complexion, was extremely dark.", " The sage Atri was so aghast at the dwarf's appearance that he blurted out, \"nishida\", which means \"sit\".", " From this, the dwarf came to be known as nishada.", " The race of nishadas became hunters and fishermen, and lived in the Vindhya mountains.", " From them were also descended uncivilized races like tusharas and tunduras.", " The evil that was in Vena's body and mind came out with the emergence of the nishada.", " When the sages began to knead Vena's right arm, Prithu emerged.", " He shone like a flaming fire and his energy lit up the four directions.", " He held a bow in his hand and he was clad in beautiful armour.", " As soon as Prithu was born, Vena died.", " All the rivers and the oceans arrived with their waters and their jewels to anoint Prithu as the king.", " The gods and the sages also came for the coronation.", " Brahma himself crowned Prithu the king of the earth.", " He also took the opportunity to apportion out the lordships of other parts of the universe.", " Soma was appointed lord over creepers, herbs, starts (nakshatras), planets (grahas), sacrifices, meditation (tapasya) and over the first of the four classes (brahmanas).", " Varuna became lord of the oceans, Kubera of all the kings, Vishnu of the adityas, Agni of vasus, Daksha of all Prahlada of daityas and danavas, Yama of the pritris (ancestors), Shiva of yakshas, rakshasas and pishachas (ghosts), and Himalaya of the mountains.", " The ocean (samudra) was made the lord of all rivers.", " Chitraratha of gandharvas, Vasuki of nagas, Takshaka of sarpas, Garuda of birds, the tiger of deer, Airavata of elephants, Ucchaihshrava of horses, the bull of cows and the ashvattha tree (a banyan) of all trees.", " Brahma also appointed four overlords (dikapalas) for the four directions.", " To the east there was Sudhanva, to the south Shankhapada, to the west Ketumana and to the north Hiranyaroma.", " Prithu was a king who ruled the earth well.", " During his reign, the earth was laden with foodgrains.", " The cows were full of milk and the subjects were happy.", " To glorify King Prithu, the sages performed a sacrifice and from this sacrifice there emerged two races known as the sutas and the magadhas should sing praises in honour of Prithu.", " \"But what praise will we sing?", "\" asked the sutas and the magadhas.", " \"Prithu is still young.", " He has not done much that can be praised\".", " \"That may be true,\" replied the sages.", " \"But he will do wonderous deeds in the future.", " Sing praises of those wonderful deeds.", " We will tell you about them.", "\" Having learnt of these future deeds from the sages, the sutas and the magadhas began to compose songs and chant praises in honour of Prithu.", " These stories were related throughout the earth.", " Some of Prithu's subjects heard these stories and came to see Prithu.", " \"King,\" they said.", " \"We have heard of your great deeds.", " But we find it difficult to make a living.", " Please indicate to us our habitations on earth.", " And tell us where we may be able to get the food we need for subsistence.", "\" King Prithu picked up his bow and arrow.", " He decided to kill the earth, since the earth was not yielding foodgrains to his subjects.", " The earth adopted the form of a cow and began to flee.", " But wherever the earth went, Prithu followed with his bow and arrow.", " He followed the earth to the heaven and to the underworld.", " Finally, in desperation, the earth started to pray to Prithu.", " \"King,\" she said, \"please control your anger.", " I am a woman.", " Killing me will only mean a sin for you.", " Besides, what purpose will killing me serve?", " Your subjects will then be without a place to live in.", " There must be some other way of ensuring that your subjects can make a living.", " The earth then herself offered a solution and King Prithu did her bidding, With his bow, he leveled out the earth.", " The plains could now be used for villages and cities and for agriculture and animal husbandry.", " The plains could now be used for villages and cities and for agriculture and animal husbandry.", " The mountains were gathered together in select places, instead of being littered over whole earth.", " Earlier, Prithu's subjects had lived off fruits and roots.", " Now Prithu milked the earth (in her form of a cow) and obtained the seeds of foodgrains on which people could live. Because of Prithu's deeds, the earth came to be known as prithivi. "], "next": "9.5", "prev": "9.3", "title": "PRITHU"}