{"index": "9.6", "image": "resized_images/THE SUN AND THE SOLAR DYNASTY.png", "text": [" You have probably forgotten by now that Kashyapa and Aditi had a son named Vivasvana.", " This was the sun god, also known as Surya or Martanda.", " Surya was married to Samjna, Vishvakarma's daughter.", " They had two sons.", " The fist son was Vaivasvata Manu and the second son was Yama or Shraddhadeva, the god of death.", " Yama had a twin sister named Yamuna.", " The sun's energy was so strong that Samjna could not bear to look at her husband.", " Through her powers, she created an image from her own body that looked exactly like her.", " This image was called Chhaya (shadow).", " Samjna told Chhaya, \"I cannot bear the energy of my husband, I am going off to my father's house.", " Stay here, pretend to be Samjna and look after my children.", " Under no circumstances tell anyone, certainly not my husband, that your are not Samjna.", "\" \"I will do as you have asked me to,\" replied Chhaya.", " \"But the moment someone curses me or pulls me by the hair, I shall be forced to reveal the truth.", "\" Samjna went to her father Vishvakarma kept asking her to return to her husband.", " But this Samjna refused to do.", " Instead, she went to the land known as Uttara Kuru and started to live there as a mare.", " Meanwhile, Surya, who had not realized that Samjna had been replaced by Chhaya, had two sons through Chhaya.", " They were named Savarni Manu and Shani (Saturn).", " As soon as her own children were born, Chhaya no longer displayed as much of love for Samjna's children as she used to do.", " Vaivasvata Manu was a quiet sort of person and he ignored the implied neglect.", " But Yama was not the tolerant.", " Besides, he was also younger.", " He raised his leg to kick Chhaya.", " At this, Chhaya cursed Yama that his legs would fall off.", " Yama went and complained to Surya.", " \" I have not really kicked her,\" he said.", " \"I only threatened to.", " And does a mother ever curse her children?", "\" \"I can't undo the curse, \" replied Surya.", " \"At best, I can reduce its severity.", " Your legs will not actually fall off.", " Some of the flesh from your legs will fall off onto the earth and create worms.", " Thereby, you will be freed of your curse.", "\" But nevertheless, Surya felt that there was some truth in Yama's asking whether a mother would ever curse her children.", " He taxed Chhaya with the truth, but Chhaya would not reveal anything Surya then grasped her by the hair and threatened to curse her.", " Since her conditions were now violated, Chhaya blurted out the truth.", " In an extremely angry mood, Surya dashed off to Vishvakarma's house.", " Vishvakarma tried to cool him down.", " \"it is all because of your exercises energy that this has happened,;", " exclaimed Vishvakarma.", " \"If you permit, I will shave off some of the extra energy.", " Then Samjna will be able to look at you.", "\" Surya agreed to this proposition.", " With the shaved off energy, Vishvakarma manufactured Vishnu's chakra (a weapon like a bladed discus).", " Surya found out that Samjna was in Uttara Kuru in the form of a mare.", " He joined her there in the form of a horse.", " As horse, they had two sons named Nasatya and Dasra.", " Since ashva means horse, the sons were also known as the two Ashvinish and became the physicians of the gods.", " Surya and Samjna then gave up their equine forms and lived happily ever after. "], "next": "9.7", "prev": "9.5", "title": "THE SUN AND THE SOLAR DYNASTY"}