{"index": "9.8", "image": "resized_images/KUBALASHVA.png", "text": [" Kubalashva was one of the kings descended from Kakutstha.", " Kubalashva's father was named Vrihadashva.", " After Vrihadashva had ruled for many years, he desired to retire to the forest.", " He therefore prepared to hand over the kingdom to his son Kubalashva.", " But learning of King Vrihadashva's resolve, a sage named Utanka came to meet the king.", " \"Don't go to the forest right now\", Utanka told the king.", " My hermitage (ashrama) is on the shores of the ocean and is surrounded by sand in all directions.", " A strong rakshasa named Dhundhu lives under the sand.", " He is so strong that even the gods have been unable to kill him.", " Once every year, Dhundhu exhales his breath and this raises a tremendous cloud of sand and dust.", " For an entire week the sun remains shrouded in dust and for the whole week, there are earthquakes as a result of Dhundhu's exhalation.", " This is disturbing my mediation (tapasya) and you can't very well go away to the forest without first doing something about Dhundhu.", " Only you are capable of killing him.", " I have accumulated a lot of power as a result of my tapasya and I will give this to you if you kill Dhundhu.", "\" Vrihadashva told Utanka that there was no need for Vrihadashva himself to kill Dhundhu.", " He would go to the forest as he had decided.", " His son Kubalashva was perfectly capable of killing Dhundhu and would accompany Utanka.", " Kubalashva and his hundred sons went to the shores of the ocean where all the sand was.", " Kubalashva asked his sons to start digging so that they might find Dhundhu.", " Dhundhu attacked Kubalashva's sons and killed all of them but three.", " The three who escaped were named Dridashva, Chandrashva and Kapilashva.", " But Dhundhu himself was killed by Kubalashva.", " As a result of this great feat, Kubalashva came to be known as Dhundhumara.", " The sage Utanka blessed Kubalashva and by the sage's blessings, Kubalashva's dead sons went straight to heaven. "], "next": "9.9", "prev": "9.7", "title": "KUBALASHVA"}