{"index": "9", "image": "resized_images/BRAHMA VAIVART PURANA.png", "text": [" It’s the twelfth Purana.", " It contains four parts- Brahma khand, Prakriti khand, Ganesh khand and Shri Krishna Janma khand.", " In Naimisharanya Tirth, addressing a gathering of great sages like Shaunak etc.", ", Sutaji has described this Purana as the marvelous creation.", " This Purana describes the plays of the Lord Krishna and Radha in considerable detail.", " Thus, it is a basic source of inspiration for all the subsequent treatises that depict the life of Radha.", " It is only Purana that exclusively describes the episodes from the life of Radha, the most beloved lady of Lord Shri Krishna.", " Brahma khand:", " Creation of the universe.", " Origin of Narayana from the body of Shri Krishna.", " Origin of Radha in Rasamandal.", " Origin of Gopas, Gopis and cows from the bodies of Radha and Krishna.", " Creation of all other animate-inanimate world.", " Prakriti khand:", " Greatness of Durga, Radha, Lakshmi, Saraswati and Savitri in the creation of the world.", " Tales of Savitri-Satyavaan, Surabhi, Swaha and Swadha.", " Description of the clan of Surath.", " Tale of Ganga.", " Tales from Ramayana.", " Curse of Durvasa on Indra.", " Worship of Lakshmi.", " Ganesh khand:", " Mainly discusses about the greatness of Lord Ganesh.", " Also contains tales of Jamadagni, Karteveerya, Parashurama etc.", " Shri Krishna khand:", " Describes the life and plays of Lord Shri Krishna, under the heads of Braj leela, Mathura leela, reunion of Radha and Krishna.", " Migration of the residents of Gokul to Gokula.", " In the opinion of this Purana, there are ten features of Maha Purana.", " These are:", " creation, preservation, Pralaya (destruction), fostering, karma, description of lust, description of each of the fourteen Manus and their dynasties.", " Description of salvation, recitation of the virtues of Shri Hari and description of the glory of the gods.", " But Puranas with five features and Upa Puranas has following common features:", " creation, destruction, description of Chandra and Surya dynasties and their kings and description of the fourteen Manus.", " This Purana consists of 32 chapters: "], "next": "9.1", "prev": "8.11.12", "title": "BRAHMA VAIVART PURANA"}